// Множества. Запис и дефиниции в Z нотацията - to be corrected
export const mysql3 = [
  {
    index: 1,
    question: "Кое от следните описва множеството?",
    choices: [
      "Добре дефинирана колекция от отделни обекти",
      "Колекция от дублирани стойности",
    ],
    correctAnswer: "Добре дефинирана колекция от отделни обекти",
    imageURL: null
  },
  {
    index: 2,
    question: "Кой от следните примери представлява множество?",
    choices: [
      "{ червено, 1, 2, 3 }",
      "{ Мария, синьо, да, не }",
      "{ 1, 2, 3, червено }",
      "{ 1, 3, 5, 7, ... }",
    ],
    correctAnswer: "{ 1, 3, 5, 7, ... }",
    imageURL: null
  },

  {
    index: 3,
    question: "Кое от следните НЕ е допустимо множество по дефиниция?",
    choices: [
      "{ 1, 2, 3, 4, ... }",
      "{ Иван, Никола, Мария }",
      "{ yes, no }",
      "{ red, 1, 2, 3 }"
    ],
    correctAnswer: "{ red, 1, 2, 3 }",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое от следните твърдения НЕ е вярно относно множествата с дефинирани имена?",
    choices: [
      "Множеството без елементи е известно като 'празно множество' - ∅.",
      "Множеството N съдържа всички естествени числа { 0, 1, ... }.",
      "Множеството Z включва цели числа {... -2, -1, 0, 1, 2, ... }.",
      "Множеството N представлява празно множество."
    ],
    correctAnswer: "Множеството N представлява празно множество.",
    imageURL: null
  },
  {
    index: 5,
    question: "Кое от следните твърдения НЕ е вярно относно операциите с множества?",
    choices: [
      "Сечението A ∩ B съдържа само елементите, които са общи за множества A и B.",
      "Обединението A U B съдържа всички елементи от множества A и B без повторения.",
      "Разликата A \\ B съдържа елементите, които са в A, но не и в B.",
      "A = B , ако A ⊆ B и B ⊆ A",
      "Ако A = B, то A е подмножство на B, но B не е подмножство на A."
    ],
    correctAnswer: "Ако A = B, то A е подмножство на B, но B не е подмножство на A.",
    imageURL: null
  },
  {
    index: 6,
    question: "Кое от следните твърдения НЕ е вярно относно основните аксиоми и закони в множествата?",
    choices: [
      "Всеки елемент x принадлежи на множеството {X}, ако x ∈ {X}",
      "Съществува празно множество, което не съдържа никакви елементи: Ø.",
      "Комутативният закон гласи, че A ∩ B = B ∩ A и A U B = B U A.",
      "Горните твърдения са неверни."
    ],
    correctAnswer: "Горните твърдения са неверни.",
    imageURL: null
  },
  {
    index: 7,
    question: "Кое от следните твърдения НЕ е вярно относно комутативния, асоциативния и дистрибутивния закон в множествата?",
    choices: [
      "Комутативният закон гласи, че: A ∩ B = B ∩ A ; A ∪ B = B ∪ A.",
      "Асоциативният закон гласи, че: A ∩ (B ∩ C) = (A ∩ B) ∩ C ; (A ∪ (B ∪ C) = (A ∪ B) ∪ C)",
      "Дистрибутивният закон: (A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C))",
      "Горните твърдения са неверни."
    ],
    correctAnswer: "Горните твърдения са неверни.",
    imageURL: null
  },
  {
    index: 8,
    question: "Кое от следните твърдения НЕ е вярно относно степенното множество?",
    choices: [
      "Степенното множество на S съдържа всички подмножества на S.",
      "Степенното множество се обозначава с P(S) - (Power sets)",
      "Степенното множество не включва празното множество."
    ],
    correctAnswer: "Степенното множество не включва празното множество.",
    imageURL: null
  },
  {
    index: 9,
    question: "Кое от следните твърдения НЕ е вярно относно Декартовото произведение?",
    choices: [
      "Декартовото произведение е множество от n-торки, които представляват подредени списъци от елементи.",
      "Декартовото произведение на две множества a и b се обозначава като a x b.",
      "Декартовото произведение включва само наредени двойки от едно и също множество.",
      "Компонентите в Декартовото произведение са подредени в определен ред - a x b ≠ b x а "
    ],
    correctAnswer: "Декартовото произведение включва само наредени двойки от едно и също множество.",
    imageURL: null
  },
  {
    index: 10,
    question: "Кое от следните твърдения НЕ е вярно относно дефинирането на типове в Z нотацията?",
    choices: [
      "Типът на обектите е максималното множество в границите на разглежданата спецификация.",
      "Всеки обект x може да бъде асоцииран с множество типове.",
      "В Z нотацията основният тип е множеството на целите числа Z.",
      "Други типове могат да се изграждат чрез основни типове или чрез конструктори като степенно множество и Декартово произведение."
    ],
    correctAnswer: "Всеки обект x може да бъде асоцииран с множество типове.",
    imageURL: null
  },

  {
    index: 12,
    question: "Какво представлява операцията обединение (union) на множества?",
    choices: [
      "Връща само общите елементи на две множества",
      "Връща всички елементи от две множества, без дублиране",
    ],
    correctAnswer: "Връща всички елементи от две множества, без дублиране",
    imageURL: null
  },
  {
    index: 13,
    question: "Как се нарича множеството на всички подмножества на дадено множество S?",
    choices: [
      "Декартово произведение на S",
      "Картезианско множество на S",
      "Степенно множество на S",
      "Същностно множество на S"
    ],
    correctAnswer: "Степенно множество на S",
    imageURL: null
  },

  {
    index: 17,
    question: "Как се обозначава принадлежността на елемент към множество?",
    choices: [
      "∩",
      "∪",
      "∈",
      "⊂"
    ],
    correctAnswer: "∈",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво е 'кардиналност' на множество?",
    choices: [
      "Броят на елементите в дадено множество",
      "Типът на елементите в дадено множество",
    ],
    correctAnswer: "Броят на елементите в дадено множество",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво означава, че едно множество е подмножество на друго?",
    choices: [
      "Първото множество има поне един елемент от второто множество",
      "Всички елементи от първото множество са елементи и на второто множество",
    ],
    correctAnswer: "Всички елементи от първото множество са елементи и на второто множество",
    imageURL: null
  },
  {
    index: 20,
    question: "Коя нотация се използва за обозначаване на Декартовото произведение?",
    choices: [
      "P(A)",
      "A ∩ B",
      "A x B",
      "A ∪ B"
    ],
    correctAnswer: "A x B",
    imageURL: null
  },
  {
    index: 21,
    question: "Какво описва предикатът в множество?",
    choices: [
      "Свойства, които елементите на множеството трябва да притежават",
      "Всички възможни елементи на дадено множество",
    ],
    correctAnswer: "Свойства, които елементите на множеството трябва да притежават",
    imageURL: null
  },
  {
    index: 22,
    question: "Какво представлява операцията разлика на множества (A \\ B)?",
    choices: [
      "Елементи, които са в A и B",
      "Елементи, които са само в A и не са в B",
      "Елементи, които са само в B",
      "Елементи, които са в A и/или B"
    ],
    correctAnswer: "Елементи, които са само в A и не са в B",
    imageURL: null
  },

  {
    index: 24,
    question: "Коя е аксиомата на принадлежност в теорията на множествата?",
    choices: [
      "∀x ⦁ x ∈ {X}",
      "∀x ⦁ x ∉ Ø",
      "∀x ⦁ x ∈ Ø",
      "∀x ⦁ x = {X}"
    ],
    correctAnswer: "∀x ⦁ x ∈ {X}",
    imageURL: null
  },
  {
    index: 25,
    question: "Коя от следните операции върху множества е комутативна?",
    choices: [
      "Обединение (union)",
      "Разлика (difference)",
      "Картезианско произведение",
      "Определяне (comprehension)"
    ],
    correctAnswer: "Обединение (union)",
    imageURL: null
  },

  {
    index: 30,
    question: "Кое от следните е вярно за подмножество?",
    choices: [
      "Всеки елемент от подмножеството принадлежи на множеството",
      "Подмножеството съдържа всички елементи на множеството",
      "Подмножеството има точно един елемент",
      "Подмножеството винаги е празно"
    ],
    correctAnswer: "Всеки елемент от подмножеството принадлежи на множеството",
    imageURL: null
  }
];