// Z нотация. Логики и доказателства
export const mysql2 = [
    {
        index: 1,
        question: "Какви са основните елементи на формалната система?",
        choices: [
            "Азбука и речник",
            "Граматични правила и лексикални единици",
            "Теореми и аксиоми",
            "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        ],
        correctAnswer: "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        imageURL: null
    },
    {
        index: 2,
        question: "Кое от следните описва елементи на формалния език?",
        choices: [
            "Азбука и граматични правила",
            "Състояния на системата и структури от данни",
            "Аксиоми и правила за извод",
            "Проектиране на системи и данни"
        ],
        correctAnswer: "Азбука и граматични правила",
        imageURL: null
    },
    {
        index: 3,
        question: "Какво включва системата за извод/заключение (семантика) във формалната система?",
        choices: [
            "Граматични правила и азбука",
            "Аксиоми и правила за извод",
            "Данни и свойства",
            "Състояния на системата и операции"
        ],
        correctAnswer: "Аксиоми и правила за извод",
        imageURL: null
    },
    {
        index: 4,
        question: "Какво е основната цел на формалната спецификация в софтуерните системи?",
        choices: [
            "Да създаде кратки описания на различни езици",
            "Да синтезира нови програмни езици",
            "Да опише математическите обекти спрямо особеностите на проектираната система",
            "Да дефинира граматичните правила за състояния на системите"
        ],
        correctAnswer: "Да опише математическите обекти спрямо особеностите на проектираната система",
        imageURL: null
    },
    {
        index: 5,
        question: "Кои аспекти на проектираната система трябва да бъдат описани във формалната спецификация?",
        choices: [
            "Граматични правила и синтаксис",
            "Състояния на системата, структури от данни, техни свойства и операции",
            "Аксиоми и правила за извод",
            "Релации между обектите и системните състояния"
        ],
        correctAnswer: "Състояния на системата, структури от данни, техни свойства и операции",
        imageURL: null
    },
    {
        index: 6,
        question: "Кои две теории са в основата на всяка софтуерна спецификация в Z нотацията?",
        choices: [
            "Теорията на графите и теорията на числата",
            "Теорията на информацията и теорията на автоматите",
            "Теорията на вероятностите и линейната алгебра",
            "Математическата логика и теорията на множествата",
        ],
        correctAnswer: "Математическата логика и теорията на множествата",
        imageURL: null
    },
    {
        index: 7,
        question: "Какво е Z нотацията?",
        choices: [
            "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
            "Графични диаграми за визуализиране на състоянието на системата",
            "Алгоритми за оптимизация на системата",
            "Методи за тестване на производителността на системата"
        ],
        correctAnswer: "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
        imageURL: null
    },
    {
        index: 6,
        question: "За какво може да се използва езикът на схемите в Z нотацията?",
        choices: [
            "За проектиране на графичен интерфейс и визуализиране на данни",
            "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
            "За описание на алгоритми и тяхната сложност",
            "За дефиниране на комуникационни протоколи и обмен на съобщения"
        ],
        correctAnswer: "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
        imageURL: null
    },
    {
        index: 7,
        question: "Кои са двете основни формални системи, използвани в логиката за описание на софтуерни системи?",
        choices: [
            "Теория на графите и теория на числата",
            "Логика на вероятностите и теория на игрите",
            "Пропозиционна логика и предикатна логика",
            "Автоматна теория и лингвистика"
        ],
        correctAnswer: "Пропозиционна логика и предикатна логика",
        imageURL: null
    },
    {
        index: 8,
        question: "Кой не е от основни методи за доказателство, използвани за тези системи?",
        choices: [
            "Дедукция (Natural deduction)",
            "Доказателство чрез опровергаване (Proof by contradiction)",
            "Доказателство чрез анализ на случаи (Proof by case analysis)",
            "Разсъждение чрез равенства (Equational reasoning)",
            "Хеширане на данни",
        ],
        correctAnswer: "Хеширане на данни",
        imageURL: null
    },
    {
        index: 9,
        question: "Какво представлява пропозиционната логика?",
        choices: [
            "Метод за създаване на сложни математически уравнения",
            "Теория за анализа на данни чрез хеширане",
            "Система за измерване на логически изводи чрез нечетливи изрази",
            "Езикът на логиката, базиран на твърдения(propositions), които могат да бъдат или верни, или неверни",
            "Метод за проверка на логическа последователност с помощта на символи"
        ],
        correctAnswer: "Езикът на логиката, базиран на твърдения(propositions), които могат да бъдат или верни, или неверни",
        imageURL: null
    },
    {
        index: 10,
        question: "Твърдението е изявление (изказване) за предполагаем факт. То е или вярно или невярно, но никога и двете. Кое от следните твърдения не е пример за пропозиционно твърдение?",
        choices: [
            "Портокалът е плод",
            "Паролата е осемзнакова символна поредица",
            "Пет е по-голямо от четири",
            "Четири е по-малко от пет",
            "Ще си купим ли картофи днес?"
        ],
        correctAnswer: "Ще си купим ли картофи днес?",
        imageURL: null
    },
    {
        index: 11,
        question: "Кой знак не е от знаците на пропозиционната логика?",
        choices: [
            "∧ (конюнкция - 'и')",
            "∨ (дизюнкция - 'или')",
            "¬ (отрицание - 'не')",
            "→ (импликация - 'ако... то')",
            "<- (обърната импликация - '..., ако')",
            "↔ (еквиваленция - 'ако и само ако')",
            "↓ (нито, нито, свързано отрицание, NOR)",
            "↑ (не двете, отрицание на конюнкцията, NAND)",
            "% (модулно деление)"

        ],
        correctAnswer: "% (модулно деление)",
        imageURL: null
    },
    {
        index: 12,
        question: "Кой оператор има най-висок приоритет в пропозиционната логика?",
        choices: [
            "¬ (отрицание - 'не')",
            "∧ (конюнкция - 'и')",
            "∨ (дизюнкция - 'или')",
            "→ (импликация - 'ако... то')",
            "↔ (еквиваленция - 'ако и само ако')"
        ],
        correctAnswer: "¬ (отрицание - 'не')",
        imageURL: null

    },
    {
        index: 13,
        question: "Какво означава всеки примитивен символ (p, q, r, ...) в пропозиционната логика?",
        choices: [
            "Комбинация от сложни логически оператори",
            "Програмен код за логически операции",
            "Интерпретация на математическа функция",
            "Свързано твърдение, което винаги е вярно",
            "Твърдение, което се свързва със съответната си стойност на истинност: истина (t) или лъжа (f)",
        ],
        correctAnswer: "Твърдение, което се свързва със съответната си стойност на истинност: истина (t) или лъжа (f)",
        imageURL: null
    },
    {
        index: 14,
        question: "Как се определя истинността на сложни твърдения в пропозиционната логика?",
        choices: [
            "От истинността на съставящите ги твърдения",
            "От броя на логическите оператори",
            "От стойността на най-сложното твърдение",
            "От контекста на изказването",
            "От реда на операциите"
        ],
        correctAnswer: "От истинността на съставящите ги твърдения",
        imageURL: null
    },
    {
        index: 15,
        question: "Каква е стойността на истинност за примитивния символ 'p', ако 'Днес е ден от седмицата'?",
        choices: [
            "Истина (t)",
            "Лъжа (f)",
            "Неопределена",
            "Зависи от другите твърдения",
            "Трябва да се провери"
        ],
        correctAnswer: "Истина (t)",
        imageURL: null
    },
    {
        index: 16,
        question: "Какво представлява тавтологията в пропозиционната логика?",
        choices: [
            "Твърдение, което винаги е невярно",
            "Твърдение, което винаги е вярно",
            "Твърдение, което е нито истина, нито лъжа",
            "Твърдение, което е вярно само при определени условия",
            "Твърдение, зависещо от броя на операторите"
        ],
        correctAnswer: "Твърдение, което винаги е вярно",
        imageURL: null
    },
    {
        index: 17,
        question: "Кое от следните твърдения е пример за противоречие (contradiction, винаги не е вярно)?",
        choices: [
            "p ∧ ¬p",
            "p ∨ ¬p",
            "p => (q => p)",
            "p ∧ (p => q) => q",
            "¬p => p ∧ q"
        ],
        correctAnswer: "p ∧ ¬p",
        imageURL: null
    },
    {
        index: 18,
        question: "Кое от следните твърдения е случайност (contingency)?",
        choices: [
            "Твърдение, което винаги е вярно",
            "Твърдение, което винаги е невярно",
            "Твърдение, което е нито истина, нито лъжа",
            "Твърдение, което зависи от други твърдения",
            "Твърдение, което се променя в зависимост от стойностите на p и q"
        ],
        correctAnswer: "Твърдение, което е нито истина, нито лъжа",
        imageURL: null
    },
    {
        index: 19,
        question: "Кое твърдение е тавтология?",
        choices: [
            "p ∨ ¬p",
            "p ∧ ¬p",
            "p => ¬q",
            "¬p => p ∧ q",
            "p ∧ (p => q) => q"
        ],
        correctAnswer: "p ∨ ¬p",
        imageURL: null
    },
    {
        index: 20,
        question: "Какво НЕ е вярно относно значението на доказателството за повишаване качеството на софтуера?",
        choices: [
            "Доказателството помага в изясняването на системата и идентифицира скритите допускания",
            "Доказателството показва, че проектът е верен и обяснява защо е верен",
            "Доказателството осигурява, че имплементираната част от кода се държи като нейната спецификация",
            "Доказателството не оказва влияние върху качеството на софтуера",
            "Доказателството е приложимо при използване на формалните методи в практиката"
        ],
        correctAnswer: "Доказателството не оказва влияние върху качеството на софтуера",
        imageURL: null
    },
    {
        index: 21,
        question: "Какво означава, че твърдението W е семантично следствие на списъка P 'P |= W '?",
        choices: [
            "W е вярно, когато твърденията от списъка P са истина",
            "W е вярно независимо от стойностите на P",
            "W е винаги невярно, когато P е истина",
            "W може да бъде доказано само чрез индукция",
            "W не зависи от логическите оператори в P"
        ],
        correctAnswer: "W е вярно, когато твърденията от списъка P са истина",
        imageURL: null
    },
    {
        index: 22,
        question: "Кой е верният начин за доказване на следствието (p ⋀ q) |- (p v q)?",
        choices: [
            "p ∧ q; premise; p ∧-elimination; p ∨ q; ∨-introduction",
            "p ∨ q; premise; p ∨-elimination; p ∧ q; ∧-introduction",
            "p ∧ q; premise; p ∨ q; ∨-introduction",
            "p; premise; q; premise; p ∧ q; ∧-introduction",
            "p; premise; q; premise; p ∨ q; ∨-introduction"
        ],
        correctAnswer: "p ∧ q; premise; p ∧-elimination; p ∨ q; ∨-introduction",
        imageURL: null
    },
    {
        index: 22,
        question: "Кое от следните НЕ е основен метод за доказателство, използван за тези системи?",
        choices: [
            "Дедукция (Natural deduction)",
            "Доказателство чрез опровергаване (Proof by contradiction)",
            "Доказателство чрез анализ на случаи (Proof by case analysis)",
            "Разсъждение чрез равенства (Equational reasoning)",
            "Хеширане на данни"
        ],
        correctAnswer: "Kеширане на данни",
        imageURL: null
    },
    {
        index: 23,
        question: "Какво е необходимо, за да завършим системата на дедукция в пропозиционните изчисления?",
        choices: [
            "Нуждаем се от множество от правила за извод",
            "Необходимо е само да доказваме факти",
            "Трябва да съществуват единствено заключения",
            "Трябва да имаме единствена предпоставка",
            "Не са нужни правила за извод"
        ],
        correctAnswer: "Нуждаем се от множество от правила за извод",
        imageURL: null
    },
    {
        index: 24,
        question: "Каква е връзката между предпоставката и заключението в дедукцията?",
        choices: [
            "Истинността на заключението е следствие на истинността на предпоставката",
            "Заключението е независимо от предпоставките",
            "Предпоставките не влияят на заключението",
            "Истинността на предпоставката зависи от заключението",
            "Предпоставките и заключенията са идентични"
        ],
        correctAnswer: "Истинността на заключението е следствие на истинността на предпоставката",
        imageURL: "https://lawschooli.com/wp-content/uploads/2014/01/conclusion-housedog-1024x5851.png"
    }

];