
// формална система
export const mysql1 = [
    {
        index: 1,
        question: "Какво представлява МОДЕЛЪТ в контекста на изследванията?",
        choices: [
            "Изображение на обекта на изследване",
            "Опростено представяне на обекта на изследване във форма, различна от реалното му съществуване.",
        ],
        correctAnswer: "Опростено представяне на обекта на изследване във форма, различна от реалното му съществуване.",
        imageURL: null
    },
    {
        index: 2,
        question: "Каква е основната цел на модела при изследването на обекти?",
        choices: [
            "Да отразява обекта в неговата реална форма",
            "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване."
        ],
        correctAnswer: "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване.",
        imageURL: null
    },
    {
        index: 3,
        question: "Каква е ролята на моделите в инженерството?",
        choices: [
            "Да представят системата в нейната физическа форма",
            "Инженерството зависи от използването на точни модели за описание на разглежданите системи.",
        ],
        correctAnswer: "Инженерството зависи от използването на точни модели за описание на разглежданите системи.",
        imageURL: null
    },
    {
        index: 4,
        question: "Кое не е част основните задачи на моделирането?",
        choices: [
            "Абстракция",
            "Анализ и познание",
            "Дефиниране и проверка на връзките и взаимодействията",
            "Проектни решения",
            "Тестване на системата"
        ],
        correctAnswer: "Тестване на системата",
        imageURL: null
    },
    {
        index: 5,
        question: "Какво представлява моделът на софтуерна система?",
        choices: [
            "Физическа реализация на софтуерната система",
            "Абстракция на системата или на част от нея: спецификация на изискванията, проект, код, тест, поведение на системата",
        ],
        correctAnswer: "Абстракция на системата или на част от нея: спецификация на изискванията, проект, код, тест, поведение на системата",
        imageURL: null
    },
    {
        index: 6,
        question: "Какви средства се използват за представяне на модел на софтуерна система?",
        choices: [
            "Текстови документи и код",
            "Твърдения, формули, математическа символика и схеми",
        ],
        correctAnswer: "Твърдения, формули, математическа символика и схеми",
        imageURL: null
    },
    {
        index: 7,
        question: "Защо са необходими моделите?",
        choices: [
            "За описание, експериментиране, тестване и проверка на проекта преди реализация",
            "За финализиране на софтуерния код",
        ],
        correctAnswer: "За описание, експериментиране, тестване и проверка на проекта преди реализация",
        imageURL: null
    },
    {
        index: 8,
        question: "Какви аспекти могат да представят моделите?",
        choices: [
            "Само софтуерни компоненти",
            "Средата, хардуер, неизвестни части или софтуер на трети лица",
        ],
        correctAnswer: "Средата, хардуер, неизвестни части или софтуер на трети лица",
        imageURL: null
    },
    {
        index: 9,
        question: "Какво представляват формалните методи (ФМ)?",
        choices: [
            "Неофициални техники за разработка на софтуер",
            "Математически техники и инструменти за разработване и анализ на софтуерни системи",
        ],
        correctAnswer: "Математически техники и инструменти за разработване и анализ на софтуерни системи",
        imageURL: null
    },
    {
        index: 10,
        question: "Каква е основата на формалните методи?",
        choices: [
            "Дискретна математика",
            "Статистика"
        ],
        correctAnswer: "Дискретна математика",
        imageURL: null
    },
    {
        index: 11,
        question: "Каква е целта на формалните методи в процеса на разработка?",
        choices: [
            "Да заменят всички неформални процеси",
            "Да подсилят процеса на разработка чрез формализация на неформални процеси",
        ],
        correctAnswer: "Да подсилят процеса на разработка чрез формализация на неформални процеси",
        imageURL: null
    },

    {
        index: 15,
        question: "Можем ли да се доверим на компютърните системи?",
        choices: [
            "Да, винаги са напълно надеждни",
            "Не, те могат да съдържат грешки и недостатъци",
        ],
        correctAnswer: "Не, те могат да съдържат грешки и недостатъци",
        imageURL: null
    },
    {
        index: 16,
        question: "Кои са формалните методи?",
        choices: [
            "Извличащите",
            "Абстракция и доказателство"
        ],
        correctAnswer: "Абстракция и доказателство",
        imageURL: null
    },
    {
        index: 17,
        question: "Какво представлява абстракцията в контекста на софтуерното инженерство?",
        choices: [
            "Използване на сложни алгоритми",
            "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        ],
        correctAnswer: "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        imageURL: null
    },
    {
        index: 18,
        question: "Какво е съществено качество на добрата спецификация?",
        choices: [
            "Подходящият избор на ниво абстракция",
            "Използване на сложни термини",
        ],
        correctAnswer: "Подходящият избор на ниво абстракция",
        imageURL: null
    },
    {
        index: 19,
        question: "Какво е основното предимство на доказателството на характеристиките на системата?",
        choices: [
            "Повишава качеството и осигурява индустриалното приложение на софтуера",
            "Няма никакви предимства"
        ],
        correctAnswer: "Повишава качеството и осигурява индустриалното приложение на софтуера",
        imageURL: null
    },
    {
        index: 20,
        question: "Кое от следните НЕ е определение на абстракцията?",
        choices: [
            "Действие запремахване на нещо от описанието",
            "Действие или процес да остави извън описание едно или повече свойства на сложен обект, така че да може да уточним други",
            "Общо понятие за извличане на общи черти от конкретни примери",
            "Процесът на формулиране на общи понятия чрез абстрахиране на общи свойства на инстанции",
            "Нито едно от горните"
        ],
        correctAnswer: "Нито едно от горните",
        imageURL: null
    },
    {
        index: 23,
        question: "Полуформалните методи включват естествен език, диаграми, таблици и нотация. Използват: Structured analysis; Оbject-oriented analysis. Вярно ли е?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 24,
        question: "Кое от следните НЕ е предимство на формалните методи за целите на разработването на качествен (удобен, разбираем, надежден) софтуер?",
        choices: [
            "Намаляват неточността",
            "Осигуряват строгост в описанията на ранни етапи от разработката",
            "Могат да намалят грешките и с това цената и ресурсите за разработването",
            "Могат да проверят коректността и точността, непълнотата и неконсистентността на спецификацията",
            "Увеличават сложността на софтуера"
        ],
        correctAnswer: "Увеличават сложността на софтуера",
        imageURL: null
    },

    {
        index: 26,
        question: "Основни видове формални методи за спецификация на софтуер са: 1/Model-based notations-Z, Vienna Development Method, B method; 2/Process algebras-based notations- Communicating Sequential Processes, CCS and LOTOS",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 27,
        question: "Кое от следните НЕ е компонент на формалните спецификации?",
        choices: [
            "Синтаксис (Syntax)",
            "Връзки (Relations)",
            "Семантика (Semantics)",
            "Деплой",

        ],
        correctAnswer: "Деплой",
        imageURL: null
    },
    {
        index: 28,
        question: "Кое от следните НЕ е основен елемент на формалната система?",
        choices: [
            "Език",
            "Правила за мислене",
            "Начин на определяне на значението на твърденията",
            "Начин на представяне и получаване на резултат",
            "Никое от горните",
        ],
        correctAnswer: "Никое от горните",
        imageURL: null
    },
    {
        index: 29,
        question: "Кое от следните НЕ е основен елемент при дефинирането на формалната система?",
        choices: [
            "Формален език (синтаксис): азбука + граматика.",
            "Система за извод: аксиоми + правила за извод, теореми, доказателство, умозаключение",
            "Никое от горните",
        ],
        correctAnswer: "Никое от горните",
        imageURL: null
    },
    {
        index: 30,
        question: "Кое от следните НЕ е елемент на синтаксиса на Формаления език?",
        choices: [
            "Азбука – символите, които ще се използват.",
            "Синтактични правила (граматика) – множество от правила за конструиране на твърдения.",
            "Никое от горните",
        ],
        correctAnswer: "Никое от горните",
        imageURL: null
    },
    {
        index: 31,
        question: "Синтактичните правила се нуждаят от свой собствен език за описание, наречен ‘мета-език’. Вярно ли е, че типичен пример за такъв мета-език е ‘BNF’ (Backus–Naur Form)?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },

    {
        index: 34,
        question: "Кое от следните НЕ е компонент на системите за извод?",
        choices: [
            "Аксиоми –  wffs, които могат да бъдат записани без да се отнасяме (използваме) до някои други wffs в езика.",
            "Правила за извод – правила, които ни позволяват да продуцираме (създаваме) wffs като пряко следствие от други wffs. ",
            "Политическа система",
        ],
        correctAnswer: "Политическа система",
        imageURL: null
    },
    {
        index: 35,
        question: "Доказателство в една формална система е последователност от wffs в асоциирания формален език, в която всяко wff е:1/ аксиома или 2/ пряко следствие от едно или повече предшестващи wffs",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 36,
        question: "Ако wff може да бъде доказанo, то това wff се нарича теорема?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 37,
        question: "Формална система = формален език + система за извод?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 37,
        question: "Кое от следните НЕ е вярно за интерпретацията на формална система, в която wffs са изречения, които могат да бъдат истина или лъжа?",
        choices: [
            "Съгласувана е, ако всяка теорема интерпретира истинно изказване.",
            "Пълна е, ако всяко истинно изказване може да бъде доказано като теорема.",
            "Всички формални системи са пълни.",
        ],
        correctAnswer: "Всички формални системи са пълни.",
        imageURL: null
    },

    {
        index: 39,
        question: "Посочете невярното! Формалното описание ни помага да проектираме и изграждаме системи, защото:",
        choices: [
            "Точно описва изискванията",
            "Открива недостатъците в проектирането",
            "Реализира рационални приложения",
            "Никое от горните"

        ],
        correctAnswer: "Никое от горните",
        imageURL: null
    }

]


