
export const mysql1 = [
    {
        index: 1,
        question: "Какво представлява моделът в контекста на изследванията?",
        choices: [
            "Оригинално изображение на обекта на изследване",
            "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
            "Метод за описване на реални обекти с точни измервания",
            "Форма на реално съществуване на обекта"
        ],
        correctAnswer: "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
        imageURL: null
    },
    {
        index: 2,
        question: "Каква е основната цел на модела при изследването на обекти?",
        choices: [
            "Да отразява обекта в неговата реална форма",
            "Да увеличи сложността на обекта за по-точно изучаване",
            "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване."
        ],
        correctAnswer: "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване.",
        imageURL: null
    },
    {
        index: 3,
        question: "Каква е ролята на моделите в инженерството?",
        choices: [
            "Да представят системата в нейната физическа форма",
            "Инженерството (в общия смисъл) зависи от използването на точни модели за описание на разглежданите системи.",
            "Да увеличат сложността на системата"
        ],
        correctAnswer: "Инженерството (в общия смисъл) зависи от използването на точни модели за описание на разглежданите системи.",
        imageURL: null
    },
    {
        index: 4,
        question: "Кое не е част основните задачи (ползи) на моделирането?",
        choices: [
            "Абстракция",
            "Анализ и познание",
            "Дефиниране и проверка на връзките и взаимодействията",
            "Проектни решения",
            "Тестване на системата"
        ],
        correctAnswer: "Тестване на системата",
        imageURL: null
    },
    {
        index: 5,
        question: "Какво представлява моделът на софтуерна система?",
        choices: [
            "Физическа реализация на софтуерната система",
            "Абстракция на системата или на част от нея: (част от) спецификация на изискванията, проект, код, тест, поведение на системата",
            "Пълна документация на софтуерния код"
        ],
        correctAnswer: "Абстракция на системата или на част от нея: (част от) спецификация на изискванията, проект, код, тест, поведение на системата",
        imageURL: null
    },
    {
        index: 6,
        question: "Какви средства се използват за представяне на модел на софтуерна система?",
        choices: [
            "Текстови документи и код",
            "Твърдения, формули, математическа символика и схеми",
            "Екранни снимки и графични интерфейси"
        ],
        correctAnswer: "Твърдения, формули, математическа символика и схеми",
        imageURL: null
    },
    {
        index: 7,
        question: "Защо са необходими моделите?",
        choices: [
            "За описание, експериментиране, тестване и проверка на проекта преди реализация",
            "За финализиране на софтуерния код",
            "За създаване на документация"
        ],
        correctAnswer: "За описание, експериментиране, тестване и проверка на проекта преди реализация",
        imageURL: null
    },
    {
        index: 8,
        question: "Какви аспекти могат да представят моделите?",
        choices: [
            "Само софтуерни компоненти",
            "Средата, хардуерни единици, неизвестни части или софтуер на трети лица",
            "Финансови отчети и анализа на пазара"
        ],
        correctAnswer: "Средата, хардуерни единици, неизвестни части или софтуер на трети лица",
        imageURL: null
    },
    {
        index: 9,
        question: "Какво представляват формалните методи (ФМ)?",
        choices: [
            "Неофициални техники за разработка на софтуер",
            "Математически техники и инструменти за разработване и анализ на софтуерни системи",
            "Методи за управление на проекти"
        ],
        correctAnswer: "Математически техники и инструменти за разработване и анализ на софтуерни системи",
        imageURL: null
    },
    {
        index: 10,
        question: "Каква е основата на формалните методи?",
        choices: [
            "Алгебра",
            "Дискретна математика",
            "Статистика"
        ],
        correctAnswer: "Дискретна математика",
        imageURL: null
    },
    {
        index: 11,
        question: "Каква е целта на формалните методи в процеса на разработка?",
        choices: [
            "Да заменят всички неформални процеси",
            "Да подсилят процеса на разработка чрез формализация на неформални процеси",
            "Да увеличат сложността на проектите"
        ],
        correctAnswer: "Да подсилят процеса на разработка чрез формализация на неформални процеси",
        imageURL: null
    },
    {
        index: 12,
        question: "Формалните методи, oсновани на елементарната математика се ползват за:",
        choices: [
            "Проектиране, разработване, тестване, експлоатация и поддръжка, трансформиране на софтуера, документация/спецификация",
            "Само документиране на софтуерни системи",
            "Финансова отчетност на проектите"
        ],
        correctAnswer: "Проектиране, разработване, тестване, експлоатация и поддръжка, трансформиране на софтуера, документация/спецификация",
        imageURL: null
    },
    {
        index: 13,
        question: "Какви системи са критични (рискови) системи?",
        choices: [
            "Системи, които нямат важност за ежедневието",
            "Системи, които могат да предизвикат сериозни последици при неизправност",
            "Системи, които се използват само в образованието"
        ],
        correctAnswer: "Системи, които могат да предизвикат сериозни последици при неизправност",
        imageURL: null
    },
    {
        index: 14,
        question: "В кои области критичните системи имат важно приложение?",
        choices: [
            "Цивилна авиация, медицина, транспорт и военна защита",
            "Само в сферата на информационните технологии",
            "В основно образование и развлекателни програми"
        ],
        correctAnswer: "Цивилна авиация, медицина, транспорт и военна защита",
        imageURL: null
    },
    {
        index: 15,
        question: "Можем ли да се доверим на компютърните системи?",
        choices: [
            "Да, винаги са напълно надеждни",
            "Не, те могат да съдържат грешки и недостатъци",
            "Да, само когато се използват в финансите"
        ],
        correctAnswer: "Не, те могат да съдържат грешки и недостатъци",
        imageURL: null
    },
    {
        index: 16,
        question: "Кои са формалните методи?",
        choices: [
            "Надеждните",
            "Извличащите",
            "Абстракция и доказателство"
        ],
        correctAnswer: "Абстракция и доказателство",
        imageURL: null
    },
    {
        index: 17,
        question: "Какво представлява абстракцията в контекста на софтуерното инженерство?",
        choices: [
            "Използване на сложни алгоритми",
            "Създаване на нов хардуер",
            "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        ],
        correctAnswer: "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        imageURL: null
    },
    {
        index: 18,
        question: "Какво е съществено качество на добрата спецификация?",
        choices: [
            "Подходящият избор на ниво абстракция",
            "Използване на сложни термини",
            "Недостатъчно тестване"
        ],
        correctAnswer: "Подходящият избор на ниво абстракция",
        imageURL: null
    },
    {
        index: 19,
        question: "Какво е основното предимство на доказателството на характеристиките на системата?",
        choices: [
            "Увеличава сложността на софтуера",
            "Повишава качеството и осигурява индустриалното приложение на софтуера",
            "Няма никакви предимства"
        ],
        correctAnswer: "Повишава качеството и осигурява индустриалното приложение на софтуера",
        imageURL: null
    },
    {
        index: 20,
        question: "Кое от следните НЕ е определение на абстракцията?",
        choices: [
            "Действие запремахване на нещо от описанието",
            "Действие или процес да остави извън описание едно или повече свойства на сложен обект, така че да може да уточним други",
            "Общо понятие за извличане на общи черти от конкретни примери",
            "Процесът на формулиране на общи понятия чрез абстрахиране на общи свойства на инстанции",
            "Повишава качеството и осигурява индустриалното приложение на софтуера"
        ],
        correctAnswer: "Повишава качеството и осигурява индустриалното приложение на софтуера",
        imageURL: null
    }

]


