// Множества. Запис и дефиниции в Z нотацията - to be corrected
export const mysql3 = [
  {
    index: 1,
    question: "Кое от следните описва множеството?",
    choices: [
      "Добре дефинирана колекция от отделни обекти",
      "Колекция от дублирани стойности",
      "Неопределен набор от обекти",
      "Колекция от стойности в неограничен ред"
    ],
    correctAnswer: "Добре дефинирана колекция от отделни обекти",
    imageURL: null
  },
  {
    index: 2,
    question: "Кой от следните примери представлява множество?",
    choices: [
      "{ червено, 1, 2, 3 }",
      "{ Мария, синьо, да, не }",
      "{ 1, 2, 3, червено }",
        "{ 1, 3, 5, 7, ... }",
    ],
    correctAnswer: "{ 1, 3, 5, 7, ... }",
    imageURL: null
  },
  
  {
    index: 3,
    question: "Кое от следните НЕ е допустимо множество по дефиниция?",
    choices: [
      "{ 1, 2, 3, 4, ... }",
      "{ Иван, Никола, Мария }",
      "{ yes, no }",
      "{ red, 1, 2, 3 }"
    ],
    correctAnswer: "{ red, 1, 2, 3 }",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое от следните твърдения НЕ е вярно относно множествата с дефинирани имена?",
    choices: [
        "Множеството без елементи е известно като 'празно множество' - ∅.",
        "Множеството N съдържа всички естествени числа { 0, 1, ... }.",
        "Множеството Z включва цели числа {... -2, -1, 0, 1, 2, ... }.",
        "Множеството N представлява празно множество."
    ],
    correctAnswer: "Множеството N представлява празно множество.",
    imageURL: null
},
{
  index: 5,
  question: "Кое от следните твърдения НЕ е вярно относно операциите с множества?",
  choices: [
      "Сечението A ∩ B съдържа само елементите, които са общи за множества A и B.",
      "Обединението A U B съдържа всички елементи от множества A и B без повторения.",
      "Разликата A \ B съдържа елементите, които са в A, но не и в B.",
      "A = B , ако A ⊆ B и B ⊆ A",
      "Ако A = B, то A е подмножство на B, но B не е подмножство на A."
  ],
  correctAnswer: "Ако A = B, то A е подмножство на B, но B не е подмножство на A.",
  imageURL: null
},
{
  index: 6,
  question: "Кое от следните твърдения НЕ е вярно относно основните аксиоми и закони в множествата?",
  choices: [
      "Всеки елемент x принадлежи на множеството {X}, ако x ∈ {X}",
      "Съществува празно множество, което не съдържа никакви елементи: Ø.",
      "Комутативният закон гласи, че A ∩ B = B ∩ A и A U B = B U A.",
      "Ако x принадлежи на Ø, тогава x е елемент на някое множество."
  ],
  correctAnswer: "Ако x принадлежи на Ø, тогава x е елемент на някое множество.",
  imageURL: null
},
{
  index: 7,
  question: "Кое от следните твърдения НЕ е вярно относно комутативния, асоциативния и дистрибутивния закон в множествата?",
  choices: [
      "Комутативният закон гласи, че: A ∩ B = B ∩ A ; A ∪ B = B ∪ A.",
      "Асоциативният закон гласи, че: A ∩ (B ∩ C) = (A ∩ B) ∩ C ; (A ∪ (B ∪ C) = (A ∪ B) ∪ C)",
      "Дистрибутивният закон: (A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C))",
      "None of the above"
  ],
  correctAnswer: "None of the above",
  imageURL: null
},
{
  index: 8,
  question: "Кое от следните твърдения НЕ е вярно относно степенното множество?",
  choices: [
      "Степенното множество на S съдържа всички подмножества на S.",
      "Степенното множество се обозначава с P(S) - (Power sets)",
      "Степенното множество не включва празното множество."
  ],
  correctAnswer: "Степенното множество не включва празното множество.",
  imageURL: null
},
{
  index: 9,
  question: "Кое от следните твърдения НЕ е вярно относно Декартовото произведение?",
  choices: [
      "Декартовото произведение е множество от n-торки, които представляват подредени списъци от елементи.",
      "Декартовото произведение на две множества a и b се обозначава като a x b.",
      "Декартовото произведение включва само наредени двойки от едно и също множество.",
      "Компонентите в Декартовото произведение са подредени в определен ред - a x b ≠ b x а "
  ],
  correctAnswer: "Декартовото произведение включва само наредени двойки от едно и също множество.",
  imageURL: null
},
{
  index: 10,
  question: "Кое от следните твърдения НЕ е вярно относно дефинирането на типове в Z нотацията?",
  choices: [
      "Типът на обектите е максималното множество в границите на разглежданата спецификация.",
      "Всеки обект x може да бъде асоцииран с множество типове.",
      "В Z нотацията основният тип е множеството на целите числа Z.",
      "Други типове могат да се изграждат чрез основни типове или чрез конструктори като степенно множество и Декартово произведение."
  ],
  correctAnswer: "Всеки обект x може да бъде асоцииран с множество типове.",
  imageURL: null
}

];