
export const mysql1 = [
    {
        index: 1,
        question: "Какво представлява моделът в контекста на изследванията?",
        choices: [
            "Оригинално изображение на обекта на изследване",
            "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
            "Метод за описване на реални обекти с точни измервания",
            "Форма на реално съществуване на обекта"
        ],
        correctAnswer: "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
        imageURL: null
    },
    {
        index: 2,
        question: "Каква е основната цел на модела при изследването на обекти?",
        choices: [
            "Да отразява обекта в неговата реална форма",
            "Да увеличи сложността на обекта за по-точно изучаване",
            "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване."
        ],
        correctAnswer: "Моделът отразява или възпроизвежда обекта на изследването в достатъчна степен, за да позволи получаване на информация, необходима за неговото изучаване.",
        imageURL: null
    },
    {
        index: 3,
        question: "Каква е ролята на моделите в инженерството?",
        choices: [
            "Да представят системата в нейната физическа форма",
            "Инженерството (в общия смисъл) зависи от използването на точни модели за описание на разглежданите системи.",
            "Да увеличат сложността на системата"
        ],
        correctAnswer: "Инженерството (в общия смисъл) зависи от използването на точни модели за описание на разглежданите системи.",
        imageURL: null
    },
    {
        index: 4,
        question: "Кое не е част основните задачи (ползи) на моделирането?",
        choices: [
            "Абстракция",
            "Анализ и познание",
            "Дефиниране и проверка на връзките и взаимодействията",
            "Проектни решения",
            "Тестване на системата"
        ],
        correctAnswer: "Тестване на системата",
        imageURL: null
    },
    {
        index: 5,
        question: "Какво представлява моделът на софтуерна система?",
        choices: [
            "Физическа реализация на софтуерната система",
            "Абстракция на системата или на част от нея: (част от) спецификация на изискванията, проект, код, тест, поведение на системата",
            "Пълна документация на софтуерния код"
        ],
        correctAnswer: "Абстракция на системата или на част от нея: (част от) спецификация на изискванията, проект, код, тест, поведение на системата",
        imageURL: null
    },
    {
        index: 6,
        question: "Какви средства се използват за представяне на модел на софтуерна система?",
        choices: [
            "Текстови документи и код",
            "Твърдения, формули, математическа символика и схеми",
            "Екранни снимки и графични интерфейси"
        ],
        correctAnswer: "Твърдения, формули, математическа символика и схеми",
        imageURL: null
    },
    {
        index: 7,
        question: "Защо са необходими моделите?",
        choices: [
            "За описание, експериментиране, тестване и проверка на проекта преди реализация",
            "За финализиране на софтуерния код",
            "За създаване на документация"
        ],
        correctAnswer: "За описание, експериментиране, тестване и проверка на проекта преди реализация",
        imageURL: null
    },
    {
        index: 8,
        question: "Какви аспекти могат да представят моделите?",
        choices: [
            "Само софтуерни компоненти",
            "Средата, хардуерни единици, неизвестни части или софтуер на трети лица",
            "Финансови отчети и анализа на пазара"
        ],
        correctAnswer: "Средата, хардуерни единици, неизвестни части или софтуер на трети лица",
        imageURL: null
    },
    {
        index: 9,
        question: "Какво представляват формалните методи (ФМ)?",
        choices: [
            "Неофициални техники за разработка на софтуер",
            "Математически техники и инструменти за разработване и анализ на софтуерни системи",
            "Методи за управление на проекти"
        ],
        correctAnswer: "Математически техники и инструменти за разработване и анализ на софтуерни системи",
        imageURL: null
    },
    {
        index: 10,
        question: "Каква е основата на формалните методи?",
        choices: [
            "Алгебра",
            "Дискретна математика",
            "Статистика"
        ],
        correctAnswer: "Дискретна математика",
        imageURL: null
    },
    {
        index: 11,
        question: "Каква е целта на формалните методи в процеса на разработка?",
        choices: [
            "Да заменят всички неформални процеси",
            "Да подсилят процеса на разработка чрез формализация на неформални процеси",
            "Да увеличат сложността на проектите"
        ],
        correctAnswer: "Да подсилят процеса на разработка чрез формализация на неформални процеси",
        imageURL: null
    },
    {
        index: 12,
        question: "Формалните методи, oсновани на елементарната математика се ползват за:",
        choices: [
            "Проектиране, разработване, тестване, експлоатация и поддръжка, трансформиране на софтуера, документация/спецификация",
            "Само документиране на софтуерни системи",
            "Финансова отчетност на проектите"
        ],
        correctAnswer: "Проектиране, разработване, тестване, експлоатация и поддръжка, трансформиране на софтуера, документация/спецификация",
        imageURL: null
    },
    {
        index: 13,
        question: "Какви системи са критични (рискови) системи?",
        choices: [
            "Системи, които нямат важност за ежедневието",
            "Системи, които могат да предизвикат сериозни последици при неизправност",
            "Системи, които се използват само в образованието"
        ],
        correctAnswer: "Системи, които могат да предизвикат сериозни последици при неизправност",
        imageURL: null
    },
    {
        index: 14,
        question: "В кои области критичните системи имат важно приложение?",
        choices: [
            "Цивилна авиация, медицина, транспорт и военна защита",
            "Само в сферата на информационните технологии",
            "В основно образование и развлекателни програми"
        ],
        correctAnswer: "Цивилна авиация, медицина, транспорт и военна защита",
        imageURL: null
    },
    {
        index: 15,
        question: "Можем ли да се доверим на компютърните системи?",
        choices: [
            "Да, винаги са напълно надеждни",
            "Не, те могат да съдържат грешки и недостатъци",
            "Да, само когато се използват в финансите"
        ],
        correctAnswer: "Не, те могат да съдържат грешки и недостатъци",
        imageURL: null
    },
    {
        index: 16,
        question: "Кои са формалните методи?",
        choices: [
            "Надеждните",
            "Извличащите",
            "Абстракция и доказателство"
        ],
        correctAnswer: "Абстракция и доказателство",
        imageURL: null
    },
    {
        index: 17,
        question: "Какво представлява абстракцията в контекста на софтуерното инженерство?",
        choices: [
            "Използване на сложни алгоритми",
            "Създаване на нов хардуер",
            "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        ],
        correctAnswer: "Абстракцията е основен принцип на софтуерното инженерство. Абстракциите се предоставят от модели.",
        imageURL: null
    },
    {
        index: 18,
        question: "Какво е съществено качество на добрата спецификация?",
        choices: [
            "Подходящият избор на ниво абстракция",
            "Използване на сложни термини",
            "Недостатъчно тестване"
        ],
        correctAnswer: "Подходящият избор на ниво абстракция",
        imageURL: null
    },
    {
        index: 19,
        question: "Какво е основното предимство на доказателството на характеристиките на системата?",
        choices: [
            "Увеличава сложността на софтуера",
            "Повишава качеството и осигурява индустриалното приложение на софтуера",
            "Няма никакви предимства"
        ],
        correctAnswer: "Повишава качеството и осигурява индустриалното приложение на софтуера",
        imageURL: null
    },
    {
        index: 20,
        question: "Кое от следните НЕ е определение на абстракцията?",
        choices: [
            "Действие запремахване на нещо от описанието",
            "Действие или процес да остави извън описание едно или повече свойства на сложен обект, така че да може да уточним други",
            "Общо понятие за извличане на общи черти от конкретни примери",
            "Процесът на формулиране на общи понятия чрез абстрахиране на общи свойства на инстанции",
            "Повишава качеството и осигурява индустриалното приложение на софтуера"
        ],
        correctAnswer: "Повишава качеството и осигурява индустриалното приложение на софтуера",
        imageURL: null
    },
    {
        index: 21,
        question: "Oтнася ли се следното за абстракцията: `Remove detail (simplify) and focus (selection based on purpose). Generalisation (core or essence)`?",
        choices: [
            "Да",
            "Не",
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 22,
        question: "Формалните методи включват математически синтаксис и семантика.Примери са Z, B, VDM, LOTOS, CSP. Вярно ли е?",
        choices: [
            "Да",
            "Не",
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 23,
        question: "Полуформалните методи включват естествен език, диаграми, таблици и нотация. Използват: Structured analysis; Оbject-oriented analysis. Вярно ли е?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 24,
        question: "Кое от следните НЕ е предимство на формалните методи (ФМ) за целите на разработването на качествен (удобен, разбираем, надежден) софтуер?",
        choices: [
            "Намаляват неточността",
            "Осигуряват строгост в описанията на ранни етапи от разработката",
            "Могат да намалят грешките и с това цената и ресурсите за разработването",
            "Могат да проверят коректността и точността, непълнотата и неконсистентността на спецификацията",
            "Увеличават сложността на софтуера"
        ],
        correctAnswer: "Увеличават сложността на софтуера",
        imageURL: null
    },
    {
        index: 25,
        question: "ФМ не са широко разпространени, защото: Трудно е да бъде разбрана спецификацията /неразбираема за клиентите/; Трудна формализация на отделни аспекти на системата; Трудна  възвръщаемост на инвестицията/консерватизъм и нежелание/",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 26,
        question: "Основни видове формални методи за спецификация на софтуер са: 1/Model-based notations-Z, Vienna Development Method, B method; 2/Process algebras-based notations- Communicating Sequential Processes, CCS and LOTOS",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 27,
        question: "Кое от следните НЕ е компонент на формалните спецификации (ФС)?",
        choices: [
            "Синтаксис (Syntax)",
            "Връзки (Relations)",
            "Семантика (Semantics)",
            "Деплой",

        ],
        correctAnswer: "Деплой",
        imageURL: null
    },
    {
        index: 28,
        question: "Кое от следните НЕ е основен елемент на формалната система (ФС)?",
        choices: [
            "Език, който да описва обектите, които ни интересуват.",
            "Правила за мислене (начин на интерпретация на изказванията в езика).",
            "Начин на определяне на значението на твърденията/изказванията.",
            "Методи за оценка на потребителското изживяване.",
            "Начин на представяне и получаване на резултат (разсъждения и интерпретация)."
        ],
        correctAnswer: "Методи за оценка на потребителското изживяване.",
        imageURL: null
    },
    {
        index: 29,
        question: "Кое от следните НЕ е основен елемент при дефинирането на формалната система (ФС)?",
        choices: [
            "Формален език (синтаксис): азбука + граматика.",
            "Система за извод/заключение: аксиоми + правила за извод, теореми, доказателство, умозаключение",
            "Метод за оценка на производителността на системата.",
        ],
        correctAnswer: "Метод за оценка на производителността на системата.",
        imageURL: null
    },
    {
        index: 30,
        question: "Кое от следните НЕ е елемент на синтаксиса на Формаления език?",
        choices: [
            "Азбука – символите, които ще се използват.",
            "Синтактични правила (граматика) – множество от правила за конструиране на изречения/твърдения.",
            "Семантика – значение на изреченията.",
        ],
        correctAnswer: "Семантика – значение на изреченията.",
        imageURL: null
    },
    {
        index: 31,
        question: "Синтактичните правила се нуждаят от свой собствен език за описание, наречен ‘мета-език’. Вярно ли е, че типичен пример за такъв мета-език е ‘BNF’ (Backus–Naur Form)?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 32,
        question: "За да зададем значение на символите-Семантика, избираме семантична/предметна област(domain) и формулираме интерпретация(функция на значението), която обяснява как изреченията в синтактичната област придобиват значение. Вярно ли е?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 33,
        question: "Системите за извод (Inference Systems) представляват дедуктивен апарат за манипулиране на well-formed formulae (wffs). Вярно ли е, че синтактичната манипулация не се отнася до никаква интерпретация?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 34,
        question: "Кое от следните НЕ е компонент на системите за извод?",
        choices: [
            "Аксиоми –  wffs, които могат да бъдат записани без да се отнасяме (използваме) до някои други wffs в езика.",
            "Правила за извод – правила, които ни позволяват да продуцираме (създаваме) wffs като пряко следствие от други wffs. ",
            "Политическа система",
        ],
        correctAnswer: "Политическа система",
        imageURL: null
    },
    {
        index: 35,
        question: "Доказателство в една формална система, F, е последователност от wffs в асоциирания формален език, в която всяко wff е:1/ аксиома или 2/ пряко следствие от едно или повече предшестващи wffs",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 36,
        question: "Ако wff може да бъде доказанo/получено т.е. съществува доказателство в F, то това wff се нарича теорема?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 37,
        question: "Формална система = формален език + система за извод?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 37,
        question: "Кое от следните НЕ е вярно за интерпретацията на формална система, в която wffs са изречения, които могат да бъдат истина или лъжа?",
        choices: [
            "Съгласувана (консистентна/sound) е, ако всяка теорема интерпретира истинно изказване.",
            "Пълна е, ако всяко истинно изказване може да бъде доказано като теорема.",
            "Всички формални системи са пълни.",
        ],
        correctAnswer: "Всички формални системи са пълни.",
        imageURL: null
    },
    {
        index: 38,
        question: "Ако W може да бъде доказана, пишем : |- W ?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 38,
        question: "Получаването (derivation) на well-formed formulae (wff) W във формалната система F от множество предпоставки (premises) P, е доказателство, при което wff може да бъде аксиома, предпоставка или пряко следствие от предишни wffs. Получаването на wff е доказателство във формалната система, чиито аксиоми са били подсилени с предпоставки. Пишем: P |- W т.е. могат да се докажат неверни твърдения?",
        choices: [
            "Да",
            "Не"
        ],
        correctAnswer: "Да",
        imageURL: null
    },
    {
        index: 39,
        question: "Посочете невярното! Формалното описание ни помага да проектираме и изграждаме системи, защото:",
        choices: [
            "Точно описва изискванията",
            "Открива недостатъците в проектирането",
            "Реализира рационални приложения",
            "Не точно описва изискванията"

        ],
        correctAnswer: "Не точно описва изискванията",
        imageURL: null
    },
    {
        index: 40,
        question: "Посочете невярното! Харктеристиките на Формалното описание са:",
        choices: [
            "Abstraction allows you to focus on the important aspects of a problem",
            "Базират се на изграждане на НЕ-формални системи",
            "Mathematics allows you to reason about solutions to the problem.",


        ],
        correctAnswer: "Базират се на изграждане на НЕ-формални системи",
        imageURL: null
    }









]


