// Релации, функции, редици и индукция...
export const mysql4 = [
  {
    index: 1,
    question: "Какво представлява релацията в контекста на множествата?",
    choices: [
      "Множество от наредени двойки",
      "Набор от несвързани елементи",
      "Множество от независими стойности",
      "Колекция от числа без ред"
    ],
    correctAnswer: "Множество от наредени двойки",
    imageURL: null
  },
  {
    index: 2,
    question: "Какво е бинарна релация?",
    choices: [
      "Релация между два обекта",
      "Релация, която включва само уникални стойности",
      "Множество на всички релации между две множества",
      "Набор от несвързани стойности"
    ],
    correctAnswer: "Множество на всички релации между две множества",
    imageURL: null
  },
  {
    index: 3,
    question: "Коя релация е рефлексивна?",
    choices: [
      "Тази, която няма повтарящи се стойности",
      "Тази, която съдържа само уникални двойки",
      "Релация, която е свързана с подмножество на обхвата",
      "Тази, при която всеки елемент е свързан със себе си",
    ],
    correctAnswer: "Тази, при която всеки елемент е свързан със себе си",
    imageURL: null
  },
  {
    index: 4,
    question: "Какво се нарича област (domain) на релация?",
    choices: [
      "Всички елементи на множеството X",
      "Множеството от елементи на Y, свързани с X",
      "Набор от двойки от X и Y",
      "Множеството от елементи на X, свързани с елементи от Y"
    ],
    correctAnswer: "Множеството от елементи на X, свързани с елементи от Y",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20210208111847/Screenshot20210208at111803AM-660x350.png"
  },
  {
    index: 5,
    question: "Какво е композиция на релации?",
    choices: [
      "Релация между три обекта",
      "Комбиниране на две релации, при което целта на едната е източник за другата",
      "Релация, която включва всички елементи на дадено множество",
      "Комбиниране на релации чрез добавяне на нови двойки"
    ],
    correctAnswer: "Комбиниране на две релации, при което целта на едната е източник за другата",
    imageURL: "https://math.info/image/368/composition.jpg"
  },
  {
    index: 6,
    question: "Какво е функция в теорията на множествата?",
    choices: [
      "Релация с уникални стойности в обхвата",
      "Релация, при която един елемент от множество е свързан с един или нула елементи от друго множество",
      "Комбинация от свързани елементи",
      "Подмножество от дадено множество"
    ],
    correctAnswer: "Релация, при която един елемент от множество е свързан с един или нула елементи от друго множество",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20230928183715/One-One-and-Onto.png"
  },
  {
    index: 7,
    question: "Коя функция се нарича инекция /one-to-one X↣Y/?",
    choices: [
      "Функция, при която всеки елемент от обхвата се асоциира с поне един елемент от областта",
      "Функция, която свързва ВСЕКИ елемент от домейна с единствен елемент от обхвата",
      "Функция, която съдържа само уникални стойности",
      "Функция, дефинирана само за крайни множества"
    ],
    correctAnswer: "Функция, която свързва ВСЕКИ елемент от домейна с единствен елемент от обхвата",
    imageURL: "https://ds055uzetaobb.cloudfront.net/brioche/uploads/EkswlzPrzb-examp.svg?width=300"
  },
  {
    index: 8,
    question: "Какво представлява редица в теорията на множествата?",
    choices: [
      "Набор от уникални стойности",
      "Множество от несвързани обекти",
      "Подредена колекция от елементи",
      "Колекция от елементи без ред"
    ],
    correctAnswer: "Подредена колекция от елементи",
    imageURL: null
  },
  {
    index: 9,
    question: "Какво означава операцията „свързване“ (concatenation) при редици?",
    choices: [
      "Събиране на редици в множество",
      "Подредена последователност от елементи",
      "Обединение на всички уникални стойности",
      "Ред, в който първият елемент се повтаря"
    ],
    correctAnswer: "Подредена последователност от елементи",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява частична функция A ⇸ B?",
    choices: [
      "Функция, при която за всяко x ∈ A съществува най-много едно y ∈ B т.е. в A има елементи не свързани с B",
      "Функция, която има само един елемент",
    ],
    correctAnswer: "Функция, при която за всяко x ∈ A съществува най-много едно y ∈ B т.е. в A има елементи не свързани с B",
    imageURL: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWW0IjIuOYNhpW78j-XgyNt6P1JVV6s7ESNA&s"
  },
  {
    index: 11,
    question: "Какво означава 'сюрекция' (onto) X ↠ Y в контекста на функциите?",
    choices: [
      "Функция, която има само уникални елементи",
      "Функция, при която обхватът (range, target) е покрит",
      "Функция с подредена стойност",
      "Функция, която няма елементи в домейна"
    ],
    correctAnswer: "Функция, при която обхватът (range, target) е покрит",
    imageURL: "https://ds055uzetaobb.cloudfront.net/brioche/uploads/EkswlzPrzb-examp.svg?width=300"
  },
  {
    index: 12,
    question: "Каква е обратната релация?",
    choices: [
      "Релация, която отразява началната стойност на обхвата",
      "Релация, която замества областта с обхвата",
      "Релация, при която обхватът и областта са разменени",
      "Релация, в която няма уникални стойности"
    ],
    correctAnswer: "Релация, при която обхватът и областта са разменени",
    imageURL: null
  },
  {
    index: 13,
    question: "Какво означава 'индукция' при доказателства?",
    choices: [
      "Метод, при който се доказва истина чрез базов случай и последователност",
      "Метод, който изисква пълно доказателство на всички елементи",
      "Метод за сортиране на стойности",
      "Метод за комбиниране на данни"
    ],
    correctAnswer: "Метод, при който се доказва истина чрез базов случай и последователност",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво означава head в редица?",
    choices: [
      "Последният елемент на редицата",
      "Първият елемент на редицата",
      "Средният елемент на редицата",
      "Елемент, който се среща най-често"
    ],
    correctAnswer: "Първият елемент на редицата",
    imageURL: null
  },
  {
    index: 15,
    question: "Каквo е tail в редица?",
    choices: [
      "Връща първия елемент",
      "Връща последния елемент",
      "Връща всички елементи, освен първия",
      "Връща дублиран елемент"
    ],
    correctAnswer: "Връща всички елементи, освен първия",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво е ламбда нотация?",
    choices: [
      "Символ за означаване на релация",
      "Обозначение за празна стойност",
      "Нотация за дефиниране на функция чрез декларация и ограничение",
      "Метод за събиране на стойности"
    ],
    correctAnswer: "Нотация за дефиниране на функция чрез декларация и ограничение",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво представлява инективна редица?",
    choices: [
      "Редицата съдържа уникални елементи",
      "Редицата съдържа дублирани елементи",
      "Редицата съдържа елементи без ред",
      "Редицата включва само цели числа"
    ],
    correctAnswer: "Редицата съдържа уникални елементи",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво представлява функцията 'last' в редица?",
    choices: [
      "Връща първия елемент",
      "Връща средния елемент",
      "Връща последния елемент",
      "Връща всички елементи"
    ],
    correctAnswer: "Връща последния елемент",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво представлява операцията „отменяне“ (overriding) f ⊕ g на функция f?",
    choices: [
      "Заместване на стойностите за конкретни елементи",
      "Смяна на всички стойности в обхвата",
      "Добавяне на нови стойности в областта",
      "Премахване на всички стойности"
    ],
    correctAnswer: "Заместване на стойностите за конкретни елементи",
    imageURL: null
  },
  {
    index: 20,
    question: "Каква е основната идея на структурната индукция?",
    choices: [
      "Доказване чрез базов случай и индуктивна стъпка (подобектите)",
      "Извеждане на заключение за всеки елемент",
      "Изчисляване на стойности в обхвата",
      "Събиране на стойности без ред"
    ],
    correctAnswer: "Доказване чрез базов случай и индуктивна стъпка (подобектите)",
    imageURL: null
  },
  {
    index: 21,
    question: "Коя функция се нарича биекция /X ⤖ Y/?",
    choices: [
      "Функция, която e нито onto и нито one-to-one",
      "Функция, която e едновремено onto и one-to-one",
    ],
    correctAnswer: "Функция, която e едновремено onto и one-to-one",
    imageURL: "https://ds055uzetaobb.cloudfront.net/brioche/uploads/EkswlzPrzb-examp.svg?width=300"
  },


];