// Z нотация. Логики и доказателства
export const mysql2 = [
    {
        index: 1,
        question: "Какви са основните елементи на формалната система?",
        choices: [
            "Азбука и речник",
            "Граматични правила и лексикални единици",
            "Теореми и аксиоми",
            "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        ],
        correctAnswer: "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        imageURL: null
    },
    {
        index: 2,
        question: "Кое от следните описва елементи на формалния език?",
        choices: [
            "Азбука и граматични правила",
            "Състояния на системата и структури от данни",
            "Аксиоми и правила за извод",
            "Проектиране на системи и данни"
        ],
        correctAnswer: "Азбука и граматични правила",
        imageURL: null
    },
    {
        index: 3,
        question: "Какво включва системата за извод/заключение (семантика) във формалната система?",
        choices: [
            "Граматични правила и азбука",
            "Аксиоми и правила за извод",
            "Данни и свойства",
            "Състояния на системата и операции"
        ],
        correctAnswer: "Аксиоми и правила за извод",
        imageURL: null
    },
    {
        index: 4,
        question: "Какво е основната цел на формалната спецификация в софтуерните системи?",
        choices: [
            "Да създаде кратки описания на различни езици",
            "Да синтезира нови програмни езици",
            "Да опише математическите обекти спрямо особеностите на проектираната система",
            "Да дефинира граматичните правила за състояния на системите"
        ],
        correctAnswer: "Да опише математическите обекти спрямо особеностите на проектираната система",
        imageURL: null
    },
    {
        index: 5,
        question: "Кои аспекти на проектираната система трябва да бъдат описани във формалната спецификация?",
        choices: [
            "Граматични правила и синтаксис",
            "Състояния на системата, структури от данни, техни свойства и операции",
            "Аксиоми и правила за извод",
            "Релации между обектите и системните състояния"
        ],
        correctAnswer: "Състояния на системата, структури от данни, техни свойства и операции",
        imageURL: null
    },
    {
        index: 6,
        question: "Кои две теории са в основата на всяка софтуерна спецификация в Z нотацията?",
        choices: [
            "Теорията на графите и теорията на числата",
            "Теорията на информацията и теорията на автоматите",
            "Теорията на вероятностите и линейната алгебра",
            "Математическата логика и теорията на множествата",
        ],
        correctAnswer: "Математическата логика и теорията на множествата",
        imageURL: null
    },
    {
        index: 7,
        question: "Какво е Z нотацията?",
        choices: [
            "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
            "Графични диаграми за визуализиране на състоянието на системата",
            "Алгоритми за оптимизация на системата",
            "Методи за тестване на производителността на системата"
        ],
        correctAnswer: "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
        imageURL: null
    },
    {
        index: 6,
        question: "За какво може да се използва езикът на схемите в Z нотацията?",
        choices: [
            "За проектиране на графичен интерфейс и визуализиране на данни",
            "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
            "За описание на алгоритми и тяхната сложност",
            "За дефиниране на комуникационни протоколи и обмен на съобщения"
        ],
        correctAnswer: "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
        imageURL: null
    },
    {
        index: 7,
        question: "Кои са двете основни формални системи, използвани в логиката за описание на софтуерни системи?",
        choices: [
            "Теория на графите и теория на числата",
            "Логика на вероятностите и теория на игрите",
            "Пропозиционна логика и предикатна логика",
            "Автоматна теория и лингвистика"
        ],
        correctAnswer: "Пропозиционна логика и предикатна логика",
        imageURL: null
    },
    {
        index: 8,
        question: "Кой не е от основни методи за доказателство, използвани за тези системи?",
        choices: [
            "Дедукция (Natural deduction)",
            "Доказателство чрез опровергаване (Proof by contradiction)",
            "Доказателство чрез анализ на случаи (Proof by case analysis)",
            "Разсъждение чрез равенства (Equational reasoning)",
            "Хеширане на данни",
        ],
        correctAnswer: "Хеширане на данни",
        imageURL: null
    },
    {
        index: 9,
        question: "Какво представлява пропозиционната логика?",
        choices: [
            "Метод за създаване на сложни математически уравнения",
            "Теория за анализа на данни чрез хеширане",
            "Система за измерване на логически изводи чрез нечетливи изрази",
            "Езикът на логиката, базиран на твърдения(propositions), които могат да бъдат или верни, или неверни",
            "Метод за проверка на логическа последователност с помощта на символи"
        ],
        correctAnswer: "Езикът на логиката, базиран на твърдения(propositions), които могат да бъдат или верни, или неверни",
        imageURL: null
    },
    {
        index: 10,
        question: "Твърдението е изявление (изказване) за предполагаем факт. То е или вярно или невярно, но никога и двете. Кое от следните твърдения не е пример за пропозиционно твърдение?",
        choices: [
            "Портокалът е плод",
            "Паролата е осемзнакова символна поредица",
            "Пет е по-голямо от четири",
            "Четири е по-малко от пет",
            "Ще си купим ли картофи днес?"
        ],
        correctAnswer: "Ще си купим ли картофи днес?",
        imageURL: null
    },
    {
        index: 11,
        question: "Кой знак не е от знаците на пропозиционната логика?",
        choices: [
            "∧ (конюнкция - 'и')",
            "∨ (дизюнкция - 'или')",
            "¬ (отрицание - 'не')",
            "→ (импликация - 'ако... то')",
            "<- (обърната импликация - '..., ако')",
            "↔ (еквиваленция - 'ако и само ако')",
            "↓ (нито, нито, свързано отрицание, NOR)",
            "↑ (не двете, отрицание на конюнкцията, NAND)",
            "% (модулно деление)"

        ],
        correctAnswer: "% (модулно деление)",
        imageURL: null
    },
    {
        index: 12,
        question: "Кой оператор има най-висок приоритет в пропозиционната логика?",
        choices: [
            "¬ (отрицание - 'не')",
            "∧ (конюнкция - 'и')",
            "∨ (дизюнкция - 'или')",
            "→ (импликация - 'ако... то')",
            "↔ (еквиваленция - 'ако и само ако')"
        ],
        correctAnswer: "¬ (отрицание - 'не')",
        imageURL: null

    },
    {
        index: 13,
        question: "Какво означава всеки примитивен символ (p, q, r, ...) в пропозиционната логика?",
        choices: [
            "Комбинация от сложни логически оператори",
            "Програмен код за логически операции",
            "Интерпретация на математическа функция",
            "Свързано твърдение, което винаги е вярно",
            "Твърдение, което се свързва със съответната си стойност на истинност: истина (t) или лъжа (f)",
        ],
        correctAnswer: "Твърдение, което се свързва със съответната си стойност на истинност: истина (t) или лъжа (f)",
        imageURL: null
    },
    {
        index: 14,
        question: "Как се определя истинността на сложни твърдения в пропозиционната логика?",
        choices: [
            "От истинността на съставящите ги твърдения",
            "От броя на логическите оператори",
            "От стойността на най-сложното твърдение",
            "От контекста на изказването",
            "От реда на операциите"
        ],
        correctAnswer: "От истинността на съставящите ги твърдения",
        imageURL: null
    },
    {
        index: 15,
        question: "Каква е стойността на истинност за примитивния символ 'p', ако 'Днес е ден от седмицата'?",
        choices: [
            "Истина (t)",
            "Лъжа (f)",
            "Неопределена",
            "Зависи от другите твърдения",
            "Трябва да се провери"
        ],
        correctAnswer: "Истина (t)",
        imageURL: null
    },
    {
        index: 16,
        question: "Какво представлява тавтологията в пропозиционната логика?",
        choices: [
            "Твърдение, което винаги е невярно",
            "Твърдение, което винаги е вярно",
            "Твърдение, което е нито истина, нито лъжа",
            "Твърдение, което е вярно само при определени условия",
            "Твърдение, зависещо от броя на операторите"
        ],
        correctAnswer: "Твърдение, което винаги е вярно",
        imageURL: null
    },
    {
        index: 17,
        question: "Кое от следните твърдения е пример за противоречие (contradiction, винаги не е вярно)?",
        choices: [
            "p ∧ ¬p",
            "p ∨ ¬p",
            "p => (q => p)",
            "p ∧ (p => q) => q",
            "¬p => p ∧ q"
        ],
        correctAnswer: "p ∧ ¬p",
        imageURL: null
    },
    {
        index: 18,
        question: "Кое от следните твърдения е случайност (contingency)?",
        choices: [
            "Твърдение, което винаги е вярно",
            "Твърдение, което винаги е невярно",
            "Твърдение, което е нито истина, нито лъжа",
            "Твърдение, което зависи от други твърдения",
            "Твърдение, което се променя в зависимост от стойностите на p и q"
        ],
        correctAnswer: "Твърдение, което е нито истина, нито лъжа",
        imageURL: null
    },
    {
        index: 19,
        question: "Кое твърдение е тавтология?",
        choices: [
            "p ∨ ¬p",
            "p ∧ ¬p",
            "p => ¬q",
            "¬p => p ∧ q",
            "p ∧ (p => q) => q"
        ],
        correctAnswer: "p ∨ ¬p",
        imageURL: null
    },
    {
        index: 20,
        question: "Какво НЕ е вярно относно значението на доказателството за повишаване качеството на софтуера?",
        choices: [
            "Доказателството помага в изясняването на системата и идентифицира скритите допускания",
            "Доказателството показва, че проектът е верен и обяснява защо е верен",
            "Доказателството осигурява, че имплементираната част от кода се държи като нейната спецификация",
            "Доказателството не оказва влияние върху качеството на софтуера",
            "Доказателството е приложимо при използване на формалните методи в практиката"
        ],
        correctAnswer: "Доказателството не оказва влияние върху качеството на софтуера",
        imageURL: null
    },
    {
        index: 21,
        question: "Какво означава, че твърдението W е семантично следствие на списъка P 'P |= W '?",
        choices: [
            "W е вярно, когато твърденията от списъка P са истина",
            "W е вярно независимо от стойностите на P",
            "W е винаги невярно, когато P е истина",
            "W може да бъде доказано само чрез индукция",
            "W не зависи от логическите оператори в P"
        ],
        correctAnswer: "W е вярно, когато твърденията от списъка P са истина",
        imageURL: null
    },
    {
        index: 22,
        question: "Кой е верният начин за доказване на следствието (p ⋀ q) |- (p v q)?",
        choices: [
            "p ∧ q; premise; p ∧-elimination; p ∨ q; ∨-introduction",
            "p ∨ q; premise; p ∨-elimination; p ∧ q; ∧-introduction",
            "p ∧ q; premise; p ∨ q; ∨-introduction",
            "p; premise; q; premise; p ∧ q; ∧-introduction",
            "p; premise; q; premise; p ∨ q; ∨-introduction"
        ],
        correctAnswer: "p ∧ q; premise; p ∧-elimination; p ∨ q; ∨-introduction",
        imageURL: null
    },
    {
        index: 22,
        question: "Кое от следните НЕ е основен метод за доказателство, използван за тези системи?",
        choices: [
            "Дедукция (Natural deduction)",
            "Доказателство чрез опровергаване (Proof by contradiction)",
            "Доказателство чрез анализ на случаи (Proof by case analysis)",
            "Разсъждение чрез равенства (Equational reasoning)",
            "Хеширане на данни"
        ],
        correctAnswer: "Kеширане на данни",
        imageURL: null
    },
    {
        index: 23,
        question: "Какво е необходимо, за да завършим системата на дедукция в пропозиционните изчисления?",
        choices: [
            "Нуждаем се от множество от правила за извод",
            "Необходимо е само да доказваме факти",
            "Трябва да съществуват единствено заключения",
            "Трябва да имаме единствена предпоставка",
            "Не са нужни правила за извод"
        ],
        correctAnswer: "Нуждаем се от множество от правила за извод",
        imageURL: null
    },
    {
        index: 24,
        question: "Каква е връзката между предпоставката и заключението в дедукцията?",
        choices: [
            "Истинността на заключението е следствие на истинността на предпоставката",
            "Заключението е независимо от предпоставките",
            "Предпоставките не влияят на заключението",
            "Истинността на предпоставката зависи от заключението",
            "Предпоставките и заключенията са идентични"
        ],
        correctAnswer: "Истинността на заключението е следствие на истинността на предпоставката",
        imageURL: "https://lawschooli.com/wp-content/uploads/2014/01/conclusion-housedog-1024x5851.png"
    },
    {
        index: 25,
        question: "Как се конструира доказателството чрез дедукция?",
        choices: [

            "Отпред назад, започвайки с предпоставките",
            "Случайно, без ясно определение на целта",
            "Отзад напред, използва се формулираната цел, за да се избере подходящо правилото за извод",
            "Чрез произволен избор на правила за извод",
            "Чрез проверка на примери"
        ],
        correctAnswer: "Отзад напред, използва се формулираната цел, за да се избере подходящо правилото за извод",
        imageURL: null
    },
    {
        index: 26,
        question: "Какво е правилото, което описва взаимната еквивалентност между p ∧ q и q ∧ p?",
        choices: [
            "p ∧ q; q ∧ p",
            "p ∨ q; q ∨ p",
            "¬p; ¬q",
            "p; q",
            "p ⇒ q; q ⇒ p"
        ],
        correctAnswer: "p ∧ q; q ∧ p",
        imageURL: null
    },
    {
        index: 27,
        question: "Кое от следните е правилно свързано с =>- elimination = modus ponens?",
        choices: [
            "=>-elimination",
            "¬-introduction",
            "v-elimination",
            "¬-elimination",
            "¬-modification"
        ],
        correctAnswer: "=>-elimination",
        imageURL: null
    },
    {
        index: 28,
        question: "Какво представлява ¬-introduction в контекста на доказателството / proof by contradiction(assumethattheconclusionis nottrue and derive something that we know to be false- Modus Tollens)/?",
        choices: [
            "Доказателство чрез опровергаване",
            "Доказателство чрез анализа на случаи",
            "Доказателство чрез натрупване на примери",
            "Доказателство чрез индукция",
            "Доказателство чрез аналогия"
        ],
        correctAnswer: "Доказателство чрез опровергаване",
        imageURL: null
    },
    {
        index: 29,
        question: "Каква техника представлява v-elimination / proof by cases (breakproof intoseparateparts andthen combine)/?",
        choices: [
            "Доказателство чрез индукция",
            "Доказателство чрез анализ на случаи",
            "Доказателство чрез контрапример",
            "Доказателство чрез дедукция",
            "Доказателство чрез разсъждение"
        ],
        correctAnswer: "Доказателство чрез анализ на случаи",
        imageURL: null
    },
    {
        index: 30,
        question: "Какво гласи правилото на Modus Tollens (the formal name for indirect proof or proof by contrapositive/contradiction)?",
        choices: [
            "Ако p е вярно, то q е вярно",
            "Ако q е вярно, то p е вярно",
            "Ако p => q е вярно и q е лъжа, то p е лъжа",
            "Ако p => q е вярно, то p е истинно, ако q е истина",
            "Ако p и q са верни, то p ∧ q е вярно"
        ],
        correctAnswer: "Ако p => q е вярно и q е лъжа, то p е лъжа",
        imageURL: null
    },
    {
        index: 31,
        question: "Каква е целта на Modus Tollens?",
        choices: [
            "Да се приеме, че целта не е вярна и да се достигне до неистинен факт",
            "Да се приемат за верни всички факти",
            "Да се построи доказателство от истински факти",
            "Да се анализират случаите поотделно",
            "Да се докаже истинността на твърдение"
        ],
        correctAnswer: "Да се приеме, че целта не е вярна и да се достигне до неистинен факт",
        imageURL: null
    },

    {
        index: 32,
        question: "В коя област се използва Modus Tollens?",
        choices: [
            "В експертни системи за медицинска диагностика",
            "В математическите доказателства",
            "В логическите игри",
            "В статистическите анализи",
            "В програмирането на софтуер"
        ],
        correctAnswer: "В експертни системи за медицинска диагностика",
        imageURL: null
    },
    {
        index: 34,
        question: "Каква е техниката при доказателство чрез разглеждане на различни случаи?",
        choices: [
            "Прекъсваме доказателството на части и след това ги комбинираме",
            "Доказваме твърдения чрез индукция",
            "Приемаме произволни предположения",
            "Извеждаме заключения от една предпоставка",
            "Използваме модус поненс"
        ],
        correctAnswer: "Прекъсваме доказателството на части и след това ги комбинираме",
        imageURL: null
    },
    {
        index: 35,
        question: "Какво е целта на задачата да се докаже, че дизюнкцията е комутативна?",
        choices: [
            "Да се покаже, че p v q е еквивалентно на q v p",
            "Да се докаже, че p v q е винаги вярно",
            "Да се демонстрира, че p и q са независими",
            "Да се формулират нови правила за логика",
            "Да се изрази дизюнкцията чрез конюнкция"
        ],
        correctAnswer: "Да се покаже, че p v q е еквивалентно на q v p",
        imageURL: null
    },
    {
        index: 37,
        question: "Какво гласи правилото на Modus Ponens s (Latin: mode that affirms (твърдя))?",
        choices: [
            "Ако p е вярно и p => q е вярно, то q е вярно",
            "Ако q е вярно, то p е вярно",
            "Ако p не е вярно, то q не е вярно",
            "Ако p и q са верни, то p ∧ q е вярно",
            "Ако p  q е вярно, то p е истинно, ако q е истина"
        ],
        correctAnswer: "Ако p е вярно и p => q е вярно, то q е вярно",
        imageURL: null
    },
    {
        index: 38,
        question: "Какво гласи правилото за доказателство чрез анализ на случаи /Case analysis/ ( p => r ) ∧ (q  => r)  ≡  ( p  v  q  => r )  ?",
        choices: [
            "Ако p е вярно, то q е вярно.",
            "Намираме случаите p и q, така че p v q е вярно, и показваме, че r е вярно в всеки случай kogato p=>r и q=>r.",
            "Показваме, че p v q е вярно, и след това доказваме, че r е вярно.",
            "Използваме обща формула, за да докажем, че p и q са верни.",
            "Всяко твърдение може да бъде доказано чрез импликация."
        ],
        correctAnswer: "Намираме случаите p и q, така че p v q е вярно, и показваме, че r е вярно в всеки случай kogato p=>r и q=>r.",
        imageURL: null
    },
    {
        index: 39,
        question: "Какво означава, че две изречения са еквивалентни -доказателство чрез равенства (equational reasoning)?",
        choices: [
            "Двете изречения имат равна стойност на истинност при всяка интерпретация.",
            "Двете изречения са истинни само при една интерпретация.",
            "Едното изречение е вярно, а другото е лъжливо.",
            "Двете изречения могат да бъдат заменени едно с друго в доказателствата.",
            "Двете изречения имат различни стойности на истинност."
        ],
        correctAnswer: "Двете изречения имат равна стойност на истинност при всяка интерпретация.",
        imageURL: null
    },
    {
        index: 40,
        question: "Кои от следните свойства могат да бъдат използвани при доказателства чрез еквивалентност?",
        choices: [

            "Само комутативност.",
            "Комутативност, асоциативност и дистрибутивност на операциите, закони на Де Морган, закон за двойното отрицание.",
            "Няма свойства, които могат да се използват.",
            "Съществува само дистрибутивност.",
            "Само асоциативност."
        ],
        correctAnswer: "Комутативност, асоциативност и дистрибутивност на операциите, закони на Де Морган, закон за двойното отрицание.",
        imageURL: null
    },
    {
        index: 41,
        question: "Какво означава, че пропозиционното изчисление е пълно:  P |= W , то P |- W?",
        choices: [
            "Всичко, което е валидно, може да бъде доказано чрез правила за извод.",
            "Всичко, което може да се докаже, е валидно.",
            "Има формули, които не могат да бъдат доказани.",
            "Само част от валидните твърдения могат да се докажат.",
            "Пълнотата не е важна за логиката."
        ],
        correctAnswer: "Всичко, което е валидно, може да бъде доказано чрез правила за извод.",
        imageURL: null
    },
    {
        index: 42,
        question: "Какво означава, че пропозиционното изчисление е последователно  P |- W , то  P |= W?",
        choices: [
            "Всички валидни твърдения могат да бъдат опровергани.",
            "Всичко, което може да се докаже, е валидно.",
            "Има изрази, които не могат да бъдат доказани.",
            "Всички доказателства са невалидни.",
            "Няма нужда от правила за извод."
        ],
        correctAnswer: "Всичко, което може да се докаже, е валидно.",
        imageURL: null
    },
    {
        index: 43,
        question: "Какво е предикатна логика и какво позволява?",
        choices: [
            "Ограничена е само до пропозиции без структура.",
            "Не може да формулира твърдения за специфични обекти.",
            "Позволява да формулираме твърдения за специфични обекти, но не ни дава възможност да формализираме изказвания от типа: Всеки студент има факултетен номер",
            "Обработва само числови данни.",
            "Не разкрива вътрешната структура на изказвания."
        ],
        correctAnswer: "Позволява да формулираме твърдения за специфични обекти, но не ни дава възможност да формализираме изказвания от типа: Всеки студент има факултетен номер",
        imageURL: null
    },
    {
        index: 44,
        question: "Какво представляват универсалните твърдения в предикатната логика?",
        choices: [
            "Отнасят се само до числови стойности.",
            "Описват характеристики на всеки обект от разглежданото множество.  Заявяваме, че всички елементи от дадено множество S удовлетворяват свойство P.",
            "Не могат да се формулират с предикати.",
            "Включват само конкретни примери без общо правило.",
            "Се използват само за изразяване на противоположности."
        ],
        correctAnswer: "Описват характеристики на всеки обект от разглежданото множество.  Заявяваме, че всички елементи от дадено множество S удовлетворяват свойство P.",
        imageURL: null
    },




];