// Z нотация. Логики и доказателства
export const mysql2 = [
    {
        index: 1,
        question: "Какви са основните елементи на формалната система?",
        choices: [
            "Азбука и речник",
            "Граматични правила и лексикални единици",
            "Теореми и аксиоми",
            "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        ],
        correctAnswer: "Формален език -синтаксис/азбука + граматични правила/ и система за извод-заключение /аксиоми + правила за извод/",
        imageURL: null
    },
    {
        index: 2,
        question: "Кое от следните описва елементи на формалния език?",
        choices: [
            "Азбука и граматични правила",
            "Състояния на системата и структури от данни",
            "Аксиоми и правила за извод",
            "Проектиране на системи и данни"
        ],
        correctAnswer: "Азбука и граматични правила",
        imageURL: null
    },
    {
        index: 3,
        question: "Какво включва системата за извод/заключение (семантика) във формалната система?",
        choices: [
            "Аксиоми и правила за извод",
            "Граматични правила и азбука",
            "Данни и свойства",
            "Състояния на системата и операции"
        ],
        correctAnswer: "Аксиоми и правила за извод",
        imageURL: null
    },
    {
        index: 4,
        question: "Какво е основната цел на формалната спецификация в софтуерните системи?",
        choices: [
            "Да опише математическите обекти спрямо особеностите на проектираната система",
            "Да създаде кратки описания на различни езици",
            "Да синтезира нови програмни езици",
            "Да дефинира граматичните правила за състояния на системите"
        ],
        correctAnswer: "Да опише математическите обекти спрямо особеностите на проектираната система",
        imageURL: null
    },
    {
        index: 5,
        question: "Кои аспекти на проектираната система трябва да бъдат описани във формалната спецификация?",
        choices: [
            "Състояния на системата, структури от данни, техни свойства и операции",
            "Граматични правила и синтаксис",
            "Аксиоми и правила за извод",
            "Релации между обектите и системните състояния"
        ],
        correctAnswer: "Състояния на системата, структури от данни, техни свойства и операции",
        imageURL: null
    },
    {
        index: 6,
        question: "Кои две теории са в основата на всяка софтуерна спецификация в Z нотацията?",
        choices: [
            "Математическата логика и теорията на множествата",
            "Теорията на графите и теорията на числата",
            "Теорията на информацията и теорията на автоматите",
            "Теорията на вероятностите и линейната алгебра"
        ],
        correctAnswer: "Математическата логика и теорията на множествата",
        imageURL: null
    },
    {
        index: 7,
        question: "Какво е Z нотацията?",
        choices: [
            "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
            "Графични диаграми за визуализиране на състоянието на системата",
            "Алгоритми за оптимизация на системата",
            "Методи за тестване на производителността на системата"
        ],
        correctAnswer: "Z нотацията организира структури, наречени схеми, използвани за: 1/събиране на части от информацията,2/ формулиране на общи описания,3/доказателства за изследване характеристиките на системата.",
        imageURL: null
    },
    {
        index: 6,
        question: "За какво може да се използва езикът на схемите в Z нотацията?",
        choices: [
            "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
            "За проектиране на графичен интерфейс и визуализиране на данни",
            "За описание на алгоритми и тяхната сложност",
            "За дефиниране на комуникационни протоколи и обмен на съобщения"
        ],
        correctAnswer: "За описание на тип(данни), състоянието на системата и начините за промяна на състоянието",
        imageURL: null
    },
    {
        index: 7,
        question: "Кои са двете основни формални системи, използвани в логиката за описание на софтуерни системи?",
        choices: [
            "Пропозиционна логика и предикатна логика",
            "Теория на графите и теория на числата",
            "Логика на вероятностите и теория на игрите",
            "Автоматна теория и лингвистика"
        ],
        correctAnswer: "Пропозиционна логика и предикатна логика",
        imageURL: null
    },
    {
        index: 8,
        question: "Кой не е от основни методи за доказателство, използвани за тези системи?",
        choices: [
            "Дедукция (Natural deduction)",
            "Доказателство чрез опровергаване (Proof by contradiction)",
            "Доказателство чрез анализ на случаи (Proof by case analysis)",
            "Разсъждение чрез равенства (Equational reasoning)",
            "Хеширане на данни",
        ],
        correctAnswer: "Хеширане на данни",
        imageURL: null
    }


];