// Z нотация - Схеми
export const mysql9 = [
  {
    index: 1,
    question: "Какво представлява конкурентна програма?",
    choices: [
      "Програма с един поток на управление",
      "Програма с множество потоци на управление",
      "Програма, базирана на релационна база данни",
      "Програма, която използва изключително мрежови взаимодействия"
    ],
    correctAnswer: "Програма с множество потоци на управление",
    imageURL: ""
  },
  {
    index: 2,
    question: "Коя е основната разлика между локално и мрежово взаимодействие при конкурентното програмиране?",
    choices: [
      "Локалното използва споделена памет, а мрежовото – протоколи",
      "Локалното използва мрежови протоколи, а мрежовото – споделена памет",
      "Няма разлика",
      "Мрежовото взаимодействие е по-бързо"
    ],
    correctAnswer: "Локалното използва споделена памет, а мрежовото – протоколи",
    imageURL: ""
  },
  {
    index: 3,
    question: "Защо се използва конкурентно програмиране?",
    choices: [
      "За повишаване на производителността",
      "За намаляване на броя на грешките",
      "За лесно тестване",
      "За ограничаване на достъпа до мрежата"
    ],
    correctAnswer: "За повишаване на производителността",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какви проблеми може да възникнат при грешки в конкурентното програмиране?",
    choices: [
      "Малки грешки, които лесно се коригират",
      "Проблеми само с входно-изходни операции",
      "Невъзможност за стартиране на програмата",
       "Катастрофални резултати, като тези в Therac-25",
    ],
    correctAnswer: "Катастрофални резултати, като тези в Therac-25",
    imageURL: ""
  },
  {
    index: 5,
    question: "Каква е ролята на моделите при конкурентното програмиране?",
    choices: [
      "Да визуализират и проверяват поведението",
      "Да заменят реалните програми",
      "Да симулират хардуерни процеси",
      "Да подобряват производителността на програмата"
    ],
    correctAnswer: "Да визуализират и проверяват поведението",
    imageURL: ""
  },
  {
    index: 6,
    question: "Кое е основното средство за анализ на модели в конкурентното програмиране?",
    choices: [
      "Релационни бази данни",
      "Фреймуърк за мрежова комуникация",
      "Алгоритми за машинно обучение",
       "Системи с етикетирани преходи (LTS)",
    ],
    correctAnswer: "Системи с етикетирани преходи (LTS)",
    imageURL: ""
  },
  {
    index: 7,
    question: "Примери за грешки в конкурентното програмиране?",
    choices: [
      "Mars Rover и Therac-25",
      "Google Search и Facebook",
      "UNIX и Linux",
      "Компилатори и интерпретатори"
    ],
    correctAnswer: "Mars Rover и Therac-25",
    imageURL: ""
  },

  {
    index: 8,
    question: "Какво е системата за круиз контрол в контекста на конкурентното програмиране?",
    choices: [
      "Пример за грешка при синхронизация",
      "Пример за последователно програмиране",
            "Пример за използване на множество нишки",
      "Пример за модел без взаимодействия"
    ],
    correctAnswer: "Пример за използване на множество нишки",
    imageURL: ""
  },


  
];