
export const mysql1 = [
  {
    index: 1,
    question: "Какво представлява моделът в контекста на изследванията?",
    choices: [
      "Оригинално изображение на обекта на изследване",
      "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
      "Метод за описване на реални обекти с точни измервания",
      "Форма на реално съществуване на обекта"
    ],
    correctAnswer: "Моделът е някакво (опростено) представяне на обекта на изследване във форма, различна от реалното му съществуване.",
    imageURL: null
  },
  {
    index: 2,
    question: "Каква е основната цел на модела при изследването на обекти?",
    choices: [
      "Да отразява обекта в неговата реална форма",
      "Да предостави достатъчно информация за изучаване на обекта чрез опростено представяне",
      "Да увеличи сложността на обекта за по-точно изучаване",
      "Да копира точно всички характеристики на обекта"
    ],
    correctAnswer: "Да предостави достатъчно информация за изучаване на обекта чрез опростено представяне",
    imageURL: null
  }

]


