export const mysql7 = [
  {
    index: 1,
    question: "Коя от следните НЕ е тактика за изменяемост (modifiability)?",
    choices: [
      "Локализиране на промените",
      "Предотвратяване на ефекта на вълната",
      "Отлагане на свързването",
      "Откриване на откази"
    ],
    correctAnswer: "Откриване на откази",
    imageURL: null
  },
  {
    index: 2,
    question: "Каква е целта на локализирането на промените като тактика за изменяемост?",
    choices: [
      "Да се увеличи сигурността на системата.",
      "Да се намали броят на засегнатите модули при промяна.",
    ],
    correctAnswer: "Да се намали броят на засегнатите модули при промяна.",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво означава 'семантична свързаност' в контекста на изменяемост?",
    choices: [
      "Задачи в модулите са свързани по начин, който намалява зависимостите /middleware/.",
      "Данните между модулите са криптирани за сигурност.",
    ],
    correctAnswer: "Задачи в модулите са свързани по начин, който намалява зависимостите /middleware/.",
    imageURL: null
  },
  {
    index: 4,
    question: "Каква е целта на ограничаването на възможните опции при локализиране на промените?",
    choices: [
      "Да се създадат допълнителни връзки между компонентите.",
      "Да се намали влиянието на промени върху модули извън директно засегнатите.",
    ],
    correctAnswer: "Да се намали влиянието на промени върху модули извън директно засегнатите.",
    imageURL: null
  },
  {
    index: 5,
    question: "Какво НЕ включва предотвратяване на ефекта на вълната?",
    choices: [
      "Скриване на информация",
      "Ограничаване на комуникацията",
      "Намаляване на времето за разработка",
      "Поддръжка на съществуващите интерфейси",
      "Използване на посредник"
    ],
    correctAnswer: "Намаляване на времето за разработка",
    imageURL: null
  },
  {
    index: 6,
    question: "Коя от следните тактики НЕ е свързана с отлагане на свързването?",
    choices: [
      "Включване/изкл./замяна на компоненти, както по време на изпълнението (plugand-play), така и по време на зареждането (component replacement)",
      "Конфигурационни файлове",
      "Оптимизация на интерфейса",
      "Дефиниране и придържане към протоколи, които позволяват промяна на компоненти по време на изпълнение"
    ],
    correctAnswer: "Оптимизация на интерфейса",
    imageURL: null
  },
  {
    index: 7,
    question: "Каква е основната цел на използваемостта като качествена характеристика?",
    choices: [
      "Да увеличи броя на модулите.",
      "Да улесни изпълнението на задачи от крайния потребител.",
    ],
    correctAnswer: "Да улесни изпълнението на задачи от крайния потребител.",
    imageURL: null
  },
  {
    index: 8,
    question: "Каква е основната цел на тестируемостта?",
    choices: [
      "Да осигури конфиденциалност на данните.",
      "Да подпомогне проверката на качеството на софтуера.",
    ],
    correctAnswer: "Да подпомогне проверката на качеството на софтуера.",
    imageURL: null
  },
  {
    index: 9,
    question: "Коя от следните тактики НЕ е от тактиките за сигурност (Security)?",
    choices: [
      "Тактики за устояване на атаките (ключалка на вратата)",
      "Тактики за откриване на атаките (аларма)",
      "Отлагане на свързването",
      "Тактики за възстановяване след атака (застраховка)",
    ],
    correctAnswer: "Отлагане на свързването",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява 'audit trail' в тактиките за сигурност?",
    choices: [
      "Ограничение на достъпа до системата.",
      "Запис на всяка транзакция за проследяване на действията, заедно с информация, която идентифицира извършителя по недвусмислен начин",
    ],
    correctAnswer: "Запис на всяка транзакция за проследяване на действията, заедно с информация, която идентифицира извършителя по недвусмислен начин",
    imageURL: null
  },
  {
    index: 11,
    question: "Каква е целта на модела на потребителя в тактиките за използваемост?",
    choices: [
      "Да се приспособи системата към очакванията и поведението на потребителя.",
      "Да се увеличи броя на функциите."
    ],
    correctAnswer: "Да се приспособи системата към очакванията и поведението на потребителя.",
    imageURL: null
  },
  {
    index: 12,
    question: "Каква е целта на архитектурните решения, свързани с производителността?",
    choices: [
      "Да се повиши нивото на сигурност.",
      "Да се намали времето за отговор и разпределение на ресурсите.",
    ],
    correctAnswer: "Да се намали времето за отговор и разпределение на ресурсите.",
    imageURL: null
  },
  {
    index: 13,
    question: "Кои два аспекта НЕ са в конфликт според разглежданите тактики?",
    choices: [
      "Сигурност vs. отказоустойчивост",
      "Моделиране vs. оптимизация",
      "Преносимост vs. Производителност"
    ],
    correctAnswer: "Моделиране vs. оптимизация",
    imageURL: null
  },
  {
    index: 14,
    question: "Каква е целта на ограничаването на експозицията в тактиките за сигурност?",
    choices: [
      "Да се намали броят на уязвимите точки в системата.",
      "Да се оптимизира тестването."
    ],
    correctAnswer: "Да се намали броят на уязвимите точки в системата.",
    imageURL: null
  },
  {
    index: 15,
    question: "Каква е основната цел на използване на компонентна замяна в архитектурните тактики?",
    choices: [
      "Да се намали времето за разработка.",
      "Да се даде възможност за промяна на компоненти по време на изпълнение.",
    ],
    correctAnswer: "Да се даде възможност за промяна на компоненти по време на изпълнение.",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво е 'моделиране на задачата' в използваемостта?",
    choices: [
      "Системата ограничава достъпа до задачите.",
      "Системата разбира каква задача изпълнява потребителят и го подпомага.",
    ],
    correctAnswer: "Системата разбира каква задача изпълнява потребителят и го подпомага.",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво е 'скриване на информация' в контекста на тактиките за изменяемост?",
    choices: [
      "Системата събира информация от различни модули.",
      "Системата разделя отговорностите, така че част от информацията остава скрита.",
    ],
    correctAnswer: "Системата разделя отговорностите, така че част от информацията остава скрита.",
    imageURL: null
  },
  {
    index: 18,
    question: "Коя не е от тактиките за изпитаемост (Testability)?",
    choices: [
      "code review",
      "специализиран софтуер за тестване",
      "тестващ софтуер, който тества софтуера за тестване",
      "вградени модули за мониторинг",
      "тактиката за идентифициране на атакуващия - audit trail"
    ],
    correctAnswer: "тактиката за идентифициране на атакуващия - audit trail",
    imageURL: null
  },
  {
    index: 19,
    question: "Кое твърдение е вярно относно поддръжката на интерфейси?",
    choices: [
      "Адаптерът позволява съвместимост при промяна на интерфейси.",
      "Адаптерите намаляват производителността."
    ],
    correctAnswer: "Адаптерът позволява съвместимост при промяна на интерфейси.",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое от следните описва основната цел на удобството при употребата по време на изпълнение?",
    choices: [
      "Оптимизиране на производителността.",
      "Осигуряване на обратна връзка и лесна навигация за потребителя."
    ],
    correctAnswer: "Осигуряване на обратна връзка и лесна навигация за потребителя.",
    imageURL: null
  },
  {
    index: 21,
    question: "Кое от следните НЕ е част от тактиките за устояване на атаки - тактики за сигурност?",
    choices: [
      "Автентикация на потребителите - проверка на тяхната идентичност.",
      "Ограничаване на достъпа чрез firewall и др.",
      "Конфиденциалност на данните чрез криптиране.",
      "Пълно премахване на всички външни комуникации.",
      "Оторизация - дали потребителя има достъп до определени ресурси ",
      "Интегритет – включване на различни механизми на излишък – чек-суми, хеш-алгоритми и т.н.",
      "Ограничаване на експозицията т.е. на местата, чрез които можем да бъдем атакувани"
    ],
    correctAnswer: "Пълно премахване на всички външни комуникации.",
    imageURL: null
  },
  {
    index: 22,
    question: "Коя от следните НЕ е част от тактиките за използваемост (Usability)?",
    choices: [
      "Тактики за използваемост по време на изпълнението  (runtime), насочени към крайния потребител.",
      "Тактики за използваемост, свързани с UI, насочени към разработчика на интерфейса.",
      "Тактики за разделяне на интерфейса от реализацията чрез подходи като MVC.",
      "Тактики за повишаване на производителността на хардуера."
    ],
    correctAnswer: "Тактики за повишаване на производителността на хардуера.",
    imageURL: null
  },
  {
    index: 23,
    question: "Какво е 'моделиране  на системата' в използваемостта?",
    choices: [
      "Моделът на системата ограничава достъпа до задачите.",
      "Моделът на системата включва очакваното поведение, така че тя да предоставя адекватна обратна връзка /progress bar/",
    ],
    correctAnswer: "Моделът на системата включва очакваното поведение, така че тя да предоставя адекватна обратна връзка /progress bar/",
    imageURL: null
  },


];