export const mysql8 = [
  {
    index: 1,
    question: "Какво Не е вярно за ADD /Attribute Driven Design/ подхода в проектирането на софтуерната архитектура?",
    choices: [
      "Детайлно документиране на всички модули",
      "Използване на качествени свойства като основа за проектиране",
      "Това е рекурсивен процес като на всяка стъпка се използват тактики и архитектурни модели за постигане на желаните качествени свойства",
      "В резултат се получават първите няколко нива на модулната декомпозиция"
    ],
    correctAnswer: "Детайлно документиране на всички модули",
    imageURL: null
  },
  {
    index: 2,
    question: "Коe НЕ е стъпка в ADD процеса?",
    choices: [
      "Създава се прототип",
      "Избиране на модул за декомпозиция",
      "Модулът се детайлизира: арх. драйвери, арх. модел, под-модули със сценарии за употреба, ограничения и интерфейси",
    ],
    correctAnswer: "Създава се прототип",
    imageURL: null
  },
  {
    index: 3,
    question: "Кои НЕ са тактики за постигане на изменяемост (modifiability)?",
    choices: [
      "Ограничаване на вълнообразните ефекти",
      "Локализиране на промените и скриване на информация",
      "Отлагане на обвързването",
      "Управление на ресурсите",
      "Поддръжка на семантична съгласуваност"
    ],
    correctAnswer: "Управление на ресурсите",
    imageURL: null
  },
  {
    index: 4,
    question: "Какво НЕ включват входните данни за ADD?",
    choices: [
      "Функционални изисквания - сценарии за употреба (use-cases)",
      "Качествени свойства- специфични сценарии за проявление",
      "Изготвяне прототип",
      "Функционални ограничения (constraints)"
    ],
    correctAnswer: "Изготвяне прототип",
    imageURL: null
  },
  {
    index: 5,
    question: "Какво представлява архитектурен драйвер?",
    choices: [
      "Най-важните изисквания за даден етап",
      "Подробен сценарий за употреба",
    ],
    correctAnswer: "Най-важните изисквания за даден етап",
    imageURL: null
  },
  {
    index: 6,
    question: "Какво е основната цел на локализирането на промените?",
    choices: [
      "Увеличаване на бързодействието",
      "Намаляване на ефекта на вълната",
    ],
    correctAnswer: "Намаляване на ефекта на вълната",
    imageURL: null
  },
  {
    index: 7,
    question: "Коя от следните тактики НЕ е свързана с бързодействието?",
    choices: [
      "Скриване на информация",
      "Намаляване на изискванията за ресурси",
      "Управление на раздаването на ресурси",
      "Управление на ресурсите",
       "Увеличаване на ефективността на алгоритмите",
    ],
    correctAnswer: "Скриване на информация",
    imageURL: null
  },
  {
    index: 8,
    question: "Как се проверява коректността на декомпозицията в ADD?",
    choices: [
      "Чрез сравнение с конкурентни модели",
      "Чрез покритие на изискванията и сценарии",
    ],
    correctAnswer: "Чрез покритие на изискванията и сценарии",
    imageURL: null
  },
  {
    index: 9,
    question: "Какво включва документацията на интерфейсите?",
    choices: [
      "Списък с функции на хардуера",
      "Услуги и свойства, предлагани или изисквани от модулите",
    ],
    correctAnswer: "Услуги и свойства, предлагани или изисквани от модулите",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява скелетна система?",
    choices: [
      "Първоначална реализация на основните модули",
      "Детайлен план на архитектурните драйвери"
    ],
    correctAnswer: "Първоначална реализация на основните модули",
    imageURL: null
  },
  {
    index: 11,
    question: "Какво означава 'виртуални машини' в контекста на ADD?",
    choices: [
      "Модули за управление на потребителския интерфейс и сензорите",
      "Оптимизационни алгоритми",
    ],
    correctAnswer: "Модули за управление на потребителския интерфейс и сензорите",
    imageURL: null
  },
  {
    index: 12,
    question: "Кое е най-честото приложение на стъбове в скелетната система?",
    choices: [
      "Тестване на модули поотделно",
      "Ограничаване на разходите за хардуер"
    ],
    correctAnswer: "Тестване на модули поотделно",
    imageURL: null
  },
  {
    index: 13,
    question: "Кои са основните структурни групи, използвани в ADD?",
    choices: [
      "Процеси, комуникации, разположения",
      "Алгоритми, тактики, стратегии"
    ],
    correctAnswer: "Процеси, комуникации, разположения",
    imageURL: null
  },

  {
    index: 16,
    question: "Какво се документира като изход от всяка стъпка на ADD?",
    choices: [
      "Резултати от изпълнението на тестовете",
      "Списък с модули и техните интерфейси",
    ],
    correctAnswer: "Списък с модули и техните интерфейси",
    imageURL: null
  },
  {
    index: 18,
    question: "Кое е основно качество на модулите в ADD?",
    choices: [
      "Сложност и автономност",
      "Координация между под-модулите",
      "Семантична съгласуваност",
      "Функционално обвързване"
    ],
    correctAnswer: "Семантична съгласуваност",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво представляват сценариите за качество в ADD?",
    choices: [
      "Функционални ограничения на системата",
      "Приложения на качествени свойства в специфични контексти",
    ],
    correctAnswer: "Приложения на качествени свойства в специфични контексти",
    imageURL: null
  },
  {
    index: 20,
    question: "Кой е основният резултат от рекурсивното прилагане на ADD?",
    choices: [
      "Пълна модулна декомпозиция на системата",
      "Списък с алгоритми за критични изчисления",
    ],
    correctAnswer: "Пълна модулна декомпозиция на системата",
    imageURL: null
  }
  

];