export const mysql1 = [
  {
    index: 1,
    question: "Какво представлява софтуерната архитектура според определението от Software Engineering Institute?",
    choices: [
      "Съвкупност от изгледи, които показват различните софтуерни елементи на системата, техните външни видими свойства и връзките между тях.",
      "Начинът, по който различните софтуерни компоненти са разпределени между хардуерните възли в системата."
    ],
    correctAnswer: "Съвкупност от изгледи, които показват различните софтуерни елементи на системата, техните външни видими свойства и връзките между тях.",
    imageURL: null
  },
  {
    index: 2,
    question: "Кои са основните фактори, които влияят върху определянето на софтуерната архитектура?",
    choices: [
      "Изискванията на системата",
      "Технически, бизнес и социални влияния, опит и знания на архитекта, съвременни технологии",
      "Организационната структура на разработващата организация",
      "Всички изброени фактори"
    ],
    correctAnswer: "Всички изброени фактори",
    imageURL: null
  },
  {
    index: 3,
    question: "Кои са основните участници (stakeholders), които имат интерес към софтуерната архитектура и как това влияе върху нея?",
    choices: [
      "Различните заинтересовани лица (stakeholders) като собственици, мениджъри, разработчици, крайни потребители и др. имат разнопосочни интереси, които често си противоречат. Ролята на архитекта е да балансира между тези различни интереси и да намери компромисно решение.",
      "Няма такива"
    ],
    correctAnswer: "Различните заинтересовани лица (stakeholders) като собственици, мениджъри, разработчици, крайни потребители и др. имат разнопосочни интереси, които често си противоречат. Ролята на архитекта е да балансира между тези различни интереси и да намери компромисно решение.",
    imageURL: null
  },
  {
    index: 4,
    question: "Какви са основните дейности, в които архитектът участва при разработването на софтуерна система?",
    choices: [
      "Вземане на бизнес решения, разбиране на изискванията, създаване или избор на архитектура, документиране на архитектурата, анализ и оценка на архитектурата, наблюдение на съответствието между архитектурата и реализацията.",
      "Няма такива"
    ],
    correctAnswer: "Вземане на бизнес решения, разбиране на изискванията, създаване или избор на архитектура, документиране на архитектурата, анализ и оценка на архитектурата, наблюдение на съответствието между архитектурата и реализацията.",
    imageURL: null
  },
  {
    index: 5,
    question: "Какво е основното предназначение на софтуерната архитектура?",
    choices: [
      "Да гарантира наличието на дадени качества в системата.",
      "Да определя детайлите като алгоритми, представяне на данни и имплементация.",
    ],
    correctAnswer: "Да гарантира наличието на дадени качества в системата.",
    imageURL: null
  },
  {
    index: 7,
    question: "Какви качества трябва да притежава успешен софтуерен архитект?",
    choices: [
      "Отлично познаване само на технологиите.",
      "Отлични комуникативни умения.",
      "Умение за абстрактно мислене.",
      "Всички изброени качества."
    ],
    correctAnswer: "Всички изброени качества.",
    imageURL: null
  },
  {
    index: 8,
    question: "Коя от изброените дейности не е основна отговорност на софтуерния архитект?",
    choices: [
      "Вземане на бизнес решения.",
      "Разбиране на изискванията.",
      "Избор на подходящ програмен език.",
      "Създаване или избор на подходяща архитектура."
    ],
    correctAnswer: "Избор на подходящ програмен език.",
    imageURL: null
  },
  {
    index: 9,
    question: "Защо документирането на софтуерната архитектура е важна дейност на архитекта?",
    choices: [
      "Защото най-добрата архитектура е безполезна, ако не бъде представена на заинтересованите страни.",
      "За да може да бъде лесно сравнявана с други архитектури."
    ],
    correctAnswer: "Защото най-добрата архитектура е безполезна, ако не бъде представена на заинтересованите страни.",
    imageURL: null
  },
  {
    index: 10,
    question: "Каква е ролята на архитекта по време на реализацията на системата?",
    choices: [
      "Да определя точните изисквания.",
      "Да наблюдава дали се спазват предписанията на архитектурата.",
    ],
    correctAnswer: "Да наблюдава дали се спазват предписанията на архитектурата.",
    imageURL: null
  },
  {
    index: 11,
    question: "Как архитектът следи за съответствието между реализираната система и нейната архитектура?",
    choices: [
      "Чрез редовни срещи с разработчиците.",
      "Чрез периодични ревизии на системата и адаптиране на архитектурата към промените."
    ],
    correctAnswer: "Чрез периодични ревизии на системата и адаптиране на архитектурата към промените.",
    imageURL: null
  },
  {
    index: 12,
    question: "Кое от следните НЕ се отнася до софт. архитектура?",
    choices: [
      "Организационна архитектура (Enterprise architecture)",
      "Системна архитектура (System architecture)",
      "Архитектура на приложението (Application architecture)",
      "Нито едно от изброените"
    ],
    correctAnswer: "Нито едно от изброените",
    imageURL: null
  },
  {
    index: 13,
    question: "Кои са основните заинтересовани страни (stakeholders), които влияят върху софтуерната архитектура?",
    choices: [
      "Cобствениците и мениджърите на организацията",
      "Крайните потребители на системата",
      "Разработчиците, тестърите и екипа за поддръжка",
      "Всички, които имат отношение към създаването на софтуерната система"
    ],
    correctAnswer: "Всички, които имат отношение към създаването на софтуерната система",
    imageURL: null
  },
  {
    index: 14,
    question: "Как архитектът трябва да се справя с противоречивите интереси на различните заинтересовани страни?",
    choices: [
      "Да убеди всички заинтересовани страни да се откажат от своите интереси.",
      "Да се опита да балансира между различните интереси и да намери компромисно решение.",
    ],
    correctAnswer: "Да се опита да балансира между различните интереси и да намери компромисно решение.",
    imageURL: null
  },
  {
    index: 15,
    question: "Кои от следните дейности не са пряка отговорност на софтуерния архитект?",
    choices: [
      "Вземане на бизнес решения за създаване на системата",
      "Създаване на документация за софтуерната архитектура",
      "Анализ и оценка на софтуерната архитектура",
      "Избор на подходящи софтуерни библиотеки и технологии"
    ],
    correctAnswer: "Избор на подходящи софтуерни библиотеки и технологии",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво от изпроените не е етап от процеса за разработка на софтуер?",
    choices: [
      "Анализ на изискванията (Requirements)",
      "Дизайн (design)",
      "Реализация (Implementation)",
      "Валидация и верификация (Testing, Verification, Validation)",
      "Поддръжка (Maintenance)",
      "Продажба"
    ],
    correctAnswer: "Продажба",
    imageURL: null
  },


]


