export const mysql4 = [
  {
    index: 1,
    question: "Каква е целта на шаблона 'Circuit Breaker' /aвтоматичен прекъсвач/ в разпределени среди?",
    choices: [
      "Да подобри сигурността на комуникациите.",
      "Да предотврати излишно чакане за отказали услуги.",
      "Да ускори обработката на заявки.",
      "Да увеличи капацитета за съхранение на данни."
    ],
    correctAnswer: "Да предотврати излишно чакане за отказали услуги.",
    imageURL: "https://anarsolutions.com/wp-content/uploads/2023/08/Circuit-Breaker-Design-Pattern-1.png"
  },
  {
    index: 2,
    question: "Коя от следните характеристики НЕ се отнася за архитектурния стил 'Sharding'?",
    choices: [
      "Разделяне на базата данни на хоризонтални части",
      "Подобряване на скалируемостта и разпределението на данни",
      "Използване на части с променливи размери",
      "Повишаване на капацитета на съхранение и мрежова честотна лента"
    ],
    correctAnswer: "Използване на части с променливи размери",
    imageURL: "https://miro.medium.com/v2/resize:fit:1024/1*eQcV0ufXU4CzzqCltZbIYA.png"
  },
  {
    index: 3,
    question: "Какво представлява 'Queue' в облачните архитектури?",
    choices: [
      "Протокол за сигурност на данни",
      "Архитектурен шаблон за криптиране",
      "Буфер за заявки, който смекчава тежките натоварвания",
      "Модул за управление на паметта"
    ],
    correctAnswer: "Буфер за заявки, който смекчава тежките натоварвания",
    imageURL: "https://achindrabhatnagar.wordpress.com/wp-content/uploads/2017/07/message-queue-example.png"
  },
  {
    index: 4,
    question: "Кое твърдение е вярно за 'Standard Queue'?",
    choices: [
      "Заявките се обработват според приоритета им.",
      "Буферът съхранява съобщенията до тяхното извличане.",
      "Заявките автоматично се разделят по шардове.",
      "Съхранява само ограничен брой заявки."
    ],
    correctAnswer: "Буферът съхранява съобщенията до тяхното извличане.",
    imageURL: "https://fourtheorem.com/wp-content/uploads/2022/09/SQS-Blog-Diagram-6.webp"
  },
  {
    index: 5,
    question: "Каква е целта на 'Priority Queue'?",
    choices: [
      "Да оптимизира скоростта на обработка.",
      "Да намали броя на обработените заявки.",
      "Да сортира входящите заявки по приоритет.",
      "Да ограничи броя на шардовете в базата данни."
    ],
    correctAnswer: "Да сортира входящите заявки по приоритет.",
    imageURL: "https://dotnettrickscloud.blob.core.windows.net/article/data%20structures/3720240402230348.com-png-to-webp-converter"
  },
  {
    index: 6,
    question: "Кое НЕ е характеристика на 'Fixed Length Queue'?",
    choices: [
      "Изпраща изключение при достигане на лимит.",
      "Приема неограничен брой заявки.",
      "Служи за защита от denial-of-service атаки.",
      "Сигнализира, когато заявката няма да бъде обработена."
    ],
    correctAnswer: "Приема неограничен брой заявки.",
    imageURL: null
  },
  {
    index: 7,
    question: "Каква е основната функция на 'Cache' в облачните архитектури?",
    choices: [
      "Управлява задачите за приоритетно обработване.",
      "Служи за защита на данни чрез криптиране.",
      "Увеличава капацитета за съхранение.",
      "Оптимизира повторния достъп до информация.",
    ],
    correctAnswer: "Оптимизира повторния достъп до информация.",
    imageURL: null
  },
  {
    index: 8,
    question: "Какво представлява 'SOAP' (Simple Object Access Protocol) в контекста на уеб услугите?",
    choices: [
      "Протокол за сигурност на мрежата",
      "Протокол за обмен на съобщения, базиран на XML",
      "Метод за кеширане на данни",
      "Метод за обработка на заявки с висока приоритетност"
    ],
    correctAnswer: "Протокол за обмен на съобщения, базиран на XML",
    imageURL: null
  },
  {
    index: 9,
    question: "Коя от следните характеристики е свързана с 'RESTful' уеб услугите?",
    choices: [
      "Ниско натоварване и по-бързо изпълнение",
      "Използване на SOAP и WSDL за комуникация",
      "Поддръжка на състоянието в сървъра",
      "Стандартизирани интерфейси за описание на услуги."
    ],
    correctAnswer: "Ниско натоварване и по-бързо изпълнение",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво е 'WSDL' (Web Services Description Language)?",
    choices: [
      "Протокол за криптиране",
      "Метод за създаване на кеш",
      "Език за описание на уеб услуги",
      "Метод за шардване на база данни"
    ],
    correctAnswer: "Език за описание на уеб услуги",
    imageURL: null
  },
  {
    index: 11,
    question: "Кое е основно предимство на микросървисната архитектура?",
    choices: [
      "Предоставя независимост на отделните услуги.",
      "Увеличава зависимостите между компонентите.",
      "Намалява нуждата от кеширане.",
      "Позволява само една услуга на сървър."
    ],
    correctAnswer: "Предоставя независимост на отделните услуги.",
    imageURL: "https://admin.wac.co/uploads/Microservices_Architecture_detail_d1f13729e7.jpg"
  },
  {
    index: 12,
    question: "Какво е 'Resource' в контекста на RESTful (REpresentationalState Transfer) архитектурата?",
    choices: [
      "Системен ресурс за съхранение",
      "Данен елемент, който може да има множество представяния",
      "Протокол за свързване на уеб услуги",
      "Ключов елемент за приоритизация"
    ],
    correctAnswer: "Данен елемент, който може да има множество представяния",
    imageURL: null
  },
  {
    index: 13,
    question: "Коя операция в RESTful архитектурата се използва за създаване на ресурс?",
    choices: [
      "GET",
      "POST",
      "DELETE",
      "PUT"
    ],
    correctAnswer: "POST",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво означава операцията 'GET' в RESTful архитектурата?",
    choices: [
      "Създава нов ресурс",
      "Изтрива съществуващ ресурс",
      "Чете стойността на ресурс",
      "Актуализира ресурс"
    ],
    correctAnswer: "Чете стойността на ресурс",
    imageURL: null
  },
  {
    index: 15,
    question: "Какво представлява URL в RESTful уеб услугите?",
    choices: [
      "Идентификатор за местоположението на ресурс",
      "Протокол за защита на данни",
      "Модул за криптиране",
      "Система за управление на кеш"
    ],
    correctAnswer: "Идентификатор за местоположението на ресурс",
    imageURL: "https://www.infotex.uk/app/uploads/2024/03/Anatomy-of-a-URL-Feature-Image-Lightv2.jpeg"
  },
  {
    index: 16,
    question: "Коя от следните операции в RESTful услугите изтрива ресурс?",
    choices: [
      "DELETE",
      "GET",
      "POST",
      "PUT"
    ],
    correctAnswer: "DELETE",
    imageURL: null
  },
  {
    index: 17,
    question: "Кой архитектурен стил е създадена за обработка на голям брой едновременни заявки?",
    choices: [
      "Priority Queue",
      "Sharding",
      "Circuit Breaker",
      "Standard Queue"
    ],
    correctAnswer: "Standard Queue",
    imageURL: null
  },
  {
    index: 18,
    question: "Каква е целта на 'Cache' при запис на данни?",
    choices: [
      "Увеличаване на капацитета за съхранение.",
      "Засилване на сигурността на данните.",
      "Изтриване на съответния елемент в кеша.",
      "Повишаване на приоритет на кеширания елемент."
    ],
    correctAnswer: "Изтриване на съответния елемент в кеша.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво е основната цел на 'Service-oriented Architecture'?",
    choices: [
      "Да използва самостоятелни услуги за изграждане на разпределени системи.",
      "Да обедини всички компоненти в един монолитен блок.",
      "Да повиши сигурността на комуникацията.",
      "Да оптимизира производителността на хардуера."
    ],
    correctAnswer: "Да използва самостоятелни услуги за изграждане на разпределени системи.",
    imageURL: null
  },
  {
    index: 20,
    question: "Коя е основната цел на XML в контекста на уеб услугите?",
    choices: [
      "Повишаване на скоростта на мрежата.",
      "Управление на паметта в бази данни.",
      "Предоставяне на формат за обмен на данни между системи.",
      "Оптимизиране на заявките."
    ],
    correctAnswer: "Предоставяне на формат за обмен на данни между системи.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20220418000449/WEB-xml-is-missing-and-failOnMissingWebXml-is-set-to-true-3.png"
  },
  {
    index: 21,
    question: "Кой стил НЕ се отнася към архитектурните стилове в cloud?",
    choices: [
      "Circuit breaker",
      "Sharding",
      "Queue",
      "Stack"
    ],
    correctAnswer: "Stack",
    imageURL: null
  },
  {
    index: 22,
    question: "Коя от стратегиите НЕ се отнася към основните стратегии за имплементация на логиката на sharding?",
    choices: [
      "Lookup strategy",
      "Range strategy",
      "Replication strategy",
      "Hash strategy",

    ],
    correctAnswer: "Replication strategy",
    imageURL: null
  }

];
