export const mysql4 = [
  {
    index: 1,
    question: "Каква е целта на шаблона 'Circuit Breaker' в разпределени среди?",
    choices: [
      "Да предотврати излишно чакане за отказали услуги.",
      "Да подобри сигурността на комуникациите.",
      "Да ускори обработката на заявки.",
      "Да увеличи капацитета за съхранение на данни."
    ],
    correctAnswer: "Да предотврати излишно чакане за отказали услуги.",
    imageURL: null
  },
  {
    index: 2,
    question: "Коя от следните характеристики НЕ се отнася за архитектурния стил 'Sharding'?",
    choices: [
      "Разделяне на базата данни на хоризонтални части.",
      "Подобряване на скалируемостта и разпределението на данни.",
      "Използване на части с променливи размери.",
      "Повишаване на капацитета на съхранение и мрежова честотна лента."
    ],
    correctAnswer: "Използване на части с променливи размери.",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво представлява 'Queue' в облачните архитектури?",
    choices: [
      "Буфер за заявки, който смекчава тежките натоварвания.",
      "Протокол за сигурност на данни.",
      "Архитектурен шаблон за криптиране.",
      "Модул за управление на паметта."
    ],
    correctAnswer: "Буфер за заявки, който смекчава тежките натоварвания.",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое твърдение е вярно за 'Standard Queue'?",
    choices: [
      "Заявките се обработват според приоритета им.",
      "Буферът съхранява съобщенията до тяхното извличане.",
      "Заявките автоматично се разделят по шардове.",
      "Съхранява само ограничен брой заявки."
    ],
    correctAnswer: "Буферът съхранява съобщенията до тяхното извличане.",
    imageURL: null
  },
  {
    index: 5,
    question: "Каква е целта на 'Priority Queue'?",
    choices: [
      "Да сортира входящите заявки по приоритет.",
      "Да оптимизира скоростта на обработка.",
      "Да намали броя на обработените заявки.",
      "Да ограничи броя на шардовете в базата данни."
    ],
    correctAnswer: "Да сортира входящите заявки по приоритет.",
    imageURL: null
  },
  {
    index: 6,
    question: "Кое НЕ е характеристика на 'Fixed Length Queue'?",
    choices: [
      "Изпраща изключение при достигане на лимит.",
      "Приема неограничен брой заявки.",
      "Служи за защита от denial-of-service атаки.",
      "Сигнализира, когато заявката няма да бъде обработена."
    ],
    correctAnswer: "Приема неограничен брой заявки.",
    imageURL: null
  },
  {
    index: 7,
    question: "Каква е основната функция на 'Cache' в облачните архитектури?",
    choices: [
      "Оптимизира повторния достъп до информация.",
      "Управлява задачите за приоритетно обработване.",
      "Служи за защита на данни чрез криптиране.",
      "Увеличава капацитета за съхранение."
    ],
    correctAnswer: "Оптимизира повторния достъп до информация.",
    imageURL: null
  },
  {
    index: 8,
    question: "Какво представлява 'SOAP' в контекста на уеб услугите?",
    choices: [
      "Протокол за сигурност на мрежата.",
      "Протокол за обмен на съобщения, базиран на XML.",
      "Метод за кеширане на данни.",
      "Метод за обработка на заявки с висока приоритетност."
    ],
    correctAnswer: "Протокол за обмен на съобщения, базиран на XML.",
    imageURL: null
  },
  {
    index: 9,
    question: "Коя от следните характеристики е свързана с 'RESTful' уеб услугите?",
    choices: [
      "Ниско натоварване и по-бързо изпълнение.",
      "Използване на SOAP и WSDL за комуникация.",
      "Поддръжка на състоянието в сървъра.",
      "Стандартизирани интерфейси за описание на услуги."
    ],
    correctAnswer: "Ниско натоварване и по-бързо изпълнение.",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво е 'WSDL'?",
    choices: [
      "Език за описание на уеб услуги.",
      "Протокол за криптиране.",
      "Метод за създаване на кеш.",
      "Метод за шардване на база данни."
    ],
    correctAnswer: "Език за описание на уеб услуги.",
    imageURL: null
  },
  {
    index: 11,
    question: "Кое е основно предимство на микросървисната архитектура?",
    choices: [
      "Предоставя независимост на отделните услуги.",
      "Увеличава зависимостите между компонентите.",
      "Намалява нуждата от кеширане.",
      "Позволява само една услуга на сървър."
    ],
    correctAnswer: "Предоставя независимост на отделните услуги.",
    imageURL: null
  },
  {
    index: 12,
    question: "Какво е 'Resource' в контекста на RESTful архитектурата?",
    choices: [
      "Системен ресурс за съхранение.",
      "Данен елемент, който може да има множество представяния.",
      "Протокол за свързване на уеб услуги.",
      "Ключов елемент за приоритизация."
    ],
    correctAnswer: "Данен елемент, който може да има множество представяния.",
    imageURL: null
  },
  {
    index: 13,
    question: "Коя операция в RESTful архитектурата се използва за създаване на ресурс?",
    choices: [
      "GET",
      "POST",
      "DELETE",
      "PUT"
    ],
    correctAnswer: "POST",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво означава операцията 'GET' в RESTful архитектурата?",
    choices: [
      "Чете стойността на ресурс.",
      "Създава нов ресурс.",
      "Изтрива съществуващ ресурс.",
      "Актуализира ресурс."
    ],
    correctAnswer: "Чете стойността на ресурс.",
    imageURL: null
  },
  {
    index: 15,
    question: "Какво представлява URL в RESTful уеб услугите?",
    choices: [
      "Идентификатор за местоположението на ресурс.",
      "Протокол за защита на данни.",
      "Модул за криптиране.",
      "Система за управление на кеш."
    ],
    correctAnswer: "Идентификатор за местоположението на ресурс.",
    imageURL: null
  },
  {
    index: 16,
    question: "Коя от следните операции в RESTful услугите изтрива ресурс?",
    choices: [
      "DELETE",
      "GET",
      "POST",
      "PUT"
    ],
    correctAnswer: "DELETE",
    imageURL: null
  },
  {
    index: 17,
    question: "Коя архитектурна стил е създадена за обработка на голям брой едновременни заявки?",
    choices: [
      "Priority Queue",
      "Sharding",
      "Circuit Breaker",
      "Standard Queue"
    ],
    correctAnswer: "Standard Queue",
    imageURL: null
  },
  {
    index: 18,
    question: "Каква е целта на 'Cache' при запис на данни?",
    choices: [
      "Изтриване на съответния елемент в кеша.",
      "Увеличаване на капацитета за съхранение.",
      "Засилване на сигурността на данните.",
      "Повишаване на приоритет на кеширания елемент."
    ],
    correctAnswer: "Изтриване на съответния елемент в кеша.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво е основната цел на 'Service-oriented Architecture'?",
    choices: [
      "Да използва самостоятелни услуги за изграждане на разпределени системи.",
      "Да обедини всички компоненти в един монолитен блок.",
      "Да повиши сигурността на комуникацията.",
      "Да оптимизира производителността на хардуера."
    ],
    correctAnswer: "Да използва самостоятелни услуги за изграждане на разпределени системи.",
    imageURL: null
  },
  {
    index: 20,
    question: "Коя е основната цел на XML в контекста на уеб услугите?",
    choices: [
      "Предоставяне на формат за обмен на данни между системи.",
      "Повишаване на скоростта на мрежата.",
      "Управление на паметта в бази данни.",
      "Оптимизиране на заявките."
    ],
    correctAnswer: "Предоставяне на формат за обмен на данни между системи.",
    imageURL: null
  },
  {
    index: 21,
    question: "Кой стил не се отнася към архитектурните стилове в cloud?",
    choices: [
      "Circuit breaker",
      "Sharding",
      "Queue",
      "Stack"
    ],
    correctAnswer: "Stack",
    imageURL: null
  },

];