export const mysql7 = [
  {
    index: 1,
    question: "Кои са основните тактики за изменяемост на софтуерната архитектура?",
    choices: [
      "Локализиране на промените и предотвратяване на ефекта на вълната.",
      "Автентикация и авторизация.",
      "Конфиденциалност и сигурност.",
      "Оптимизация на производителността и тестируемост."
    ],
    correctAnswer: "Локализиране на промените и предотвратяване на ефекта на вълната.",
    imageURL: null
  },
  {
    index: 2,
    question: "Каква е целта на локализирането на промените като тактика за изменяемост?",
    choices: [
      "Да се увеличи сигурността на системата.",
      "Да се подобри потребителският интерфейс.",
      "Да се повиши производителността.",
      "Да се намали броят на засегнатите модули при промяна.",
    ],
    correctAnswer: "Да се намали броят на засегнатите модули при промяна.",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво означава 'семантична свързаност' в контекста на изменяемост?",
    choices: [
      "Модули с подобни функции да са взаимно свързани.",
      "Задачи в модулите са свързани по начин, който намалява зависимостите.",
      "Данните между модулите са криптирани за сигурност.",
      "Всеки модул разполага със собствена база данни."
    ],
    correctAnswer: "Задачи в модулите са свързани по начин, който намалява зависимостите.",
    imageURL: null
  },
  {
    index: 4,
    question: "Каква е целта на ограничаването на възможните опции като тактика за изменяемост?",
    choices: [
      "Да се създадат допълнителни връзки между компонентите.",
      "Да се ускори времето за изпълнение на софтуера.",
      "Да се намали влиянието на промени върху модули извън директно засегнатите.",
      "Да се повиши нивото на достъпност на системата."
    ],
    correctAnswer: "Да се намали влиянието на промени върху модули извън директно засегнатите.",
    imageURL: null
  },
  {
    index: 5,
    question: "Какво е основното предимство на използването на тактики за сигурност?",
    choices: [
      "Повишаване на производителността.",
      "Ограничаване на достъпа и защитаване от атаки.",
      "Увеличаване на видимостта на кода.",
      "Намаляване на времето за разработка."
    ],
    correctAnswer: "Ограничаване на достъпа и защитаване от атаки.",
    imageURL: null
  },
  {
    index: 6,
    question: "Коя от следните тактики е свързана с отлагане на свързването?",
    choices: [
      "Конфигурационни файлове за задаване на параметри.",
      "Поддържане на сигурност на данните.",
      "Оптимизация на интерфейса.",
      "Автоматизация на процеси."
    ],
    correctAnswer: "Конфигурационни файлове за задаване на параметри.",
    imageURL: null
  },
  {
    index: 7,
    question: "Каква е основната цел на използваемостта като качествена характеристика?",
    choices: [
      "Да увеличи броя на модулите.",
      "Да повиши сигурността на софтуера.",
      "Да улесни изпълнението на задачи от крайния потребител.",
      "Да ускори процеса на разработка."
    ],
    correctAnswer: "Да улесни изпълнението на задачи от крайния потребител.",
    imageURL: null
  },
  {
    index: 8,
    question: "Каква е основната цел на тестируемостта?",
    choices: [
      "Да намали броя на промените в кода.",
      "Да увеличи скоростта на изпълнение.",
      "Да осигури конфиденциалност на данните.",
      "Да подпомогне проверката на качеството на софтуера.",
    ],
    correctAnswer: "Да подпомогне проверката на качеството на софтуера.",
    imageURL: null
  },
  {
    index: 9,
    question: "Коя от следните тактики служи за предотвратяване на ефекта на вълната?",
    choices: [
      "Ограничаване на комуникацията между модулите.",
      "Увеличаване на функционалността на модулите.",
      "Оптимизация на производителността.",
      "Добавяне на нови модули."
    ],
    correctAnswer: "Ограничаване на комуникацията между модулите.",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява 'audit trail' в тактиките за сигурност?",
    choices: [
      "Ограничение на достъпа до системата.",
      "Процес за оптимизация на производителността.",
      "Запис на всяка транзакция за проследяване на действията.",
      "Алгоритъм за криптиране на данни."
    ],
    correctAnswer: "Запис на всяка транзакция за проследяване на действията.",
    imageURL: null
  },
  {
    index: 11,
    question: "Каква е целта на модела на потребителя в тактиките за използваемост?",
    choices: [
      "Да се приспособи системата към очакванията и поведението на потребителя.",
      "Да се подобри защитата на данните.",
      "Да се оптимизира производителността на системата.",
      "Да се увеличи броя на функциите."
    ],
    correctAnswer: "Да се приспособи системата към очакванията и поведението на потребителя.",
    imageURL: null
  },
  {
    index: 12,
    question: "Каква е целта на архитектурните решения, свързани с производителността?",
    choices: [
      "Да се увеличи видимостта на системата.",
      "Да се ускори времето за тестове.",
      "Да се намали времето за отговор и разпределение на ресурсите.",
      "Да се повиши нивото на сигурност."
    ],
    correctAnswer: "Да се намали времето за отговор и разпределение на ресурсите.",
    imageURL: null
  },
  {
    index: 13,
    question: "Кои два аспекта са в конфликт според тактиките за сигурност?",
    choices: [
      "Сигурност и отказоустойчивост.",
      "Изменяемост и използваемост.",
      "Производителност и тестване.",
      "Моделиране и оптимизация."
    ],
    correctAnswer: "Сигурност и отказоустойчивост.",
    imageURL: null
  },
  {
    index: 14,
    question: "Каква е целта на ограничаването на експозицията в тактиките за сигурност?",
    choices: [
      "Да се увеличи сигурността на интерфейсите.",
      "Да се подобри видимостта на системата.",
      "Да се намали броят на уязвимите точки в системата.",
      "Да се оптимизира тестването."
    ],
    correctAnswer: "Да се намали броят на уязвимите точки в системата.",
    imageURL: null
  },
  {
    index: 15,
    question: "Каква е основната цел на използване на компонентна замяна в архитектурните тактики?",
    choices: [
      "Да се подобри производителността на кода.",
      "Да се оптимизира сигурността.",
      "Да се намали времето за разработка.",
      "Да се даде възможност за промяна на компоненти по време на изпълнение.",
    ],
    correctAnswer: "Да се даде възможност за промяна на компоненти по време на изпълнение.",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво е 'моделиране на задачата' в използваемостта?",
    choices: [
      "Системата разбира каква задача изпълнява потребителят и го подпомага.",
      "Системата създава нови задачи.",
      "Системата записва действията на потребителя.",
      "Системата ограничава достъпа до задачите."
    ],
    correctAnswer: "Системата разбира каква задача изпълнява потребителят и го подпомага.",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво е 'скриване на информация' в контекста на тактиките за изменяемост?",
    choices: [
      "Системата събира информация от различни модули.",
      "Системата позволява на потребителите да редактират модулите.",
      "Системата разделя отговорностите, така че част от информацията остава скрита.",
      "Системата използва единен интерфейс за всички модули."
    ],
    correctAnswer: "Системата разделя отговорностите, така че част от информацията остава скрита.",
    imageURL: null
  },
  {
    index: 18,
    question: "Каква е основната функция на тактиките за удобство при тестването?",
    choices: [
      "Да улеснят разработването на нови функционалности.",
      "Да осигурят лесен достъп за тестване на модули.",
      "Да подобрят използваемостта.",
      "Да осигурят защита на данните."
    ],
    correctAnswer: "Да осигурят лесен достъп за тестване на модули.",
    imageURL: null
  },
  {
    index: 19,
    question: "Кое твърдение е вярно относно поддръжката на интерфейси?",
    choices: [
      "Адаптерът позволява съвместимост при промяна на интерфейси.",
      "Промяната на интерфейсите е незначителна.",
      "Интерфейсите са ненужни.",
      "Адаптерите намаляват производителността."
    ],
    correctAnswer: "Адаптерът позволява съвместимост при промяна на интерфейси.",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое от следните описва основната цел на удобството при употребата по време на изпълнение?",
    choices: [
      "Осигуряване на достъп до сигурността на системата.",
      "Оптимизиране на производителността.",
      "Осигуряване на обратна връзка и лесна навигация за потребителя.",
      "Осигуряване на интерфейс за разработчици."
    ],
    correctAnswer: "Осигуряване на обратна връзка и лесна навигация за потребителя.",
    imageURL: null
  }

];