export const mysql11 = [
  {
    index: 1,
    question: "Кой от следните методи НЕ е част от формалните методи в софтуерното инженерство?",
    choices: ["Формално моделиране", "Анализ на спецификацията", "SCRUM", "Програмна верификация"],
    correctAnswer: "SCRUM",
    imageURL: null
  },
  {
    index: 2,
    question: "Кой от следните е формален модел на софтуерната архитектура?",
    choices: ["CSP", "Agile", "Kanban", "Scrum"],
    correctAnswer: "CSP",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво е основното предимство на формалните методи?",
    choices: ["Намаляване на времето за разработка", "Формален анализ на софтуерни системи", "По-лесен дизайн на интерфейси", "По-бърза интеграция на код"],
    correctAnswer: "Формален анализ на софтуерни системи",
    imageURL: null
  },
  {
    index: 4,
    question: "Кой език за описание на архитектурата използва формална и неформална спецификация?",
    choices: ["Z-нотация", "SCRUM", "Kanban", "Python"],
    correctAnswer: "Z-нотация",
    imageURL: null
  },
  {
    index: 5,
    question: "Как се дефинира софтуерната надеждност?",
    choices: ["Брой редове код", "Вероятност за отказ в рамките на даден интервал от време", "Скорост на разработка", "Качество на интерфейса"],
    correctAnswer: "Вероятност за отказ в рамките на даден интервал от време",
    imageURL: null
  },
  {
    index: 6,
    question: "Коя е формулата за честотата на откази според модела на Муса?",
    choices: ["λ = 1/μ", "λ(μ) = λ₀(1−μ/ν₀)", "R = 1 − SIJ", "P = Rᵢ * Pᵢⱼ"],
    correctAnswer: "λ(μ) = λ₀(1−μ/ν₀)",
    imageURL: null
  },
  {
    index: 7,
    question: "Какво представлява самоконфигурирането в автономните системи?",
    choices: ["Системата се настройва ръчно от администратор", "Компонентите се променят динамично според средата", "Автоматично обновяване на операционната система", "Ръчно конфигуриране на мрежовите настройки"],
    correctAnswer: "Компонентите се променят динамично според средата",
    imageURL: null
  },
  {
    index: 8,
    question: "Какво измерва метриката 'Средно време до отказ' (MTTF)?",
    choices: ["Общото време за разработка", "Времето между две последователни грешки", "Средното време преди да възникне първият отказ", "Времето за възстановяване след грешка"],
    correctAnswer: "Средното време преди да възникне първият отказ",
    imageURL: null
  },
  {
    index: 9,
    question: "Кой от следните модели използва вериги на Марков за описание на състояния?",
    choices: ["SCRUM", "Модели на състоянието", "Waterfall", "Kanban"],
    correctAnswer: "Модели на състоянието",
    imageURL: null
  },
  {
    index: 10,
    question: "Кое от следните НЕ е характеристика на автономните системи?",
    choices: ["Самоконфигуриране", "Самолекуване", "Ръчна поддръжка", "Самооптимизиране"],
    correctAnswer: "Ръчна поддръжка",
    imageURL: null
  }, 
  
];