// Z нотация - Схеми
export const mysql5 = [
  {
    index: 1,
    question: "Какво е основната цел на проектирането на архитектурата на софтуерна система?",
    choices: [
      "Да се идентифицират основните функционални и качествени характеристики",
      "Да се започне разработката на системата",
    ],
    correctAnswer: "Да се идентифицират основните функционални и качествени характеристики",
    imageURL: null
  },
  {
    index: 2,
    question: "Кое твърдение е вярно за архитектурните драйвери?",
    choices: [
      "Те са само бизнес изисквания към системата",
      "Те са най-важните около десетина функционални, качествени и бизнес изисквания",
    ],
    correctAnswer: "Те са най-важните около десетина функционални, качествени и бизнес изисквания",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво не се отнася до проектиране на софтуерна архитектура?",
    choices: [
      "Постигане на функционалността",
      "Постигане на качествените характеристики",
      "Постигане на изискванията за сигурност",
      "Ускоряване на процеса на разработка"
    ],
    correctAnswer: "Ускоряване на процеса на разработка",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое твърдение най-точно описва разликата между функционалност и качествени характеристики?",
    choices: [
      "Функционалността определя какво ще прави системата, а качествата как ще го прави",
      "Функционалността и качествата са независими един от друг"
    ],
    correctAnswer: "Функционалността определя какво ще прави системата, а качествата как ще го прави",
    imageURL: null
  },
  {
    index: 5,
    question: "Кое от следните НЕ е един от компонентите на сценарий за качество?",
    choices: [
      "Въздействие",
      "Източник",
      "Обект",
      "Контекст",
      "Резултат",
      "Дизайн",
      "Количествени параметри",
    ],
    correctAnswer: "Дизайн",
    imageURL: null
  },
  {
    index: 6,
    question: "Качествата се разделят на три основни групи. Коя от тях не е вярна?",
    choices: [
      "Технологични качества",
      "Бизнес качества и ограничения",
      "Архитектурни качества",
      "Дизайн качества"
    ],
    correctAnswer: "Дизайн качества",
    imageURL: null
  },
  {
    index: 7,
    question: "Какво е сценариите за качество?",
    choices: [
      "Сценарият за качество дефинира функционалните изисквания към системата",
      "Сценарият за качество е специфично изискване към поведението на системата в дадена ситуация, в светлината на дадено качество",
    ],
    correctAnswer: "Сценарият за качество е специфично изискване към поведението на системата в дадена ситуация, в светлината на дадено качество",
    imageURL: null
  },
  {
    index: 8,
    question: "Сценарий за Надеждност ли е?",
    choices: [
      "По време на експлоатация на системата (Контекст), външен източник (Източник) изпраща на процеса Х (Обект), съобщение (Въздействие) за препълване на опашката с потребителски заявки. Х трябва да информира оператора за получаването на съобщението и да продължи работа (Резултат) без прекъсване (Количествени параметри).",
      "Не е сценарий за надеждност"
    ],
    correctAnswer: "По време на експлоатация на системата (Контекст), външен източник (Източник) изпраща на процеса Х (Обект), съобщение (Въздействие) за препълване на опашката с потребителски заявки. Х трябва да информира оператора за получаването на съобщението и да продължи работа (Резултат) без прекъсване (Количествени параметри).",
    imageURL: null
  },
  {
    index: 9,
    question: "Как се влияят взаимно отказоустойчивостта и сигурността?",
    choices: [
      "Те се допълват, без да си противоречат",
      "Те си противоречат - постигането на едното влошава другото"
    ],
    correctAnswer: "Те си противоречат - постигането на едното влошава другото",
    imageURL: null
  },
  {
    index: 10,
    question: "Коя от следните твърдения относно качествата на софтуера е вярна?",
    choices: [
      "Качествата могат да бъдат оценени само качествено, а не количествено",
      "За всяко качество съществуват количествени показатели, по които то може да се измерва",

    ],
    correctAnswer: "За всяко качество съществуват количествени показатели, по които то може да се измерва",
    imageURL: null
  },
  {
    index: 11,
    question: "Кое от следните не е част от групата на бизнес качества и ограничения?",
    choices: [
      "Време за разработка",
      "Себестойност",
      "Изменяемост",
      "Пазарни условия"
    ],
    correctAnswer: "Изменяемост",
    imageURL: null
  },
  {
    index: 12,
    question: "Коя от следните характеристики НЕ се отнася към групата на архитектурните качества?",
    choices: [
      "Производителност",
      "Идейна цялост",
      "Коректност и пълнота",
    ],
    correctAnswer: "Производителност",
    imageURL: null
  },
  {
    index: 14,
    question: "Какви видове сценарии на технологични качества има?",
    choices: [
      "Сценарии за наличност",
      "Сценарии за изменяемост",
      "Сценарии за производителност",
      "Сценарии за сигурност",
      "Сценарии за изпитаемост",
      "Сценарии за използваемост",
      "Сценарии за за дизайн"
    ],
    correctAnswer: "Сценарии за за дизайн",
    imageURL: null
  },
  {
    index: 15,
    question: "Преди пускането на системата в експлоатация (Контекст), клиентът (Източник) желае промяна на фоновия цвят на екрана (Въздействие). За целта се променя изходния код (Обект). Това не трябва да предизвиква никакви странични ефекти в поведението на системата (Резултат), като времето за извършване на промяната, вкл. тестването й трябва да отнеме по малко от 3 часа (Количествени параметри). Това е сценарий за? ",
    choices: [
      "Сценарии за производителност",
      "Сценарии за изменяемост",
      "Сценарии за наличност",
      "Сценарии за сигурност",
      "Сценарии за изпитаемост",
      "Сценарии за използваемост"
    ],
    correctAnswer: "Сценарии за изменяемост",
    imageURL: null
  },
  {
    index: 16,
    question: "Кой от следните количествени параметри не се отнася до сценариите за производителност?",
    choices: [
      "Латентност",
      "Пропускливост",
      "Време за отстраняване на срив",
      "Брой необработени заявки"
    ],
    correctAnswer: "Време за отстраняване на срив",
    imageURL: null
  },
  {
    index: 17,
    question: "Кое от следните не се отнася към сценариите за сигурност?",
    choices: [
      "Вероятност за успешно заобикаляне на сигурността",
      "Вероятност за разкриване на идентичността на извършителя на атака",
      "Размер на ресурсите, необходими за разработка на системата",
      "Процент на работоспособност при атака за отказ на услуга"
    ],
    correctAnswer: "Размер на ресурсите, необходими за разработка на системата",
    imageURL: null
  },

  {
    index: 20,
    question: "Кое от следните НЕ е част от групата на бизнес качества и ограничения?",
    choices: [
      "Себестойност",
      "Време за пускане на пазара",
      "Достъпност",
      "Пазарни условия"
    ],
    correctAnswer: "Достъпност",
    imageURL: null
  }

];