// Z нотация - Схеми
export const mysql5 = [
  {
    index: 1,
    question: "Какво е основната цел на проектирането на архитектурата на софтуерна система?",
    choices: [
      "Да се определят всички изисквания към системата",
      "Да се идентифицират основните функционални и качествени характеристики",
      "Да се започне разработката на системата",
      "Да се избере подходящата технология за реализация"
    ],
    correctAnswer: "Да се идентифицират основните функционални и качествени характеристики",
    imageURL: null
  },
  {
    index: 2,
    question: "Кое твърдение е вярно за архитектурните драйвери?",
    choices: [
      "Те са всички функционални и качествени изисквания към системата",
      "Те са само бизнес изисквания към системата",
      "Те са най-важните около десетина функционални, качествени и бизнес изисквания",
      "Те са изисквания, които определят архитектурата, но нямат приоритет"
    ],
    correctAnswer: "Те са най-важните около десетина функционални, качествени и бизнес изисквания",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво не се отнася до проектиране на софтуерна архитектура?",
    choices: [
      "Постигане на функционалността",
      "Постигане на качествените характеристики",
      "Постигане на изискванията за сигурност",
      "Ускоряване на процеса на разработка"
    ],
    correctAnswer: "Ускоряване на процеса на разработка",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое твърдение най-точно описва разликата между функционалност и качествени характеристики?",
    choices: [
      "Функционалността определя какво ще прави системата, а качествата как ще го прави",
      "Функционалността е ограничена от качествата, а качествата нямат ограничения",
      "Функционалността е по-важна от качествата при проектирането на архитектурата",
      "Функционалността и качествата са независими един от друг"
    ],
    correctAnswer: "Функционалността определя какво ще прави системата, а качествата как ще го прави",
    imageURL: null
  },
  {
    index: 5,
    question: "Кое от следните НЕ е един от компонентите на сценарий за качество?",
    choices: [
      "Въздействие",
      "Результат",
      "Дизайн",
      "Количествени параметри"
    ],
    correctAnswer: "Дизайн",
    imageURL: null
  },
  {
    index: 6,
    question: "Коя от следните характеристики НЕ се отнася до групата на технологичните качества?",
    choices: [
      "Наличност",
      "Преносимост",
      "Сигурност",
      "Изменяемост"
    ],
    correctAnswer: "Наличност",
    imageURL: null
  },
  {
    index: 7,
    question: "Какво е основната цел на сценариите за качество?",
    choices: [
      "Да дефинират функционалните изисквания към системата",
      "Да определят технологията за реализация на системата",
      "Да оценят ефективността на архитектурните решения",
      "Да покажат какво представлява дадено качество в рамките на системата",
    ],
    correctAnswer: "Да покажат какво представлява дадено качество в рамките на системата",
    imageURL: null
  },
  {
    index: 8,
    question: "Кое от следните НЕ е част от структурата на сценарий за качество?",
    choices: [
      "Въздействие",
      "Източник",
      "Обект",
      "Допускания"
    ],
    correctAnswer: "Допускания",
    imageURL: null
  },
  {
    index: 9,
    question: "Как се влияят взаимно отказоустойчивостта и сигурността?",
    choices: [
      "Те се допълват, без да си противоречат",
      "Сигурността повишава отказоустойчивостта",
      "Отказоустойчивостта повишава сигурността",
      "Те си противоречат - постигането на едното влошава другото"
    ],
    correctAnswer: "Те си противоречат - постигането на едното влошава другото",
    imageURL: null
  },
  {
    index: 10,
    question: "Коя от следните твърдения относно качествата на софтуера е вярна?",
    choices: [
      "Качествата могат да бъдат оценени само качествено, а не количествено",
      "Качествата не се влияят взаимно, а се постигат независимо",
      "За всяко качество съществуват количествени показатели, по които то може да се измерва",
      "Архитектурата на системата определя качествата, а разработката и внедряването нямат влияние",

    ],
    correctAnswer: "За всяко качество съществуват количествени показатели, по които то може да се измерва",
    imageURL: null
  },
  {
    index: 11,
    question: "Кое от следните не е част от групата на бизнес качества и ограничения?",
    choices: [
      "Време за разработка",
      "Себестойност",
      "Изменяемост",
      "Пазарни условия"
    ],
    correctAnswer: "Изменяемост",
    imageURL: null
  },
  {
    index: 12,
    question: "Коя от следните характеристики се отнася към групата на архитектурните качества?",
    choices: [
      "Производителност",
      "Идейна цялост",
      "Използваемост",
      "Надеждност"
    ],
    correctAnswer: "Идейна цялост",
    imageURL: null
  },
  {
    index: 13,
    question: "Коя от следните твърдения за архитектурните качества е вярна?",
    choices: [
      "Те са независими от функционалните изисквания",
      "Те зависят само от технологичните решения",
      "Те включват идейната цялост и коректността на архитектурата",
      "Те се постигат само чрез архитектурни решения, а не и чрез решения на ниво разработка"
    ],
    correctAnswer: "Те включват идейната цялост и коректността на архитектурата",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво не се включва в сценарий за надеждност?",
    choices: [
      "Описание на източника на въздействието",
      "Описание на обекта, върху който въздейства",
      "Описание на резултата от обработката на въздействието",
      "Описание на очакваната цена за постигане на резултата"
    ],
    correctAnswer: "Описание на очакваната цена за постигане на резултата",
    imageURL: null
  },
  {
    index: 15,
    question: "Кои от следните твърдения за сценариите за изменяемост са вярни?",
    choices: [
      "Описват промени, които се извършват само по време на експлоатацията",
      "Включват времето и усилията, необходими за извършване на промяната",
      "Ограничават страничните ефекти, като влияние върху работоспособността",
      "Всички изброени твърдения са вярни"
    ],
    correctAnswer: "Всички изброени твърдения са вярни",
    imageURL: null
  },
  {
    index: 16,
    question: "Кой от следните количествени параметри не се отнася до сценариите за производителност?",
    choices: [
      "Латентност",
      "Пропускливост",
      "Време за отстраняване на срив",
      "Брой необработени заявки"
    ],
    correctAnswer: "Време за отстраняване на срив",
    imageURL: null
  },
  {
    index: 17,
    question: "Кое от следните не се отнася към сценариите за сигурност?",
    choices: [
      "Вероятност за успешно заобикаляне на сигурността",
      "Вероятност за разкриване на идентичността на извършителя на атака",
      "Размер на ресурсите, необходими за разработка на системата",
      "Процент на работоспособност при атака за отказ на услуга"
    ],
    correctAnswer: "Размер на ресурсите, необходими за разработка на системата",
    imageURL: null
  },
  {
    index: 18,
    question: "Кое твърдение за сценариите за изпитаемост е вярно?",
    choices: [
      "Те описват само тестване по време на експлоатация",
      "Те включват достъпа до вътрешни променливи и състояния на системата",
      "Те определят само вероятността за регистриране на дефекти",
      "Те се отнасят само за тестване на цялостната система"
    ],
    correctAnswer: "Те включват достъпа до вътрешни променливи и състояния на системата",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво не се включва в сценариите за използваемост?",
    choices: [
      "Време за извършване на задачи",
      "Брой грешки, допускани от потребителите",
      "Потребителска удовлетвореност",
      "Оценка на архитектурата от гледна точка на разработчика"
    ],
    correctAnswer: "Оценка на архитектурата от гледна точка на разработчика",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое от следните НЕ е част от групата на бизнес качества и ограничения?",
    choices: [
      "Себестойност",
      "Време за пускане на пазара",
      "Достъпност",
      "Пазарни условия"
    ],
    correctAnswer: "Достъпност",
    imageURL: null
  }


];