export const mysql6 = [
  {
    index: 1,
    question: "Какво е основната цел на архитектурните тактики?",
    choices: [
      "Да подобрят функционалността на системата.",
      "Да подпомогнат постигането на качествени изисквания.",
      "Да оптимизират интерфейса на приложението.",
      "Да намалят броя на потребителите."
    ],
    correctAnswer: "Да подпомогнат постигането на качествени изисквания.",
    imageURL: null
  },
  {
    index: 2,
    question: "Кое от следните НЕ е част от тактиките за изправност?",
    choices: [
      "Откриване на откази.",
      "Повторно въвеждане в употреба.",
      "Повишаване на производителността.",
      "Предотвратяване на откази."
    ],
    correctAnswer: "Повишаване на производителността.",
    imageURL: null
  },
  {
    index: 3,
    question: "Коя от изброените не е тактика по откриване на откази?",
    choices: [
      "Ехо (Ping/echo)",
      "Heartbeat, Keepalive",
      "Активен излишък (Active redundancy, hot restart)",
      "Изключения (Exceptions)",

    ],
    correctAnswer: "Активен излишък (Active redundancy, hot restart)",
    imageURL: null
  },
  {
    index: 4,
    question: "Коя от изброените не е тактика за oтстраняване на откази?",
    choices: [
      "Активен излишък (Active redundancy, hot restart)",
      "Пасивен излишък (Passive redundancy, warm restart)",
      "Ехо (Ping/echo)",
      "Резерва (Spare)",

    ],
    correctAnswer: "Ехо (Ping/echo)",
    imageURL: null
  },
  {
    index: 5,
    question: "Коя тактика за изправност е предназначена да предотврати очаквани сривове?",
    choices: [
      "Повторно въвеждане в употреба.",
      "Извеждане от употреба.",
      "Арбитраж на ресурсите.",
      "Управление на ресурсите."
    ],
    correctAnswer: "Извеждане от употреба.",
    imageURL: null
  },
  {
    index: 6,
    question: "Каква е основната цел на тактиките за производителност?",
    choices: [
      "Да увеличат сигурността на данните.",
      "Да постигнат реакция на системата в рамките на зададени времеви изисквания.",
      "Да намалят броя на модулите в системата.",
      "Да осигурят повече потребители."
    ],
    correctAnswer: "Да постигнат реакция на системата в рамките на зададени времеви изисквания.",
    imageURL: null
  },
  {
    index: 7,
    question: "Кое НЕ е част от тактиките за управление на ресурсите?",
    choices: [
      "Паралелна обработка.",
      "Излишък на данни.",
      "Използване на кеш.",
      "Намаляване на изискванията."
    ],
    correctAnswer: "Намаляване на изискванията.",
    imageURL: null
  },
  {
    index: 9,
    question: "Каква е целта на тактиката 'Heartbeat'?",
    choices: [
      "Да провери дали компонентът е все още активен.",
      "Да синхронизира данните между два процеса.",
      "Да ограничи изчисленията в системата.",
      "Да защити данните от външни атаки."
    ],
    correctAnswer: "Да провери дали компонентът е все още активен.",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява 'пасивен излишък' в контекста на архитектурните тактики?",
    choices: [
      "Всички компоненти работят паралелно.",
      "Компонентите се разпределят на различни сървъри.",
      "Изпълнява се само основният компонент.",
      "Един компонент е основен, а останалите се активират при нужда.",
    ],
    correctAnswer: "Един компонент е основен, а останалите се активират при нужда.",
    imageURL: null
  },
  {
    index: 11,
    question: "Каква е целта на 'N-version programming'?",
    choices: [
      "Да използва една версия на софтуера за всички модули.",
      "Да създаде резервни версии, които се използват при срив.",
    ],
    correctAnswer: "Да създаде резервни версии, които се използват при срив.",
    imageURL: null
  },
  {
    index: 12,
    question: "Коя техника за производителност позволява системата да реагира по-бързо?",
    choices: [
      "Увеличаване на времето за изпълнение",
      "Паралелна обработка",
    ],
    correctAnswer: "Паралелна обработка",
    imageURL: null
  },
  {
    index: 13,
    question: "Коя е основната характеристика на 'Recovery blocks'?",
    choices: [
      "Използват се различни версии на компонентите.",
      "Компонентите се изпълняват последователно.",
    ],
    correctAnswer: "Използват се различни версии на компонентите.",
    imageURL: null
  },
  {
    index: 14,
    question: "Кое НЕ е техника за управление на производителността?",
    choices: [
      "Намаляване на режийните разходи.",
      "Ограничаване на времето за изпълнение.",
      "Увеличаване на изискванията.",
      "Използване на кеш."
    ],
    correctAnswer: "Увеличаване на изискванията.",
    imageURL: null
  },
  {
    index: 15,
    question: "Коя техника за откриване на откази се базира на излъчване на сигнали?",
    choices: [
      "Контролни точки",
      "Пасивен излишък",
      "Heartbeat",
    ],
    correctAnswer: "Heartbeat",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво означава 'излишък в комуникациите'?",
    choices: [
      "Да има допълнителни комуникационни канали.",
      "Да се използва единствено основен канал."
    ],
    correctAnswer: "Да има допълнителни комуникационни канали.",
    imageURL: null
  },
  {
    index: 17,
    question: "Кое от следните НЕ е характеристика на разнородността?",
    choices: [
      "Разнородност по време",
      "Разнородност по данни",
      "Разнородност по сигурност",
      "Разнородност в проектирането"
    ],
    correctAnswer: "Разнородност по сигурност",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво е основното предимство на 'контролни точки'?",
    choices: [
      "Възможност за възстановяване след срив.",
      "Повишаване на производителността.",
    ],
    correctAnswer: "Възможност за възстановяване след срив.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво е основното предимство на 'shadow mode'?",
    choices: [
      "Извършва паралелна обработка на данни.",
      "Позволява тестване на компонента преди въвеждане в употреба.",
    ],
    correctAnswer: "Позволява тестване на компонента преди въвеждане в употреба.",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое е НЕ е тактика за производителност – намаляване на изискванията?",
    choices: [
      "Увеличаване на производителността на изчисленията",
      "Намаляване на режийните",
      "Промяна на периода",
      "Промяна на тактовата честота",
      "Ограничаване на времето за изпълнение",
      "Опашка с краен размер",
      "Опашка с безкраен размер"
    ],
    correctAnswer: "Опашка с безкраен размер",
    imageURL: null
  },
  {
    index: 21,
    question: "Scheduling е тактика за производителност – арбитраж на ресурсите. В scheduling-алгоритмите НЕ се включва?",
    choices: [
      "FIFO",
      "Фиксиран приоритет",
      "Динамичен приоритет",
      "Heartbeat"
    ],
    correctAnswer: "Heartbeat",
    imageURL: null
  },
  {
    index: 22,
    question: "Кое НЕ се включва в качеството изправност (dependability)?",
    choices: [
      "Availability",
      "Reliability",
      "Safety",
      "Integrity",
      "Confidentiality",
      "Maintainability",
      "Scalability"
    ],
    correctAnswer: "Scalability",
    imageURL: null
  },
  {
    index: 23,
    question: "Коя от изброените не е тактика за Изправност – отстраняване на откази?",
    choices: [
      "Извеждане от употреба (Removal from service)",
      "Следене на процесите (Process Monitoring)",
      "Ехо (Ping/echo)",
      "Паралелна работа (shadow mode)",
      "Контролни точки и rollback (Checkpoint/rollback)"

    ],
    correctAnswer: "Ехо (Ping/echo)",
    imageURL: null
  },
  {
    index: 24,
    question: "Тактиките за производителност са разделени в три групи. Коя е грешна?",
    choices: [
      "Намаляване на изискванията",
      "Управление на ресурсите",
      "Арбитраж на ресурсите",
      "Тестване на ресурсите",
    ],
    correctAnswer: "Тестване на ресурсите",
    imageURL: null
  },


];