export const mysql6 = [
  {
    index: 1,
    question: "Какво е основната цел на архитектурните тактики?",
    choices: [
      "Да подобрят функционалността на системата.",
      "Да подпомогнат постигането на качествени изисквания.",
      "Да оптимизират интерфейса на приложението.",
      "Да намалят броя на потребителите."
    ],
    correctAnswer: "Да подпомогнат постигането на качествени изисквания.",
    imageURL: null
  },
  {
    index: 2,
    question: "Кое от следните НЕ е част от тактиките за изправност?",
    choices: [
      "Откриване на откази.",
      "Повторно въвеждане в употреба.",
      "Повишаване на производителността.",
      "Предотвратяване на откази."
    ],
    correctAnswer: "Повишаване на производителността.",
    imageURL: null
  },
  {
    index: 3,
    question: "Каква е целта на техниката 'Пинг/ехо'?",
    choices: [
      "Да осигури сигурност на комуникационните канали.",
      "Да провери дали компонентът работи правилно.",
      "Да увеличи скоростта на системата.",
      "Да намали времето за изпълнение на задачи."
    ],
    correctAnswer: "Да провери дали компонентът работи правилно.",
    imageURL: null
  },
  {
    index: 4,
    question: "Какво представлява тактиката 'Активен излишък'?",
    choices: [
      "Компонентите се дублират и синхронизират за висока надеждност.",
      "Системата използва минимален брой компоненти.",
      "Компонентите се разпределят по различни процесори.",
      "Системата запазва само един активен компонент."
    ],
    correctAnswer: "Компонентите се дублират и синхронизират за висока надеждност.",
    imageURL: null
  },
  {
    index: 5,
    question: "Коя тактика за изправност е предназначена да предотврати очаквани сривове?",
    choices: [
      "Повторно въвеждане в употреба.",
      "Извеждане от употреба.",
      "Арбитраж на ресурсите.",
      "Управление на ресурсите."
    ],
    correctAnswer: "Извеждане от употреба.",
    imageURL: null
  },
  {
    index: 6,
    question: "Каква е основната цел на тактиките за производителност?",
    choices: [
      "Да постигнат реакция на системата в рамките на зададени времеви изисквания.",
      "Да увеличат сигурността на данните.",
      "Да намалят броя на модулите в системата.",
      "Да осигурят повече потребители."
    ],
    correctAnswer: "Да постигнат реакция на системата в рамките на зададени времеви изисквания.",
    imageURL: null
  },
  {
    index: 7,
    question: "Кое НЕ е част от тактиките за управление на ресурсите?",
    choices: [
      "Паралелна обработка.",
      "Излишък на данни.",
      "Използване на кеш.",
      "Намаляване на изискванията."
    ],
    correctAnswer: "Намаляване на изискванията.",
    imageURL: null
  },
  {
    index: 8,
    question: "Кое от следните е метод за арбитраж на ресурсите?",
    choices: [
      "Ограничаване на комуникацията между компонентите.",
      "FIFO.",
      "Конфиденциалност на данните.",
      "Отлагане на свързването."
    ],
    correctAnswer: "FIFO.",
    imageURL: null
  },
  {
    index: 9,
    question: "Каква е целта на тактиката 'Heartbeat'?",
    choices: [
      "Да провери дали компонентът е все още активен.",
      "Да синхронизира данните между два процеса.",
      "Да ограничи изчисленията в системата.",
      "Да защити данните от външни атаки."
    ],
    correctAnswer: "Да провери дали компонентът е все още активен.",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво представлява 'пасивен излишък' в контекста на архитектурните тактики?",
    choices: [
      "Един компонент е основен, а останалите се активират при нужда.",
      "Всички компоненти работят паралелно.",
      "Компонентите се разпределят на различни сървъри.",
      "Изпълнява се само основният компонент."
    ],
    correctAnswer: "Един компонент е основен, а останалите се активират при нужда.",
    imageURL: null
  },
  {
    index: 11,
    question: "Каква е целта на 'N-version programming'?",
    choices: [
      "Да използва една версия на софтуера за всички модули.",
      "Да създаде резервни версии, които се използват при срив.",
      "Да предостави различни потребителски интерфейси.",
      "Да оптимизира производителността на базата данни."
    ],
    correctAnswer: "Да създаде резервни версии, които се използват при срив.",
    imageURL: null
  },
  {
    index: 12,
    question: "Коя техника за производителност позволява системата да реагира по-бързо?",
    choices: [
      "Увеличаване на времето за изпълнение.",
      "Паралелна обработка.",
      "Намаляване на броя на модулите.",
      "Контрол на достъпа."
    ],
    correctAnswer: "Паралелна обработка.",
    imageURL: null
  },
  {
    index: 13,
    question: "Коя е основната характеристика на 'Recovery blocks'?",
    choices: [
      "Използват се различни версии на компонентите.",
      "Компонентите се изпълняват последователно.",
      "Създава се единствено основен компонент.",
      "Компонентите се изпълняват само при нужда."
    ],
    correctAnswer: "Използват се различни версии на компонентите.",
    imageURL: null
  },
  {
    index: 14,
    question: "Кое НЕ е техника за управление на производителността?",
    choices: [
      "Намаляване на режийните разходи.",
      "Ограничаване на времето за изпълнение.",
      "Увеличаване на изискванията.",
      "Използване на кеш."
    ],
    correctAnswer: "Увеличаване на изискванията.",
    imageURL: null
  },
  {
    index: 15,
    question: "Коя техника за откриване на откази се базира на излъчване на сигнали?",
    choices: [
      "Heartbeat.",
      "Контролни точки.",
      "Пасивен излишък.",
      "Отлагане на свързването."
    ],
    correctAnswer: "Heartbeat.",
    imageURL: null
  },
  {
    index: 16,
    question: "Какво означава 'излишък в комуникациите'?",
    choices: [
      "Да има допълнителни комуникационни канали.",
      "Да се ограничи достъпът до комуникациите.",
      "Да се намали мрежовият трафик.",
      "Да се използва единствено основен канал."
    ],
    correctAnswer: "Да има допълнителни комуникационни канали.",
    imageURL: null
  },
  {
    index: 17,
    question: "Кое от следните НЕ е характеристика на разнородността?",
    choices: [
      "Разнородност по време.",
      "Разнородност по данни.",
      "Разнородност по сигурност.",
      "Разнородност в проектирането."
    ],
    correctAnswer: "Разнородност по сигурност.",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво е основното предимство на 'контролни точки'?",
    choices: [
      "Възможност за възстановяване след срив.",
      "Повишаване на производителността.",
      "Намаляване на броя на компонентите.",
      "Увеличаване на броя на потребителите."
    ],
    correctAnswer: "Възможност за възстановяване след срив.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво е основното предимство на 'shadow mode'?",
    choices: [
      "Позволява тестване на компонента преди въвеждане в употреба.",
      "Намалява режийните разходи.",
      "Извършва паралелна обработка на данни.",
      "Повишава конфиденциалността."
    ],
    correctAnswer: "Позволява тестване на компонента преди въвеждане в употреба.",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое е вярно за тактиката 'FIFO' при арбитраж на ресурсите?",
    choices: [
      "Заявките се обработват в реда на тяхното постъпване.",
      "Приоритет се дава на най-важните заявки.",
      "Заявките се обработват по динамичен приоритет.",
      "Изчакват се ресурси преди обработка."
    ],
    correctAnswer: "Заявките се обработват в реда на тяхното постъпване.",
    imageURL: null
  }


];