export const mysql7 = [
  {
    index: 1,
    question: "Какво моделира диаграмата на състояния (Statechart Diagram)?",
    choices: [
      "Моделира поведението на един обект, като показва последователността от състояния, през които обектът преминава по време на своя живот.",
      "Моделира взаимодействията между обектите в системата.",
    ],
    correctAnswer: "Моделира поведението на един обект, като показва последователността от състояния, през които обектът преминава по време на своя живот.",
    imageURL: ""
  },
 

];
