export const mysql6 = [
  {
    index: 1,
    question: "Каква е основната цел на диаграмата на последователност в UML?",
    choices: [
      "Да опише статичната структура на системата.",
      "Да покаже потока на събитията и взаимодействията между обектите в хронологичен ред.",
    ],
    correctAnswer: "Да покаже потока на събитията и взаимодействията между обектите в хронологичен ред.",
    imageURL: "https://upload.wikimedia.org/wikipedia/commons/9/9b/CheckEmail.svg"
  },
  {
    index: 2,
    question: "Какво представляват жизнените линии в диаграмите на последователност?",
    choices: [
      "Представят съществуването на обекта в определен момент.",
      "Показват комуникацията между обектите.",
    ],
    correctAnswer: "Представят съществуването на обекта в определен момент.",
    imageURL: "https://www.uml-diagrams.org/notation/sequence-lifeline-named.png"
  },
  {
    index: 3,
    question: "Какво показват съобщенията за създаване и унищожаване в диаграмите на последователност?",
    choices: [
      "Показват създаването или унищожаването на обекти по време на взаимодействието.",
      "Показват връзките между обектите.",
    ],
    correctAnswer: "Показват създаването или унищожаването на обекти по време на взаимодействието.",
    imageURL: "https://www.uml-diagrams.org/notation/sequence-message-delete.png"
  },
  {
    index: 4,
    question: "Какво моделират фрагментите 'alt' в диаграмите на последователност?",
    choices: [
      "Моделират if...then...else конструкции.",
      "Моделират итерации с определен брой повторения.",
    ],
    correctAnswer: "Моделират if...then...else конструкции.",
    imageURL: "https://www.uml-diagrams.org/notation/sequence-operator-alt.png"
  },
  {
    index: 5,
    question: "Какво представлява фрагментът 'loop' в диаграмите на последователност?",
    choices: [
      "Моделира итерации с определен брой повторения.",
      "Моделира паралелно изпълнение на поведения.",
    ],
    correctAnswer: "Моделира итерации с определен брой повторения.",
    imageURL: "https://www.uml-diagrams.org/notation/sequence-loop-bounds-guard.png"
  },
  {
    index: 6,
    question: "Какво показват диаграмите на комуникация?",
    choices: [
      "Показват хронологичния ред на съобщенията между обектите.",
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Показват връзките между обектите и съобщенията, които те си изпращат.",
    imageURL: "https://cdn-images.visual-paradigm.com/guide/uml/what-is-communication-diagram/02-basic-communication-diagram.png"
  },
  {
    index: 7,
    question: "Какво представлява 'centralized control' в диаграмите на взаимодействия?",
    choices: [
      "Малък брой обекти управляват потока, като изпращат и получават съобщения от други обекти.",
      "Всички обекти взаимодействат равноправно.",
    ],
    correctAnswer: "Малък брой обекти управляват потока, като изпращат и получават съобщения от други обекти.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какво представлява 'decentralized control' в диаграмите на взаимодействия?",
    choices: [
      "Всички обекти взаимодействат равноправно.",
      "Малък брой обекти управляват потока, като изпращат и получават съобщения от други обекти.",
    ],
    correctAnswer: "Всички обекти взаимодействат равноправно.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво представляват 'inter-object messages' в диаграмите на последователност?",
    choices: [
      "Съобщения между различни обекти.",
      "Съобщения в рамките на един и същ обект.",
    ],
    correctAnswer: "Съобщения между различни обекти.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво представляват 'intra-object messages' в диаграмите на последователност?",
    choices: [
      "Съобщения в рамките на един и същ обект.",
      "Съобщения между различни обекти.",
    ],
    correctAnswer: "Съобщения в рамките на един и същ обект.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво представлява 'state invariant' в диаграмите на последователност?",
    choices: [
      "Ограничение, наложено върху линия на живот (lifeline), което трябва да бъде вярно по време на изпълнение.",
      "Моделира паралелно изпълнение на поведения.",
    ],
    correctAnswer: "Ограничение, наложено върху линия на живот (lifeline), което трябва да бъде вярно по време на изпълнение.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво представлява 'critical' фрагмент в диаграмите на последователност?",
    choices: [
      "Критичен регион, където блок от операции/взаимодействия се изпълнят атомарно.",
      "Моделира итерации с определен брой повторения.",
    ],
    correctAnswer: "Критичен регион, където блок от операции/взаимодействия се изпълнят атомарно.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Какво представлява 'neg' фрагмент в диаграмите на последователност?",
    choices: [
      "Описва невалидни комбинирани фрагменти.",
      "Моделира if...then...else конструкции.",
    ],
    correctAnswer: "Описва невалидни комбинирани фрагменти.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво представлява 'ref' фрагмент в диаграмите на последователност?",
    choices: [
      "Фрагмент за взаимодействие, който използва (извиква) друго взаимодействие.",
      "Моделира паралелно изпълнение на поведения.",
    ],
    correctAnswer: "Фрагмент за взаимодействие, който използва (извиква) друго взаимодействие.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво представлява 'sd' фрагмент в диаграмите на последователност?",
    choices: [
      "Свързване на съобщения във фрагмент със съобщения извън фрагмент.",
      "Моделира итерации с определен брой повторения.",
    ],
    correctAnswer: "Свързване на съобщения във фрагмент със съобщения извън фрагмент.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво представлява 'ignore' фрагмент в диаграмите на последователност?",
    choices: [
      "Игнорира незначителни съобщения.",
      "Утвърждава, че последователностите на операнда са единствените валидни продължения.",
    ],
    correctAnswer: "Игнорира незначителни съобщения.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Какво представлява 'consider' фрагмент в диаграмите на последователност?",
    choices: [
      "Съобщенията да се вземат предвид, а други се игнорират.",
      "Игнорира незначителни съобщения.",
    ],
    correctAnswer: "Съобщенията да се вземат предвид, а други се игнорират.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какво представлява 'assert' фрагмент в диаграмите на последователност?",
    choices: [
      "Утвърждава, че последователностите на операнда са единствените валидни продължения.",
      "Игнорира незначителни съобщения.",
    ],
    correctAnswer: "Утвърждава, че последователностите на операнда са единствените валидни продължения.",
    imageURL: ""
  },
  
];
