export const mysql9 = [
  {
    index: 1,
    question: "Каква е основната цел на диаграмата на компонентите в UML?",
    choices: [
      "Да покаже динамичното поведение на обектите.",
      "Да представи логическата организация и връзките между компонентите.",
    ],
    correctAnswer: "Да представи логическата организация и връзките между компонентите.",
    imageURL: "https://cdn-images.visual-paradigm.com/guide/uml/what-is-component-diagram/02-component-diagram-overview.png"
  },
  {
    index: 2,
    question: "Какво представлява  assembly connector /съединителят за сглобяване/ в диаграмата на компонентите?",
    choices: [
      "Връзка между хардуерни възли.",
      "Мост между изискван интерфейс и предоставен интерфейс на компонентите. Съединителят за сглобяване позволява на един компонент да предоставя услугите (топката), които друг компонент изисква (гнездото).",
    ],
    correctAnswer: "Мост между изискван интерфейс и предоставен интерфейс на компонентите. Съединителят за сглобяване позволява на един компонент да предоставя услугите (топката), които друг компонент изисква (гнездото).",
    imageURL: "https://cdn-images.visual-paradigm.com/guide/uml/what-is-component-diagram/02-component-diagram-overview.png"
  },
  {
    index: 3,
    question: "За какво основно се използва deployment диаграмата?",
    choices: [
      "Да представи физическото разгръщане на софтуерни компоненти върху хардуерни възли.",
      "Да дефинира интерфейси за класове и обекти.",
    ],
    correctAnswer: "Да представи физическото разгръщане на софтуерни компоненти върху хардуерни възли.",
    imageURL: "https://online.visual-paradigm.com/images/tutorials/deployment-diagram-tutorial/04-deployment-diagram-node-and-artifacts.png"
  },
  {
    index: 5,
    question: "Какво представлява портът в диаграмите на компонентите?",
    choices: [
      "Физическа връзка между два възела.",
      "Двунасочен интерфейс за комуникация.",
    ],
    correctAnswer: "Двунасочен интерфейс за комуникация.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531161233/4.png"
  },
  {
    index: 6,
    question: "Какво НЕ е вярно за възел в диаграмите на разгръщане?",
    choices: [
      "Това е логическа групировка на класове обекти.",
      "Това е софтуерен или хардуерен ресурс, способен да хоства софтуер.",
      "Неговият символ - 3D кутии",
      "Той предоставя контекст за разгръщане, показвайки къде компонентите се намират и изпълняват в инфраструктурата на системата."
    ],
    correctAnswer: "Това е логическа групировка на класове обекти.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531154417/nodes.png"
  },
  {
    index: 8,
    question: "Кой стереотип е често свързан с компонентите?",
    choices: [
      "<<node>>",
      "<<component>>",
      "<<artifact>>",
      "<<port>>"
    ],
    correctAnswer: "<<component>>",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531160215/1drawio.png"
  },
  {
    index: 9,
    question: "Какъв е фокусът на диаграмите на компонентите в UML?",
    choices: [
      "Логически връзки между компонентите.",
      "Динамично поведение на системата.",
    ],
    correctAnswer: "Логически връзки между компонентите.",
    imageURL: null
  },
  {
    index: 10,
    question: "Какво показва зависимостта в диаграмата на компонентите?",
    choices: [
      "Йерархична структура между компонентите.",
      "Компонентът изисква друг за компилация или изпълнение.",
    ],
    correctAnswer: "Компонентът изисква друг за компилация или изпълнение.",
    imageURL: null
  },
  {
    index: 11,
    question: "Каква е ключовата разлика между диаграмите на компонентите и deployment-диаграмите?",
    choices: [
      "Диаграмите на компонентите се използват по време на фазата на проектиране, докато deployment-диаграмите се използват за физическо разгръщане.",
      "Няма разлика; те служат за една и съща цел."
    ],
    correctAnswer: "Диаграмите на компонентите се използват по време на фазата на проектиране, докато deployment-диаграмите се използват за физическо разгръщане.",
    imageURL: null
  },
  {
    index: 12,
    question: "Какво означава предоставен интерфейс в диаграмите на компонентите в UML?",
    choices: [
      "Интерфейс, който компонентът предлага.",
      "Интерфейс, който компонентът изисква.",
    ],
    correctAnswer: "Интерфейс, който компонентът предлага.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531160749/2.png"
  },
  {
    index: 13,
    question: "Какво НЕ е вярно за артефактите в deployment-диаграмите?",
    choices: [
      "Правоъгълници със стереотип артефакт («artifact»)",
      "Те представляват физическо парче софтуер или данни, разположени на възел.",
      "Показват как софтуерните артефакти, като изпълними файлове или файлове с данни, се отнасят към компонентите",
      "Да дефинират логическата групировка на класове обекти."
    ],
    correctAnswer: "Да дефинират логическата групировка на класове обекти.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531161438/5.png"
  },
  {
    index: 15,
    question: "Каква е целта на стереотипа на компонент?",
    choices: [
      "Да определи физическото му местоположение.",
      "Да посочи неговия тип или роля в модела.",
    ],
    correctAnswer: "Да посочи неговия тип или роля в модела.",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво представлява хардуерният възел в диаграмите на разгръщане?",
    choices: [
      "Представяне на функционалността на системата.",
      "Физическо устройство, хостващо софтуерни компоненти.",
    ],
    correctAnswer: "Физическо устройство, хостващо софтуерни компоненти.",
    imageURL: null
  },
  {
    index: 18,
    question: "Кое от следните е вярно за пакетите компоненти?",
    choices: [
      "Те представляват хардуерни зависимости.",
      "Те групират логически свързани компоненти.",
    ],
    correctAnswer: "Те групират логически свързани компоненти.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво описва диаграмата на състоянията в UML?",
    choices: [
      "Физическо разгръщане на възли.",
      "Динамични преходи между състоянията на обект.",
    ],
    correctAnswer: "Динамични преходи между състоянията на обект.",
    imageURL: null
  },
  {
    index: 20,
    question: "Какъв е ключовият фокус на deployment-диаграмите?",
    choices: [
      "Логическа организация на софтуерните модули.",
      "Физическо разпределение на софтуера върху хардуерни възли.",
    ],
    correctAnswer: "Физическо разпределение на софтуера върху хардуерни възли.",
    imageURL: null
  },
  {
    index: 21,
    question: "Диаграмата на компонентите има по-високо ниво на абстракция от диаграмата на класовете - обикновено компонентът се реализира от един или повече класове. Вярно ли е това?",
    choices: [
      "Yes",
      "No",
    ],
    correctAnswer: "Yes",
    imageURL: null
  },
  {
    index: 22,
    question: "Кое не е връзка между компонентите и интерфейсите?",
    choices: [
      "Dependency (dashed arrow) -  Показва, че един компонент разчита на друг",
      "Association (solid line) - Показва по-постоянна връзка между компонентите",
      "Assembly connector - Свързва изискван интерфейс на един компонент с предоставен интерфейс на друг",
      "Nodes"
    ],
    correctAnswer: "Nodes",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240531161020/3.png"
  },
  {
    index: 23,
    question: "Кое НЕ е ключова концепция на deployment-диаграмите?",
    choices: [
      "Dependency",
      "Association",
      "Interface",
      "Node",
      "Component",
      "Artifact",
      "Class"
    ],
    correctAnswer: "Class",
    imageURL: "https://support.content.office.net/en-us/media/257901c1-24a3-41f5-bca4-7b9f8fe95364.png"
  },

];