export const mysql6 = [
  {
    index: 1,
    question: "Какво е основното предимство на алгоритъма C4.5 спрямо ID3?",
    choices: [
      "По-добра обработка на числови атрибути.",
      "По-бързо изграждане на дървото."
    ],
    correctAnswer: "По-добра обработка на числови атрибути.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво представлява pruning в контекста на дърветата на решения?",
    choices: [
      "Увеличаване на размера на дървото за по-добра точност.",
      "Премахване на ненужни разклонения, за да се предотврати overfitting."
    ],
    correctAnswer: "Премахване на ненужни разклонения, за да се предотврати overfitting.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какъв е основният принцип на алгоритъма ID3 за изграждане на дървета на решения?",
    choices: [
      "Използва ентропия за избор на най-добрия атрибут.",
      "Използва регресионни анализи."
    ],
    correctAnswer: "Използва ентропия за избор на най-добрия атрибут.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво представлява 'information gain' в алгоритмите за дървета на решения?",
    choices: [
      "Мярка за намаляване на несигурността след разделяне на данните.",
      "Изчисляване на точността на модела."
    ],
    correctAnswer: "Мярка за намаляване на несигурността след разделяне на данните.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво представлява 'pruning' при C4.5?",
    choices: [
      "Увеличаване на размера на дървото за повече подробности.",
      "Намаляване на размера на дървото чрез премахване на ненужни разклонения."
    ],
    correctAnswer: "Намаляване на размера на дървото чрез премахване на ненужни разклонения.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какъв тип атрибути може да обработва C4.5?",
    choices: [
      "Само номинални атрибути.",
      "Номинални и числови атрибути."
    ],
    correctAnswer: "Номинални и числови атрибути.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какво е основната разлика между двоично и многопосочно разделяне?",
    choices: [
      "Двоично разделяне разделя атрибутите на повече от две групи.",
      "Многопосочно разделяне разделя атрибутите на повече от две групи."
    ],
    correctAnswer: "Многопосочно разделяне разделя атрибутите на повече от две групи.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какъв е проблемът с ранното спиране (early stopping) в машинното обучение?",
    choices: [
      "Моделът може да стане прекалено сложен.",
      "Може да прекъсне процеса на разрастване на дървото твърде рано, без да улови истинските структури."
    ],
    correctAnswer: "Може да прекъсне процеса на разрастване на дървото твърде рано, без да улови истинските структури.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво означава 'subtree raising' в контекста на postpruning?",
    choices: [
      "Премахване на поддървето, ако не е значимо.",
      "Преместване на поддървото на по-високо ниво в дървото."
    ],
    correctAnswer: "Преместване на поддървото на по-високо ниво в дървото.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво прави C4.5 при обработка на липсващи стойности?",
    choices: [
      "Игнорира липсващите стойности.",
      "Използва вероятностен подход за компенсиране на липсващите стойности."
    ],
    correctAnswer: "Използва вероятностен подход за компенсиране на липсващите стойности.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какъв е основният принцип на метода на фракционни инстанции в C4.5?",
    choices: [
      "Разделя екземплярите с липсващи стойности на части и ги обработва с различни тежести.",
      "Игнорира екземплярите с липсващи стойности."
    ],
    correctAnswer: "Разделя екземплярите с липсващи стойности на части и ги обработва с различни тежести.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Каква е основната цел на алгоритъма PRISM?",
    choices: [
      "Изграждане на дървета за решения с минимален размер.",
      "Максимално увеличаване на информационната печалба за генериране на точни правила.",
    ],
    correctAnswer: "Максимално увеличаване на информационната печалба за генериране на точни правила.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Каква е основната цел на RIPPER алгоритъма?",
    choices: [
      "Орязване на ненужни условия за по-добра точност.",
      "Изграждане на по-сложни дървета на решения."
    ],
    correctAnswer: "Орязване на ненужни условия за по-добра точност.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво представляват асоциативните правила?",
    choices: [
      "Правила за свързване на атрибути с цел класификация.",
      "Правила за намиране на зависимости между елементи в данни."
    ],
    correctAnswer: "Правила за намиране на зависимости между елементи в данни.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво е целта на използването на 'frequent-pattern trees' в асоциативните правила?",
    choices: [
      "По-бързо извличане на асоциативни правила чрез компактно представяне.",
      "По-бързо изграждане на дървета за решения."
    ],
    correctAnswer: "По-бързо извличане на асоциативни правила чрез компактно представяне.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво е 'cost-complexity pruning' в контекста на дърветата на решения?",
    choices: [
      "Метод за изграждане на по-сложни дървета на решения.",
      "Метод за подрязване на дървото, който използва кръстосана проверка за избор на оптимален размер на дървото.",

    ],
    correctAnswer: "Метод за подрязване на дървото, който използва кръстосана проверка за избор на оптимален размер на дървото.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Какво прави C4.5 при подрязването на дърво?",
    choices: [
      "Използва Bernoulli-процес за определяне на граници за подрязване.",
      "Прекратява изграждането на дървото, когато достигне максимална точност."
    ],
    correctAnswer: "Използва Bernoulli-процес за определяне на граници за подрязване.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Каква е основната концепция на алгоритъма PART?",
    choices: [
      "Изграждане на по-прости и по-малки дървета за решения.",
      "Комбиниране на дървета за решения и правила за по-ефективна класификация.",
    ],
    correctAnswer: "Комбиниране на дървета за решения и правила за по-ефективна класификация.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Каква е основната идея на TDIDT (Top-Down Induction of Decision Trees)?",
    choices: [
      "Разглеждане на различни критерии за избор на атрибут за разделяне.",
      "Намаляване на сложността чрез подрязване."
    ],
    correctAnswer: "Разглеждане на различни критерии за избор на атрибут за разделяне.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Каква е основната идея на алгоритъма RIPPER(Repeated Incremental Pruning to Produce Error Reduction)- алгоритъм за извличане на класификационни правила?",
    choices: [
      "Намаляване на грешките чрез инкрементално подрязване.",
      "Използване на многопосочни разделяния в дървото."
    ],
    correctAnswer: "Намаляване на грешките чрез инкрементално подрязване.",
    imageURL: ""
  },
  {
    index: 21,
    question: "Кое от следните НЕ е вярно за дърветата на решения?",
    choices: [
      "Използват се за класификация и регресия чрез йерархия от въпроси",
      "Всеки вътрешен възел представлява условие, а листата – крайно решение",
      "Никога не могат да работят с числови стойности",
      "Могат да се подрязват, за да се избегне преобучаване"
    ],
    correctAnswer: "Никога не могат да работят с числови стойности"
  },
  {
    index: 22,
    question: "Кое НЕ е вярно за алгоритъма C4.5?",
    choices: [
      "Поддържа работа с числови и категориални атрибути",
      "Използва техника за подрязване на дървото за по-добро обобщаване",
      "Генерира само линейни модели на зависимост",
      "Наследник е на алгоритъма ID3"
    ],
    correctAnswer: "Генерира само линейни модели на зависимост"
  },
  {
    index: 23,
    question: "Кое НЕ е вярно за подрязването (pruning) при дървета на решения?",
    choices: [
      "Помага за намаляване на сложността на модела",
      "Използва се за избягване на преобучаване към конкретни данни",
      "Винаги влошава точността на модела",
      "Може да се извършва по време или след построяване на дървото"
    ],
    correctAnswer: "Винаги влошава точността на модела"
  },
  {
    index: 24,
    question: "Кое твърдение НЕ се отнася за класификационните правила?",
    choices: [
      "Представляват логически изрази за вземане на решения",
      "Използват се за обяснима класификация на обекти",
      "Работят само с числови данни и игнорират категориални стойности",
      "Могат да се създават от алгоритми като PRISM и RIPPER"
    ],
    correctAnswer: "Работят само с числови данни и игнорират категориални стойности"
  },
  {
    index: 25,
    question: "Кое НЕ е вярно за алгоритъма PRISM(Product Rule Induction for Separate Modules-Извеждане на правила за всеки клас поотделно)?",
    choices: [
      "Създава по едно правило за всеки клас",
      "Работи с категории и създава лесни за разбиране правила",
      "Обучава се чрез невронни мрежи и използва слоеве от възли",
      "Често служи като основа за по-сложни алгоритми като RIPPER"
    ],
    correctAnswer: "Обучава се чрез невронни мрежи и използва слоеве от възли"
  },
  {
    index: 26,
    question: "Кое НЕ е вярно за RIPPER и PART?",
    choices: [
      "Използват механизми за подрязване на ненужни правила",
      "Могат да работят с числови и категориални данни",
      "Създават класификационни правила с цел висока точност и обяснимост",
      "Основно се използват за извличане на асоциативни правила"
    ],
    correctAnswer: "Основно се използват за извличане на асоциативни правила"
  },
  {
    index: 27,
    question: "Кое от следните НЕ е вярно за асоциативните правила?",
    choices: [
      "Описват зависимости от вида: ако X, тогава Y",
      "Използват се в анализ на потребителско поведение, например в търговията",
      "Работят само с числови данни и игнорират категории",
      "Могат да се извличат чрез алгоритми като Apriori и FP-Growth"
    ],
    correctAnswer: "Работят само с числови данни и игнорират категории"
  },
  {
    index: 28,
    question: "Кое НЕ е вярно за FP-дърветата (Frequent-Pattern Trees)?",
    choices: [
      "Използват се за бързо откриване на чести комбинации от елементи",
      "Намаляват нуждата от многократно сканиране на базата данни",
      "Подреждат данните в йерархична структура, базирана на честота",
      "Създават линейни модели за прогнозиране на числови стойности"
    ],
    correctAnswer: "Създават линейни модели за прогнозиране на числови стойности"
  },
  {
    index: 29,
    question: "Кое НЕ е вярно за алгоритъма FP-Growth?",
    choices: [
      "Алтернатива на Apriori за откриване на асоциативни правила",
      "Използва FP-дърво за ефективно съхранение и обработка на данни",
      "Сканира данните многократно при всяка итерация",
      "Е подходящ за работа с големи обеми от транзакции"
    ],
    correctAnswer: "Сканира данните многократно при всяка итерация"
  },
  {
    index: 30,
    question: "Кое НЕ е вярно за честите модели в анализа на асоциации?",
    choices: [
      "Използват се за генериране на асоциативни правила",
      "Модели като FP-Growth избягват генерирането на кандидати",
      "Търсят комбинации, които се срещат рядко в данните",
      "Честотата се определя от предварително зададен праг (support)"
    ],
    correctAnswer: "Търсят комбинации, които се срещат рядко в данните"
  }

];
