export const mysql12 = [
  {
    index: 1,
    question: "При използване на връзка между класове от тип композиция, конструкторът на клас B трябва да бъде:",
    choices: [
      "извикан по време на създаване на клас A, за да се използва като част от него",
      "извикан след като клас A вече е създаден",
      "извикан едновременно с унищожаването на клас A",
      "не е необходимо да бъде извикан, клас B е независим от клас A"
    ],
    correctAnswer: "извикан по време на създаване на клас A, за да се използва като част от него",
    imageURL: null
  },
 

];
