export const mysql5 = [
    {
        index: 1,
        question: "Какво представлява holdout методът в оценката на модели?",
        choices: [
            "Метод, който използва всички данни за обучение",
            "Метод, който разделя данните на обучителен и тестов сет",
            "Метод, който извършва настройка на хиперпараметри"
        ],
        correctAnswer: "Метод, който разделя данните на обучителен и тестов сет"
    },
    {
        index: 2,
        question: "Какво е K-fold Cross-Validation?",
        choices: [
            "Използване на K различни алгоритма за оценка",
             "Разделяне на данните на K подмножествени набора за оценка на модела",
            "Метод, който избира най-добрия хиперпараметър"
        ],
        correctAnswer: "Разделяне на данните на K подмножествени набора за оценка на модела"
    },
    {
        index: 3,
        question: "Каква е основната метрика за класификационни задачи?",
        choices: [
            "Средно аритметично",
            "Error rate (Честота на грешките)",
            "Коефициент на корелация"
        ],
        correctAnswer: "Error rate (Честота на грешките)"
    },
    {
        index: 4,
        question: "Какво представлява resubstitution error?",
        choices: [
            "Грешката на модела върху тестовите данни",
            "Метод за минимизиране на грешките",
             "Грешката на модела върху обучителните данни",
        ],
        correctAnswer: "Грешката на модела върху обучителните данни"
    },
    {
        index: 5,
        question: "Какъв е основният проблем при използването на тестови данни за настройка на параметри?",
        choices: [
            "Моделът няма да работи",
             "Моделът може да се пренастрои към тестовите данни",
            "Няма проблем, ако тестовите данни са големи"
        ],
        correctAnswer: "Моделът може да се пренастрои към тестовите данни"
    },
    {
        index: 6,
        question: "Какво измерва Kappa статистиката?",
        choices: [
            "Средната точност на модела",
            "Броя на грешките в класификацията",
            "Подобрението спрямо случайното предсказване",
        ],
        correctAnswer: "Подобрението спрямо случайното предсказване"
    },
    {
        index: 7,
        question: "Какво е Bootstrap методът?",
        choices: [
            "Метод за оценка чрез вземане на проби с връщане",
            "Метод за разделяне на данните на тренировъчен и тестов сет",
            "Метод за предсказване на вероятности"
        ],
        correctAnswer: "Метод за оценка чрез вземане на проби с връщане"
    },
    {
        index: 8,
        question: "Какво представлява Leave-One-Out Cross-Validation (LOO-CV)?",
        choices: [
            "Метод за избиране на хиперпараметри",
             "Крос-валидация, при която всеки пример се използва веднъж за тестване",
            "Стратегия за минимизиране на загубите"
        ],
        correctAnswer: "Крос-валидация, при която всеки пример се използва веднъж за тестване"
    },
    {
        index: 9,
        question: "Каква е целта на Hyperparameter Selection?",
        choices: [
            "Оптимизиране на параметрите на модела за по-добро представяне",
            "Разделяне на данните на тренировъчен и тестов сет",
            "Избор на метрика за оценка"
        ],
        correctAnswer: "Оптимизиране на параметрите на модела за по-добро представяне"
    },
    {
        index: 10,
        question: "Какво представлява Cost-sensitive evaluation?",
        choices: [
            "Оценка на разликите между алгоритмите",
            "Изчисление на доверителни интервали",
             "Оценяване на моделите с отчитане на разходите за грешки",
        ],
        correctAnswer: "Оценяване на моделите с отчитане на разходите за грешки"
    }
    
];