export const mysql4 = [
  {
    index: 1,
    question: "Какво представлява Data Science?",
    choices: [
      "Наука за съхранение на данни.",
      "Наука за отговаряне на въпроси с данни.",
    ],
    correctAnswer: "Наука за отговаряне на въпроси с данни.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Кои са основните етапи в управлението на данни?",
    choices: [
      "Събиране, съхранение, почистване, трансформация.",
      "Анализ, визуализация, съхранение, трансформация.",
    ],
    correctAnswer: "Събиране, съхранение, почистване, трансформация.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какво включва Data Analysis?",
    choices: [
      "Събиране на данни.",
      "Съхранение на данни.",
      "Диагностичен, предсказателен и предписателен анализ.",
      "Почистване на данни."
    ],
    correctAnswer: "Диагностичен, предсказателен и предписателен анализ.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво е основната цел на DataOps?",
    choices: [
      "Автоматизация и оптимизация на процесите за обработка на данни.",
      "Съхранение на данни.",
    ],
    correctAnswer: "Автоматизация и оптимизация на процесите за обработка на данни.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво представлява CRISP-DM?",
    choices: [
      "Методология за управление на данни.",
      "Стандартен процес за разработка на проекти в областта на науката за данните.",
    ],
    correctAnswer: "Стандартен процес за разработка на проекти в областта на науката за данните.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Кои роли включва TDSP (Team Data Science Process)?",
    choices: [
      "Project Manager, Data Engineer, Data Scientist, Application Developer, Project Lead.",
      "Data Analyst, Data Engineer, Data Scientist, Project Manager, Developer.",
    ],
    correctAnswer: "Project Manager, Data Engineer, Data Scientist, Application Developer, Project Lead.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какво представлява DevOps?",
    choices: [
      "Практики и технологии за автоматизация на процесите за съхранение на данни.",
      "Практики и технологии за автоматизация на процесите за разработка и доставка на софтуер.",
    ],
    correctAnswer: "Практики и технологии за автоматизация на процесите за разработка и доставка на софтуер.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какво е Continuous Integration (CI)?",
    choices: [
      "Практика за автоматично визуализиране на данни.",
      "Практика за автоматично изграждане, тестване и анализ на софтуерни промени.",
    ],
    correctAnswer: "Практика за автоматично изграждане, тестване и анализ на софтуерни промени.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво е Continuous Deployment (CD)?",
    choices: [
      "Практика за автоматично съхранение на данни.",
      "Практика за автоматично тестване и внедряване на софтуерни промени в продукционни среди.",
    ],
    correctAnswer: "Практика за автоматично тестване и внедряване на софтуерни промени в продукционни среди.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво е Continuous Delivery (CDE)?",
    choices: [
      "Практика за осигуряване на готовност за доставка на софтуерни промени чрез тестване в среди, подобни на продукционните.",
      "Практика за автоматично съхранение на данни.",
    ],
    correctAnswer: "Практика за осигуряване на готовност за доставка на софтуерни промени чрез тестване в среди, подобни на продукционните.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво представлява MLOps?",
    choices: [
      "Методология за управление на данни.",
      "Методология за управление на машинното обучение.",
    ],
    correctAnswer: "Методология за управление на машинното обучение.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво представлява AIOps?",
    choices: [
      "Използване на изкуствен интелект за оптимизация на IT операциите.",
      "Методология за управление на данни.",
    ],
    correctAnswer: "Използване на изкуствен интелект за оптимизация на IT операциите.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Кои са основните ценности на DataOps Manifesto?",
    choices: [
      "Взаимодействия между хората, работещи анализи, колаборация с клиентите, експериментация.",
      "Съхранение на данни, почистване на данни, трансформация на данни, визуализация на данни.",
    ],
    correctAnswer: "Взаимодействия между хората, работещи анализи, колаборация с клиентите, експериментация.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво означава 'Analytics is code' в контекста на DataOps?",
    choices: [
      "Аналитичните екипи използват различни инструменти за достъп, интеграция, моделиране и визуализация на данни.",
      "Аналитичните екипи съхраняват данни.",
    ],
    correctAnswer: "Аналитичните екипи използват различни инструменти за достъп, интеграция, моделиране и визуализация на данни.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво означава 'Make it reproducible' в контекста на DataOps?",
    choices: [
      "Версиониране на данни, конфигурации и код за осигуряване на възпроизводими резултати.",
      "Съхранение на данни.",
      "Почистване на данни.",
      "Трансформация на данни."
    ],
    correctAnswer: "Версиониране на данни, конфигурации и код за осигуряване на възпроизводими резултати.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво означава 'Orchestrate' в контекста на DataOps?",
    choices: [
      "Съхранение на данни.",
      "Почистване на данни.",
      "Управление на данни, инструменти, код, среди и работа на аналитичните екипи.",
      "Трансформация на данни."
    ],
    correctAnswer: "Управление на данни, инструменти, код, среди и работа на аналитичните екипи.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Какво означава 'Disposable environments' в контекста на DataOps?",
    choices: [
      "Създаване на лесни за създаване, изолирани, безопасни и временни технически среди.",
      "Съхранение на данни.",
      "Почистване на данни.",
      "Трансформация на данни."
    ],
    correctAnswer: "Създаване на лесни за създаване, изолирани, безопасни и временни технически среди.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какво означава 'Simplicity' в контекста на DataOps?",
    choices: [
      "Съхранение на данни.",
      "Почистване на данни.",
       "Максимизиране на количеството работа, която не е извършена.",
      "Трансформация на данни."
    ],
    correctAnswer: "Максимизиране на количеството работа, която не е извършена.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Какво означава 'Analytics is manufacturing' в контекста на DataOps?",
    choices: [
      "Аналитичните процеси са аналогични на lean производствените линии.",
      "Съхранение на данни.",
      "Почистване на данни.",
      "Трансформация на данни."
    ],
    correctAnswer: "Аналитичните процеси са аналогични на lean производствените линии.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Какво означава 'Quality is paramount' в контекста на DataOps?",
    choices: [
            "Съхранение на данни.",
      "Почистване на данни.",
      "Аналитичните процеси трябва да бъдат изградени с основа, способна на автоматично откриване на аномалии и проблеми със сигурността.",
      "Трансформация на данни."
    ],
    correctAnswer: "Аналитичните процеси трябва да бъдат изградени с основа, способна на автоматично откриване на аномалии и проблеми със сигурността.",
    imageURL: ""
  }
 

];
