export const mysql8 = [
  {
    index: 1,
    question: "Какво Не е вярно за ADD /Attribute Driven Design/ подхода в проектирането на софтуерната архитектура?",
    choices: [
      "Детайлно документиране на всички модули",
      "Използване на качествени свойства като основа за проектиране",
      "Това е рекурсивен процес като на всяка стъпка се използват тактики и архитектурни модели за постигане на желаните качествени свойства",
      "В резултат се получават първите няколко нива на модулната декомпозиция"
    ],
    correctAnswer: "Детайлно документиране на всички модули",
    imageURL: null
  },
 

];