export const mysql1 = [
  {
    index: 1,
    question: "Какво представлява софтуерът?",
    choices: [
      "Физическо устройство, което изпълнява задачи.",
      "Инструкции и данни, които управляват работата на компютърните системи.",
    ],
    correctAnswer: "Инструкции и данни, които управляват работата на компютърните системи.",
    imageURL: null
  },
  {
    index: 2,
    question: "Кои са основните атрибути на качествения софтуер?",
    choices: [
      "Надеждност, мащабируемост, използваемост.",
      "Поддръжка, гаранция, съвместимост."
    ],
    correctAnswer: "Надеждност, мащабируемост, използваемост.",
    imageURL: null
  },
  {
    index: 3,
    question: "Какво е софтуерно инженерство?",
    choices: [
      "Процесът на изграждане и поддръжка на софтуер по структурирани методи.",
      "Проектиране на хардуерни компоненти за софтуерни устройства.",
    ],
    correctAnswer: "Процесът на изграждане и поддръжка на софтуер по структурирани методи.",
    imageURL: null
  },
  {
    index: 4,
    question: "Каква е целта на софтуерното инженерство?",
    choices: [
      "Да разработва софтуер бързо, независимо от качеството.",
      "Да създава софтуер, който е лесен за поддръжка и с висока надеждност.",
    ],
    correctAnswer: "Да създава софтуер, който е лесен за поддръжка и с висока надеждност.",
    imageURL: null
  },
  {
    index: 5,
    question: "Кое от следните е основен процес в софтуерното инженерство?",
    choices: [
      "Създаване на хардуер.",
      "Управление на проекти.",
      "Проектиране и тестване на софтуер."
    ],
    correctAnswer: "Проектиране и тестване на софтуер.",
    imageURL: null
  },
  {
    index: 6,
    question: "Какво е жизнен цикъл на софтуера?",
    choices: [
      "Етапите, през които софтуерът преминава от концепция до поддръжка.",
      "Механизмите за включване и изключване на софтуер.",
    ],
    correctAnswer: "Етапите, през които софтуерът преминава от концепция до поддръжка.",
    imageURL: null
  },
  {
    index: 7,
    question: "Каква е разликата между функционални и нефункционални изисквания?",
    choices: [
      "Функционалните изисквания описват какво прави софтуерът, а нефункционалните как го прави.",
      "Функционалните изисквания са необходими само за мобилни приложения.",
    ],
    correctAnswer: "Функционалните изисквания описват какво прави софтуерът, а нефункционалните как го прави.",
    imageURL: null
  },
  {
    index: 8,
    question: "Какво представлява мащабируемостта в софтуерната архитектура?",
    choices: [
      "Механизмът за записване на софтуера върху различни дискове.",
      "Способността на софтуера да увеличава своите възможности при нарастване на натоварването.",
    ],
    correctAnswer: "Способността на софтуера да увеличава своите възможности при нарастване на натоварването.",
    imageURL: null
  },
  {
    index: 9,
    question: "Какво представлява тестовият план?",
    choices: [
      "Механизъм за автоматично създаване на софтуер.",
       "Документ, който дефинира стратегията и ресурсите за тестване на софтуер.",
    ],
    correctAnswer: "Документ, който дефинира стратегията и ресурсите за тестване на софтуер.",
    imageURL: null
  },
  {
    index: 10,
    question: "Кои са основните етапи на тестване в софтуера?",
    choices: [
      "Машинно обучение, анализ на данни, оптимизация.",
       "Модулно тестване, интеграционно тестване, системно тестване.",
    ],
    correctAnswer: "Модулно тестване, интеграционно тестване, системно тестване.",
    imageURL: null
  },
  {
    index: 11,
    question: "Какво представлява рефакторингът?",
    choices: [
      "Смяна на програмния език на софтуера.",
       "Подобряване на кода без промяна в поведението му.",
    ],
    correctAnswer: "Подобряване на кода без промяна в поведението му.",
    imageURL: null
  },
  {
    index: 12,
    question: "Каква е ролята на документацията в софтуерното инженерство?",
    choices: [
      "Осигурява информация за потребители и разработчици относно софтуера.",
      "Замества нуждата от обучение на потребителите.",
    ],
    correctAnswer: "Осигурява информация за потребители и разработчици относно софтуера.",
    imageURL: null
  },
  {
    index: 13,
    question: "Какво е прототипиране?",
    choices: [
      "Използване на готови шаблони за създаване на програми.",
       "Процесът на създаване на опростен модел на софтуер за тестване.",
    ],
    correctAnswer: "Процесът на създаване на опростен модел на софтуер за тестване.",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво представлява Agile методологията?",
    choices: [
      "Гъвкав подход за разработка на софтуер с кратки итерации и екипна работа.",
      "Традиционен водопаден модел за разработка на софтуер.",
    ],
    correctAnswer: "Гъвкав подход за разработка на софтуер с кратки итерации и екипна работа.",
    imageURL: null
  },
  {
    index: 15,
    question: "Какво е софтуерна архитектура?",
    choices: [
      "Процесът на компилиране на код в машинни инструкции.",
      "Структура на софтуерната система, която показва компонентите и техните взаимодействия.",
    ],
    correctAnswer: "Структура на софтуерната система, която показва компонентите и техните взаимодействия.",
    imageURL: null
  },
  {
    index: 16,
    question: "Каква е целта на управление на риска в софтуерното инженерство?",
    choices: [
      "Да идентифицира и намалява потенциални проблеми в проекта.",
      "Да премахва всички изисквания към софтуера.",
    ],
    correctAnswer: "Да идентифицира и намалява потенциални проблеми в проекта.",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво е Technical Debt в софтуера?",
    choices: [
      "Неплатени лицензи за софтуер.",
      "Комплексност или недостатъци в кода, които затрудняват бъдещи промени.",
    ],
    correctAnswer: "Комплексност или недостатъци в кода, които затрудняват бъдещи промени.",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво представлява инкременталният модел?",
    choices: [
      "Използване на едновременно програмиране за няколко проекта.",
      "Модел за създаване на софтуер без прототипи.",
            "Модел за разработка, при който системата се създава поетапно чрез добавяне на функционалности.",
    ],
    correctAnswer: "Модел за разработка, при който системата се създава поетапно чрез добавяне на функционалности.",
    imageURL: null
  },
  {
    index: 19,
    question: "Какво представлява процесът на непрекъсната интеграция?",
    choices: [
      "Честа интеграция на кода с автоматични тестове за откриване на грешки.",
      "Създаване на резервни копия на софтуера в реално време.",
    ],
    correctAnswer: "Честа интеграция на кода с автоматични тестове за откриване на грешки.",
    imageURL: null
  },
  {
    index: 20,
    question: "Кое от следните не е принцип на добрата софтуерна архитектура?",
    choices: [  
      "Независимост между модулите.",
       "Висока свързаност между компонентите.",
    ],
    correctAnswer: "Висока свързаност между компонентите.",
    imageURL: null
  }

]


