export const mysql9 = [
  {
    index: 1,
    question: "Защо документирането на софтуерната архитектура е важно?",
    choices: [
      "Защото прави архитектурата по-красива",
      "Защото перфектната архитектура може да бъде безполезна, ако не е документирана правилно",
      "Защото увеличава броя на програмистите",
      "Защото намалява разходите за проект"
    ],
    correctAnswer: "Защото перфектната архитектура може да бъде безполезна, ако не е документирана правилно",
    imageURL: null
  },
  
  


];