export const mysql7 = [
  {
    index: 1,
    question: "Какво представлява обхватът на проекта?",
    choices: [
      "Характеристиките и функциите на продукта.",
      "Работата, която трябва да се извърши за създаване на продукта или услугата."
    ],
    correctAnswer: "Работата, която трябва да се извърши за създаване на продукта или услугата.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Каква е основната цел на структурата за работа по проекта (WBS- work breackdown structure)?",
    choices: [
      "Да се създаде график на проекта.",
      "Да се идентифицират малки, специфични части от работата."
    ],
    correctAnswer: "Да се идентифицират малки, специфични части от работата.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какво НЕ се определя чрез WBS?",
    choices: [
      "Уникален идентификационен номер на всяка задача.",
      "Последователността на изпълнение на задачите."
    ],
    correctAnswer: "Последователността на изпълнение на задачите.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кое твърдение е вярно за мрежовите диаграми?",
    choices: [
      "Те включват всички задачи, подредени по азбучен ред.",
      "Те представят зависимостите между задачите."
    ],
    correctAnswer: "Те представят зависимостите между задачите.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Кой тип зависимост е най-често използван в мрежовите диаграми?",
    choices: [
      "Start to Finish (SF)",
      "Finish to Start (FS)"
    ],
    correctAnswer: "Finish to Start (FS)",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво измерва „работата(effort)“ при определяне на времето за задача?",
    choices: [
      "Календарно време.",
      "Човекочасове/дни/месеци."
    ],
    correctAnswer: "Човекочасове/дни/месеци.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Кой метод използва правоъгълници за задачите и стрелки за зависимостите?",
    choices: [
      "Arrow diagramming method - ADM или Activity on arrow - AOA",
      "Precedence diagramming method - PDM"
    ],
    correctAnswer: "Precedence diagramming method - PDM",
    imageURL: ""
  },
  {
    index: 8,
    question: "Как се нарича мрежовият метод, който използва само FS зависимости?",
    choices: [
      "ADM",
      "PDM"
    ],
    correctAnswer: "ADM",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво представлява критичният път?",
    choices: [
      "Път с най-много задачи в проекта.",
      "Най-дългата последователност от задачи, която определя времетраенето на проекта."
    ],
    correctAnswer: "Най-дългата последователност от задачи, която определя времетраенето на проекта.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво е ES (Early Start)?",
    choices: [
      "Най-ранната дата за започване на задача.",
      "Най-късната дата за завършване на проекта."
    ],
    correctAnswer: "Най-ранната дата за започване на задача.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Как се изчислява EF (Early Finish)?",
    choices: [
      "EF = ES + Duration",
      "EF = LS - Duration"
    ],
    correctAnswer: "EF = ES + Duration",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво е „плаващо време“ (float)?",
    choices: [
      "Разликата между продължителностите на различни задачи.",
      "Времето, с което може да се забави задача без това да повлияе на крайния срок."
    ],
    correctAnswer: "Времето, с което може да се забави задача без това да повлияе на крайния срок.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Какво използва PERT(Program Evaluation and Review Technique) методът?",
    choices: [
      "Средни претеглени стойности за времетраене.",
      "Само най-вероятното време."
    ],
    correctAnswer: "Средни претеглени стойности за времетраене.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво използва CPM(Critical Path Method) методът основно?",
    choices: [
      "Най-вероятното време.",
      "Песимистичното време."
    ],
    correctAnswer: "Най-вероятното време.",
    imageURL: ""
  },
  {
    index: 15,
    question: "За какво служи GANTT диаграмата?",
    choices: [
      "Да показва времето за изпълнение на проекта чрез графични елементи.",
      "Да дефинира плаващото време."
    ],
    correctAnswer: "Да показва времето за изпълнение на проекта чрез графични елементи.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво представлява LS (Late Start)?",
    choices: [
      "Най-късната дата, на която може да започне задача без да закъснее проекта.",
      "Най-ранната дата за завършване на задача."
    ],
    correctAnswer: "Най-късната дата, на която може да започне задача без да закъснее проекта.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Каква е целта на графика на проекта?",
    choices: [
      "Да се избегнат прекъсвания в работата по задачите.",
      "Да се осигури визуално представяне на времевата последователност и продължителност."
    ],
    correctAnswer: "Да се осигури визуално представяне на времевата последователност и продължителност.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какво е Statement of Work (SOW)?",
    choices: [
      "Описание на работата по задачата.",
      "Диаграма на критичния път."
    ],
    correctAnswer: "Описание на работата по задачата.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Коя е първата стъпка при създаване на план-график?",
    choices: [
      "Определяне на реалното времетраене.",
      "Определяне на предварително времетраене при идеални условия."
    ],
    correctAnswer: "Определяне на предварително времтраене при идеални условия.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Кое твърдение е вярно относно зависимостите в мрежовите диаграми?",
    choices: [
      "Всички задачи се изпълняват последователно.",
      "Някои задачи могат да се изпълняват паралелно, ако няма зависимости."
    ],
    correctAnswer: "Някои задачи могат да се изпълняват паралелно, ако няма зависимости.",
    imageURL: ""
  }
];
