export const mysql6 = [
  {
    index: 1,
    question: "Кога се създава екипът по проекта?",
    choices: [
      "Когато проектът е детайлно дефиниран и е в изпълнителна фаза.",
      "Когато проектът е дефиниран достатъчно добре, но не в такъв детайл, че да участват само в изпълнението му."
    ],
    correctAnswer: "Когато проектът е дефиниран достатъчно добре, но не в такъв детайл, че да участват само в изпълнението му.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво включва планирането на организацията на екипа?",
    choices: [
      "Идентифициране, документиране, разпределяне на роли и описание на взаимоотношенията.",
      "Само разпределяне на роли и отговорности.",

    ],
    correctAnswer: "Идентифициране, документиране, разпределяне на роли и описание на взаимоотношенията.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Кой може да участва в екипа?",
    choices: [
      "Само вътрешни служители.",
      "Основен тим, външни ресурси като консултанти или наети специалисти."
    ],
    correctAnswer: "Основен тим, външни ресурси като консултанти или наети специалисти.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво представлява RAM (Responsibility Assignment Matrix)?",
    choices: [
      "Таблица за отчитане на разходите на проекта.",
      "Връзка между задачи, участници и техните отговорности."
    ],
    correctAnswer: "Връзка между задачи, участници и техните отговорности.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Кои са етапите на развитие на екипа?",
    choices: [
      "Forming, Storming, Norming, Performing, Mourning.",
      "Начало, Развитие, Успех, Финал.",

    ],
    correctAnswer: "Forming, Storming, Norming, Performing, Mourning.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Кои са основните принципи при планирането на ресурсите?",
    choices: [
      "Цикличност, седмично планиране, проверка на предишни периоди.",
      "Само текущо разпределение на ресурсите."
    ],
    correctAnswer: "Цикличност, седмично планиране, проверка на предишни периоди.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Каква е ролята на ръководителя на проекта в процеса на планиране на ресурсите?",
    choices: [
      "Да одобрява отпуските на служителите.",
      "Да планира, координира и оптимизира разпределението на ресурсите."
    ],
    correctAnswer: "Да планира, координира и оптимизира разпределението на ресурсите.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Как се определя натоварването на ресурсите?",
    choices: [
      "В седмици, дни, часове или като процент от работното време.",
      "Само в дни."
    ],
    correctAnswer: "В седмици, дни, часове или като процент от работното време.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какви видове проекти участват в процеса на планиране?",
    choices: [
      "Само технологични проекти.",
      "ЕРП, консултантски, технологични, продуктови, поддръжка и административни."
    ],
    correctAnswer: "ЕРП, консултантски, технологични, продуктови, поддръжка и административни.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво се прави при свръхнатоварване на ресурсите?",
    choices: [
      "Мениджмънтът на компанията намира решение.",
      "Служителите сами трябва да намерят решение."
    ],
    correctAnswer: "Мениджмънтът на компанията намира решение.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Как се съхраняват резултатите от планирането?",
    choices: [
      "В централен депозитар с достъп за участниците.",
      "Всеки ръководител ги съхранява самостоятелно."
    ],
    correctAnswer: "В централен депозитар с достъп за участниците.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво включват административните проекти?",
    choices: [
      "Само обучение.",
      "Обучение, изследвания, административни дейности."
    ],
    correctAnswer: "Обучение, изследвания, административни дейности.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Кога се стартира процесът по планиране?",
    choices: [
      "В последната седмица на всеки месец.",
      "В началото на всяка година.",

    ],
    correctAnswer: "В последната седмица на всеки месец.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво се прави при наличие на сериозни деформации в натоварването?",
    choices: [
      "Мениджмънтът разглежда случая и намира решение.",
      "Проектните ръководители преразпределят ресурсите самостоятелно."
    ],
    correctAnswer: "Мениджмънтът разглежда случая и намира решение.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Оценката на изискванията при планиране на обхвата на ИТ проект е сложен процес, който се реализира по следния начин:",
    choices: [
      "Внимателен анализ на изискванията и оценка на всяко едно от тях.",
      "Бърз преглед и приблизителна оценка.",
      "Няма нужда от губене на време за анализ, оценката е на база на наличните ресурси.",
      "Каквато и да е оценка, после ще видим, в процеса на работа ще я уточняваме."
    ],
    correctAnswer: "Внимателен анализ на изискванията и оценка на всяко едно от тях.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Кой не е свързан с оценката на софтуерен проект?",
    choices: [
      "Ръководителят на проекта.",
      "Спонсорът на проекта.",
      "Доставчикът на хардуер.",
      "Системния администратор."
    ],
    correctAnswer: "Доставчикът на хардуер.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Кога се определя оптималният вариант на решението?",
    choices: [
      "Планирането на проекта.",
      "Началото на проекта.",
      "Реализацията на проекта.",
      "Първоначалната оценка на проекта."
    ],
    correctAnswer: "Първоначалната оценка на проекта.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Кое е вярно за функционалната организация?",
    choices: [
      "РП има големи пълномощия.",
      "Всички участници са групирани по дирекции.",
      "Всички участници са членове на проектни екипи.",
      "Има специализирана структура за УП."
    ],
    correctAnswer: "Всички участници са групирани по дирекции.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Кога се инициализира един проект?",
    choices: [
      "Когато се разбере проблемът и се идентифицира истинската нужда.",
      "Когато се осигури необходимото финансиране.",
      "Когато се планират задачите и дейностите.",
      "Когато се дефинира идеята."
    ],
    correctAnswer: "Когато се разбере проблемът и се идентифицира истинската нужда.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Преговорите с участниците на мултинационални проекти може да е много сложна задача, особено когато хората не се познават. Успешното решаване на тази задача трябва да се извърши с:",
    choices: [
      "Повишено внимание в екипа.",
      "Фокус върху текущите задачи на екипа.",
      "Фокус върху различията в екипа.",
      "Притеснение за бъдещето на проекта."
    ],
    correctAnswer: "Фокус върху текущите задачи на екипа.",
    imageURL: ""
  },
  {
    index: 21,
    question: "Какво е PRINCE?",
    choices: [
      "Основна роля в проекта.",
      "Основна отговорност в проекта.",
      "Метод за оценка на проекти.",
      "Структуриран метод за ефективно управление на проекти."
    ],
    correctAnswer: "Структуриран метод за ефективно управление на проекти.",
    imageURL: ""
  },
  {
    index: 22,
    question: "Какво е RAM?",
    choices: [
      "Връзка между спонсора и екипа на проекта.",
      "Връзка между задачи, участници в проекта и техните отговорности.",
      "Връзка между задачите и разходите в проекта.",
      "Връзка междуекипа и времето за изпълнение на задачите."
    ],
    correctAnswer: "Връзка между задачи, участници в проекта и техните отговорности.",
    imageURL: ""
  },
  {
    index: 23,
    question: "При управление на екипа на проекта взаимоотношенията са:",
    choices: [
      "Добри и прекрасни.",
      "Временни и нови.",
      "Постоянни и продължаващи.",
      "Конкурентни и състезателни."
    ],
    correctAnswer: "Временни и нови.",
    imageURL: ""
  },
  {
    index: 24,
    question: "Организационен аспект от управлението на проекта е:",
    choices: [
      "Кой взима решенията.",
      "Кой управлява екипа.",
      "Как хората комуникират помежду си.",
      "Всичко изброено по-горе."
    ],
    correctAnswer: "Всичко изброено по-горе.",
    imageURL: ""
  }



];