export const mysql9 = [
  {
    index: 1,
    question: "Какво е несигурност в контекста на управлението на проекти?",
    choices: [
      "Пълна яснота относно резултата от дадено събитие.",
      "Липса на информация, знание или разбиране по отношение на изхода от действие или събитие."
    ],
    correctAnswer: "Липса на информация, знание или разбиране по отношение на изхода от действие или събитие.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво представлява рискът в управлението на проекти?",
    choices: [
      "Процес на определяне на качествени критерии.",
      "Оценка на количеството съществуваща несигурност."
    ],
    correctAnswer: "Оценка на количеството съществуваща несигурност.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какво може да бъде последствието при осъществяване на риск в проекта?",
    choices: [
      "Само положителен ефект върху проекта.",
      "Положителен или негативен ефект върху резултата от проекта."
    ],
    correctAnswer: "Положителен или негативен ефект върху резултата от проекта.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кой е първият етап в управлението на риска?",
    choices: [
      "Идентификация на риска.",
      "Контрол на риска.",

    ],
    correctAnswer: "Идентификация на риска.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво включва количественият анализ на риска?",
    choices: [
      "Категоризация на риска по цветови категории.",
      "Количествена оценка на последиците от осъществяването на риска."
    ],
    correctAnswer: "Количествена оценка на последиците от осъществяването на риска.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво е целта на преценката на риска?",
    choices: [
      "Определяне на графика за дейностите.",
      "Определяне на рисковете с най-голяма заплаха за проекта."
    ],
    correctAnswer: "Определяне на рисковете с най-голяма заплаха за проекта.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какво означава смекчаване на ефекта от риска (Mitigation)?",
    choices: [
      "Намаляване на ефекта от евентуалното осъществяване на риска.",
      "Прехвърляне на риска на друг етап.",

    ],
    correctAnswer: "Намаляване на ефекта от евентуалното осъществяване на риска.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Кой метод за управление на риска включва приемането му без конкретни действия?",
    choices: [
      "Елиминация.",
      "Приемане (Assumption)."
    ],
    correctAnswer: "Приемане (Assumption).",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво представлява планирането на решаването на проблеми (Contingency planning)?",
    choices: [
      "Планиране на задачи в проектния график.",
      "Предварително планиране на действия при осъществяване на рискове."
    ],
    correctAnswer: "Предварително планиране на действия при осъществяване на рискове.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво е остатъчен (Residual) риск?",
    choices: [
      "Риск, който остава след предприемане на действия за управление на основния риск.",
      "Риск, който е избегнат напълно.",

    ],
    correctAnswer: "Риск, който остава след предприемане на действия за управление на основния риск.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво е вторичен (Secondary) риск?",
    choices: [
      "Риск, който възниква вследствие на решение за управление на основния риск.",
      "Риск, който е с най-нисък приоритет.",
    ],
    correctAnswer: "Риск, който възниква вследствие на решение за управление на основния риск.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Как се дефинира качеството според ISO8402?",
    choices: [
      "Сборът от параметри и характеристики на даден продукт или услуга която оказва влияние върху неговата способност да задоволи определени нужди",
      "Само визуалните характеристики на продукта."
    ],
    correctAnswer: "Сборът от параметри и характеристики на даден продукт или услуга която оказва влияние върху неговата способност да задоволи определени нужди",
    imageURL: ""
  },
  {
    index: 13,
    question: "Кой принцип на Филип Кросби се отнася до дефектите?",
    choices: [
      "Качеството е елегантен продукт.",
      "Качеството се постига чрез превенция на дефектите."
    ],
    correctAnswer: "Качеството се постига чрез превенция на дефектите.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво означава \"цена на качеството\"?",
    choices: [
      "Цената на материалите в проекта.",
      "Цената на несъответствието."
    ],
    correctAnswer: "Цената на несъответствието.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Кой процес включва одит и съвместен преглед?",
    choices: [
      "Контрол на риска.",
      "План за управление на качеството."
    ],
    correctAnswer: "План за управление на качеството.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво е целта на контрола на качеството?",
    choices: [
      "Да се определи работната заплата.",
      "Да се провери дали продуктът отговаря на стандартите."
    ],
    correctAnswer: "Да се провери дали продуктът отговаря на стандартите.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Кой елемент се използва за планиране на комуникацията в проект?",
    choices: [
      "Комуникационен план.",
      "График на изпълнение.",

    ],
    correctAnswer: "Комуникационен план.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Кой метод за комуникация включва директен контакт между хората?",
    choices: [
      "Лице в лице.",
      "Имейл."
    ],
    correctAnswer: "Лице в лице.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Кои са основни видове тестове при тестването на системи?",
    choices: [
      "Тестове на модулите, интеграционни тестове, приемателни тестове.",
      "Тестове на пазара, тестове за опаковка, външен вид."
    ],
    correctAnswer: "Тестове на модулите, интеграционни тестове, приемателни тестове.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Какво описва стратегията за тестване?",
    choices: [
      "Как ще се опише фирмата пред инвеститорите.",
      "Какво ще се тества и как ще се тества системата.",
    ],
    correctAnswer: "Какво ще се тества и как ще се тества системата.",
    imageURL: ""
  }
];
