export const mysql6 = [
  {
    index: 1,
    question: "Кога се създава екипът по проекта?",
    choices: [
      "Когато проектът е детайлно дефиниран и е в изпълнителна фаза.",
      "Когато проектът е дефиниран достатъчно добре, но не в такъв детайл, че да участват само в изпълнението му."
    ],
    correctAnswer: "Когато проектът е дефиниран достатъчно добре, но не в такъв детайл, че да участват само в изпълнението му.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво включва планирането на организацията на екипа?",
    choices: [
      "Идентифициране, документиране, разпределяне на роли и описание на взаимоотношенията.",
      "Само разпределяне на роли и отговорности.",

    ],
    correctAnswer: "Идентифициране, документиране, разпределяне на роли и описание на взаимоотношенията.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Кой може да участва в екипа?",
    choices: [
      "Само вътрешни служители.",
      "Основен тим, външни ресурси като консултанти или наети специалисти."
    ],
    correctAnswer: "Основен тим, външни ресурси като консултанти или наети специалисти.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво представлява RAM (Responsibility Assignment Matrix)?",
    choices: [
      "Таблица за отчитане на разходите на проекта.",
      "Връзка между задачи, участници и техните отговорности."
    ],
    correctAnswer: "Връзка между задачи, участници и техните отговорности.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Кои са етапите на развитие на екипа?",
    choices: [
      "Forming, Storming, Norming, Performing, Mourning.",
      "Начало, Развитие, Успех, Финал.",

    ],
    correctAnswer: "Forming, Storming, Norming, Performing, Mourning.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Кои са основните принципи при планирането на ресурсите?",
    choices: [
      "Цикличност, седмично планиране, проверка на предишни периоди.",
      "Само текущо разпределение на ресурсите."
    ],
    correctAnswer: "Цикличност, седмично планиране, проверка на предишни периоди.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Каква е ролята на ръководителя на проекта в процеса на планиране на ресурсите?",
    choices: [
      "Да одобрява отпуските на служителите.",
      "Да планира, координира и оптимизира разпределението на ресурсите."
    ],
    correctAnswer: "Да планира, координира и оптимизира разпределението на ресурсите.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Как се определя натоварването на ресурсите?",
    choices: [
      "В дни, часове или като процент от работното време.",
      "Само в дни."
    ],
    correctAnswer: "В дни, часове или като процент от работното време.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какви видове проекти участват в процеса на планиране?",
    choices: [
      "Само технологични проекти.",
      "ЕРП, консултантски, технологични, продуктови, поддръжка и административни."
    ],
    correctAnswer: "ЕРП, консултантски, технологични, продуктови, поддръжка и административни.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво се прави при свръхнатоварване на ресурсите?",
    choices: [
      "Мениджмънтът на компанията намира решение.",
      "Служителите сами трябва да намерят решение."
    ],
    correctAnswer: "Мениджмънтът на компанията намира решение.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Как се съхраняват резултатите от планирането?",
    choices: [
      "В централен депозитар с достъп за участниците.",
      "Всеки ръководител ги съхранява самостоятелно."
    ],
    correctAnswer: "В централен депозитар с достъп за участниците.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво включват административните проекти?",
    choices: [
      "Само обучение.",
      "Обучение, изследвания, административни дейности."
    ],
    correctAnswer: "Обучение, изследвания, административни дейности.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Кога се стартира процесът по планиране?",
    choices: [
      "В последната седмица на всеки месец.",
      "В началото на всяка година.",

    ],
    correctAnswer: "В последната седмица на всеки месец.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво се прави при наличие на сериозни деформации в натоварването?",
    choices: [
      "Мениджмънтът разглежда случая и намира решение.",
      "Проектните ръководители преразпределят ресурсите самостоятелно."
    ],
    correctAnswer: "Мениджмънтът разглежда случая и намира решение.",
    imageURL: ""
  }



];