export const mysql2 = [
  {
    index: 1,
    question: "Какво представлява софтуерният процес?",
    choices: [
        "Единствена процедура за писане на код",
        "Последователност от стъпки, включващи дейности, ограничения и ресурси, които осигуряват постигането на определен резултат",
        "Метод за тестване на софтуерни приложения",
        "Управленска стратегия за ИТ проекти"
    ],
    correctAnswer: "Последователност от стъпки, включващи дейности, ограничения и ресурси, които осигуряват постигането на определен резултат"
},

 
];