export const mysql10 = [
  {
    index: 1,
    question: "Каква е основната цел на изпълнението на проекта?",
    choices: [
      "Изготвяне на краен отчет за проекта.",
      "Идентификация на цел и ежедневна координация за постигането ѝ."
    ],
    correctAnswer: "Идентификация на цел и ежедневна координация за постигането ѝ.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво означава контрол на проекта?",
    choices: [
      "Проследяване на екипната динамика.",
      "Минимизиране на разликите между планирани и реално постигнати резултати."
    ],
    correctAnswer: "Минимизиране на разликите между планирани и реално постигнати резултати.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какъв е първият параметър при оценка на изпълнението?",
    choices: [
      "Къде се намира в момента проекта (текущо състояние).",
      "Оценка на потребителското удовлетворение.",

    ],
    correctAnswer: "Къде се намира в момента проекта (текущо състояние).",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво се контролира при изпълнението на проекта?",
    choices: [
      "Само ресурсите на проекта.",
      "Обхват, график, цена и качество на проекта."
    ],
    correctAnswer: "Обхват, график, цена и качество на проекта.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Кой е основен източник на данни за контрол на проекта?",
    choices: [
      "Мнения от външни клиенти.",
      "Срещи за следене на прогреса и статуса."
    ],
    correctAnswer: "Срещи за следене на прогреса и статуса.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво показва червената линия в диаграмата на GANTT?",
    choices: [
      "Текущия статус на проекта.",
      "Прогнозен напредък.",

    ],
    correctAnswer: "Текущия статус на проекта.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какво е BCWS?",
    choices: [
      "Действителни разходи.",
      "Планирани разходи за планираната работа."
    ],
    correctAnswer: "Планирани разходи за планираната работа.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какво е ACWP?",
    choices: [
      "Изработена стойност.",
      "Действителни разходи за извършената работа."
    ],
    correctAnswer: "Действителни разходи за извършената работа.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво измерва CV (Cost Variance)?",
    choices: [
      "Разлика във времето за изпълнение.",
      "Разлика между изработена стойност и действителни разходи."
    ],
    correctAnswer: "Разлика между изработена стойност и действителни разходи.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Каква е формулата за Cost variance-CV?",
    choices: [
      "BCWP(Budgeted Cost of Work Performed) - ACWP(Actual Cost of Work Performed)",
      "ACWP(Actual Cost of Work Performed) - BCWS(Budgeted Cost of Work Performed)"
    ],
    correctAnswer: "BCWP(Budgeted Cost of Work Performed) - ACWP(Actual Cost of Work Performed)",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво измерва SV (Schedule Variance)?",
    choices: [
      "Разлика между действителни и планирани разходи.",
      "Разлика между изработена стойност и планирани разходи."
    ],
    correctAnswer: "Разлика между изработена стойност и планирани разходи.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Каква е формулата за SV?",
    choices: [
      "BCWP - BCWS",
      "ACWP - BCWP"
    ],
    correctAnswer: "BCWP - BCWS",
    imageURL: ""
  },
  {
    index: 13,
    question: "Какво представлява BAC (Budget At Completion)?",
    choices: [
      "Изчислена текуща стойност.",
      "Планиран бюджет за завършване на проекта."
    ],
    correctAnswer: "Планиран бюджет за завършване на проекта.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво представлява EAC (Estimate At Completion)?",
    choices: [
      "Действителни разходи за етап от проекта.",
      "Очакван бюджет за завършване на проекта."
    ],
    correctAnswer: "Очакван бюджет за завършване на проекта.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Как се изчислява EAC - Estimate At Completion(Очакван Бюджет за завършване на проекта)  ?",
    choices: [
      "(ACWP / BCWP) * BAC",
      "BCWP - ACWP"
    ],
    correctAnswer: "(ACWP / BCWP) * BAC",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво показва зеленият статус на проекта?",
    choices: [
      "Проектът има закъснение.",
      "Проектът се изпълнява по план."
    ],
    correctAnswer: "Проектът се изпълнява по план.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Какво е основен проблем при софтуерни проекти?",
    choices: [
      "Чести промени в екипа.",
      "Незабелязано увеличаване на обхвата."
    ],
    correctAnswer: "Незабелязано увеличаване на обхвата.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какъв е проблемът с '99% завършване'?",
    choices: [
      "Задачата се завършва прекалено рано.",
      "Работата не се завършва реално, въпреки че се докладва почти завършена."
    ],
    correctAnswer: "Работата не се завършва реално, въпреки че се докладва почти завършена.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Какво представлява толеранс в изпълнението?",
    choices: [
      "Допустимо отклонение във времето за завършване на задачи.",
      "Допустимо отклонение в бюджета.",

    ],
    correctAnswer: "Допустимо отклонение във времето за завършване на задачи.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Кое е решение при големи отклонения в обхвата?",
    choices: [
      "Промяна на ръководителя на проекта.",
      "Преоценка на обхвата и процедура за управление на промените."
    ],
    correctAnswer: "Преоценка на обхвата и процедура за управление на промените.",
    imageURL: ""
  }

]