export const mysql11 = [
  {
    index: 1,
    question: "Коя е основната ценност в Agile подхода?",
    choices: [
      "Процеси и инструменти преди хората",
      "Индивиди и взаимодействия преди процеси и инструменти"
    ],
    correctAnswer: "Индивиди и взаимодействия преди процеси и инструменти",
    imageURL: ""
  },
  {
    index: 2,
    question: "Кой е основният критерий за напредъка в Agile проект?",
    choices: [
      "Изчерпателна документация",
      "Работещ софтуер"
    ],
    correctAnswer: "Работещ софтуер",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какво е времетраенето на една Agile итерация?",
    choices: [
      "От 2 до 4 седмици",
      "От 6 до 12 месеца"
    ],
    correctAnswer: "От 2 до 4 седмици",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кое е по-важно в Agile?",
    choices: [
      "Следване на плана",
      "Адаптация към промени"
    ],
    correctAnswer: "Адаптация към промени",
    imageURL: ""
  },
  {
    index: 5,
    question: "Кой трябва да извършва оценка на задачите в Agile?",
    choices: [
      "Мениджърите",
      "Хората, които ще изпълняват задачите"
    ],
    correctAnswer: "Хората, които ще изпълняват задачите",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво отличава Agile от традиционните подходи?",
    choices: [
      "Линейно изпълнение на проектните етапи",
      "Итеративно развитие и постоянна обратна връзка"
    ],
    correctAnswer: "Итеративно развитие и постоянна обратна връзка",
    imageURL: ""
  },
  {
    index: 7,
    question: "Как Agile третира документацията?",
    choices: [
      "Фокус върху пълна документация",
      "Фокус върху работещ софтуер, документацията е второстепенна"
    ],
    correctAnswer: "Фокус върху работещ софтуер, документацията е второстепенна",
    imageURL: ""
  },
  {
    index: 8,
    question: "Кога е подходящо да се използва Agile?",
    choices: [
      "При ясно дефинирани и неизменни изисквания",
      "При неясни изисквания и нужда от адаптация"
    ],
    correctAnswer: "При неясни изисквания и нужда от адаптация",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво означава „скорост на изгаряне“ в Agile?",
    choices: [
      "Колко документация е създадена",
      "Колко време/ресурси са нужни за реализиране на итерации"
    ],
    correctAnswer: "Колко време/ресурси са нужни за реализиране на итерации",
    imageURL: ""
  },
  {
    index: 10,
    question: "Кое е вярно за Scrum?",
    choices: [
      "Не е част от Agile",
      "Е методология, част от Agile подхода"
    ],
    correctAnswer: "Е методология, част от Agile подхода",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какви са предпочитаните комуникации в Agile?",
    choices: [
      "По имейл",
      "Лице в лице"
    ],
    correctAnswer: "Лице в лице",
    imageURL: ""
  },
  {
    index: 12,
    question: "Кой сертифицира Scrum Master-и?",
    choices: [
      "Scrum Alliance и Scrum.org",
      "Microsoft и Oracle"
    ],
    correctAnswer: "Scrum Alliance и Scrum.org",
    imageURL: ""
  },
  {
    index: 13,
    question: "Как Agile подходът се справя с дефекти?",
    choices: [
      "Чрез анализ и предложения за подобрения",
      "Чрез игнориране на дефектите до края на проекта"
    ],
    correctAnswer: "Чрез анализ и предложения за подобрения",
    imageURL: ""
  },
  {
    index: 14,
    question: "Кой трябва да участва активно в планирането в Agile?",
    choices: [
      "Само мениджърите",
      "Разработчиците, които ще вършат работата"
    ],
    correctAnswer: "Разработчиците, които ще вършат работата",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво се насърчава от гъвкавите процеси?",
    choices: [
      "Бързото преминаване през фазите на проекта",
      "Устойчиво развитие"
    ],
    correctAnswer: "Устойчиво развитие",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какъв трябва да бъде екипът според Agile принципите?",
    choices: [
      "Самоорганизиращ се и мотивиран",
      "Подчинен на строга йерархия"
    ],
    correctAnswer: "Самоорганизиращ се и мотивиран",
    imageURL: ""
  },
  {
    index: 17,
    question: "Как се оценява функционалността в Agile?",
    choices: [
      "На базата на финален отчет",
      "На базата на всяка итерация"
    ],
    correctAnswer: "На базата на всяка итерация",
    imageURL: ""
  },
  {
    index: 18,
    question: "Кога Agile не е подходящ?",
    choices: [
      "Когато проектът е динамичен",
      "Когато има фиксиран бюджет и изисквания"
    ],
    correctAnswer: "Когато има фиксиран бюджет и изисквания",
    imageURL: ""
  },
  {
    index: 19,
    question: "Как Agile се справя с чести промени в бизнес изискванията?",
    choices: [
      "Игнорира ги до следващата фаза",
      "Позволява адаптация и корекция на приоритетите"
    ],
    correctAnswer: "Позволява адаптация и корекция на приоритетите",
    imageURL: ""
  },
  {
    index: 20,
    question: "Как се реализира непрекъснатото усъвършенстване в Agile?",
    choices: [
      "С годишен одит",
      "С редовен екипен анализ и самонастройка"
    ],
    correctAnswer: "С редовен екипен анализ и самонастройка",
    imageURL: ""
  }
]
