export const mysql4 = [
  {
    index: 1,
    question: "Какво представлява инженерингът на изискванията?",
    choices: [
      "Процес на тестване на софтуер.",
      "Процес на установяване на услуги и ограничения на системата."
    ],
    correctAnswer: "Процес на установяване на услуги и ограничения на системата.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво е изискване в контекста на софтуерното инженерство?",
    choices: [
      "Инструкция за програмиране.",
       "Описание на системните функции и характеристики."
    ],
    correctAnswer: "Описание на системните функции и характеристики.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какви са видовете изисквания?",
    choices: [
      "Функционални, нефункционални и приложни.",
      "Структурирани и неструктурирани."
    ],
    correctAnswer: "Функционални, нефункционални и приложни.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кои са характеристиките на добрите изисквания?",
    choices: [
      "Прости и кратки.",
      "Пълни и консистентни.",
    ],
    correctAnswer: "Пълни и консистентни.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво определят функционалните изисквания?",
    choices: [
      "Услугите, които системата трябва да предоставя.",
      "Ограничения върху процеса на разработка."
    ],
    correctAnswer: "Услугите, които системата трябва да предоставя.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво представляват нефункционалните изисквания?",
    choices: [
      "Описание на услугите на системата.",
      "Ограничения върху услугите или функционалността на системата."
    ],
    correctAnswer: "Ограничения върху услугите или функционалността на системата.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Как се описват потребителските изисквания?",
    choices: [
      "С естествен език, таблици и диаграми.",
      "Само чрез технически спецификации."
    ],
    correctAnswer: "С естествен език, таблици и диаграми.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Кой стандарт е полезен за спецификация на изискванията?",
    choices: [
      "HTML стандарт.",
       "IEEE стандарт.",
    ],
    correctAnswer: "IEEE стандарт.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какви са примерите за нефункционални изисквания?",
    choices: [
      "Време за отговор и надежност.",
      "Типът на базата данни."
    ],
    correctAnswer: "Време за отговор и надежност.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Кои са типовете интерфейси в изискванията?",
    choices: [  
      "Технически и потребителски.",
       "Процедурни, данни и представяне на данни.",
    ],
    correctAnswer: "Процедурни, данни и представяне на данни.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво означава консистентност на изискванията?",
    choices: [
      "Да няма конфликти или противоречия между описанията.",
      "Да се описват на ясен и кратък език."
    ],
    correctAnswer: "Да няма конфликти или противоречия между описанията.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какви са основните цели на изискванията?",
    choices: [
      "Разпределяне на ресурсите за разработка.",
      "Определяне на стойността и функционалността на системата.",
    ],
    correctAnswer: "Определяне на стойността и функционалността на системата.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Каква е ролята на графичните модели в изискванията?",
    choices: [
      "Да илюстрират промени в състоянията или последователности от действия.",
      "Да заменят текстовите описания на изискванията."
    ],
    correctAnswer: "Да илюстрират промени в състоянията или последователности от действия.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какви са проблемите при използването на естествен език за описване на изисквания?",
    choices: [
      "Прекалена точност и сложност.",
       "Неточност и липса на модуларност.",
    ],
    correctAnswer: "Неточност и липса на модуларност.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Как се категоризират нефункционалните изисквания?",
    choices: [
      "Продуктови, организационни и външни.",
      "Функционални и структурни."
    ],
    correctAnswer: "Продуктови, организационни и външни.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво представлява спецификацията на софтуерните изисквания?",
    choices: [
      "Технически документ за дизайна на системата.",
       "Официално становище за това какво трябва да бъде разработено.",
    ],
    correctAnswer: "Официално становище за това какво трябва да бъде разработено.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Кои са потребителите на спецификацията на изискванията?",
    choices: [
      "Системни инженери, тест инженери и мениджъри.",
      "Маркетинг специалисти."
    ],
    correctAnswer: "Системни инженери, тест инженери и мениджъри.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какви са мерките за оценка на нефункционалните изисквания?",
    choices: [
      "Скорост, надежност и преносимост.",
      "Време за разработка и цена."
    ],
    correctAnswer: "Скорост, надежност и преносимост.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Какво е предназначението на системните изисквания?",
    choices: [
      "Да описват как да бъде написан кодът.",
       "Да служат като основа за дизайна на системата.",
    ],
    correctAnswer: "Да служат като основа за дизайна на системата.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Какво означава 'пълни изисквания'?",
    choices: [
      "Да включват описание на всички изисквани функции.",
      "Да бъдат кратки и лесни за четене."
    ],
    correctAnswer: "Да включват описание на всички изисквани функции.",
    imageURL: ""
  }
];
