export const mysql4 = [
  {
    index: 1,
    question: "Какво характеризира класическата функционална организация?",
    choices: [
      "Всеки служител има няколко ръководителя.",
      "Всеки служител има един точно определен ръководител."
    ],
    correctAnswer: "Всеки служител има един точно определен ръководител.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Как се разпределя персоналът в класическата функционална организация?",
    choices: [
         "По функционални области като маркетинг, финанси, ИТ.",
      "По проектни тимове.",
   
    ],
    correctAnswer: "По функционални области като маркетинг, финанси, ИТ.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какъв е основният принцип на проектно-ориентираната организация?",
    choices: [
      "Всички работници са членове на проектни тимове.",
      "Всички работници работят в една дирекция."
    ],
    correctAnswer: "Всички работници са членове на проектни тимове.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кой ръководи проектите в проектно-ориентираните организации?",
    choices: [
      "Функционалните мениджъри.",
      "Ръководителите на проекти (РП)."
    ],
    correctAnswer: "Ръководителите на проекти (РП).",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво представляват матричните организации?",
    choices: [
      "Комбинират характеристики на функционални и проектно-ориентирани организации.",
      "Изцяло разчитат на проектни тимове."
    ],
    correctAnswer: "Комбинират характеристики на функционални и проектно-ориентирани организации.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Каква е ролята на РП в слаба матрица?",
    choices: [
      "Повече като координатор на проекта.",
      "Пълна власт над проекта."
    ],
    correctAnswer: "Повече като координатор на проекта.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какви са характеристиките на силната матрица?",
    choices: [
      "РП имат малки или никакви пълномощия.",
      "РП имат значителни пълномощия и персонал по администрация на проекта."
    ],
    correctAnswer: "РП имат значителни пълномощия и персонал по администрация на проекта.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Каква е основната функция на офиса на проекта?",
    choices: [
      "Осигурява последователност и информация за управлението на проекта.",
      "Разпределя ресурсите между проектите."
    ],
    correctAnswer: "Осигурява последователност и информация за управлението на проекта.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Кой ръководи офиса за управление на проекти в една организация?",
    choices: [
      "Финансовият директор.",
      "Директор или вицепрезидент по управление на проекти."
    ],
    correctAnswer: "Директор или вицепрезидент по управление на проекти.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво представлява програмата от проекти?",
    choices: [
      "Набор от несвързани проекти.",
      "Набор от свързани проекти и задачи."
    ],
    correctAnswer: "Набор от свързани проекти и задачи.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Каква е основната роля на офиса за управление на проекти?",
    choices: [
      "Осигурява управление и контрол на всички проекти в организацията.",
      "Работи само по един конкретен проект."
    ],
    correctAnswer: "Осигурява управление и контрол на всички проекти в организацията.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво представлява портфолиото от проекти?",
    choices: [
      "Група от свързани проекти и програми.",
      "Група от проекти, които може да не са свързани, но използват общи ресурси."
    ],
    correctAnswer: "Група от проекти, които може да не са свързани, но използват общи ресурси.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Коя е една от основните функции на офиса за управление на проекти?",
    choices: [
      "Организира обучението по управление на проекти.",
      "Разпределя заплатите в организацията."
    ],
    correctAnswer: "Организира обучението по управление на проекти.",
    imageURL: ""
  }
  
];
