export const mysql12 = [
  {
    index: 11,
    question: "Кой е основният фокус на фазата \"Blueprint\" във внедрителната методология SAP ASAP?",
    choices: [
      "Създаване на техническа архитектура",
      "Дефиниране на бизнес процеси и изисквания",
      "Тестване на системата",
      "Обучение на потребителите"
    ],
    correctAnswer: "Дефиниране на бизнес процеси и изисквания",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво означава съкращението OUM в контекста на Oracle?",
    choices: [
      "Oracle Universal Method",
      "Oracle Unified Modeling",
      "Oracle Unified Method",
      "Oracle Usability Management"
    ],
    correctAnswer: "Oracle Unified Method",
    imageURL: ""
  },
  {
    index: 13,
    question: "Каква е ролята на \"gap analysis\" в процеса на внедряване на ERP?",
    choices: [
      "Идентифициране на нуждите за обучение",
      "Определяне на разликите между текущите и целевите бизнес процеси",
      "Оценка на софтуерната производителност",
      "Анализ на конкуренцията"
    ],
    correctAnswer: "Определяне на разликите между текущите и целевите бизнес процеси",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какъв е резултатът от фазата “Realization” в SAP ASAP?",
    choices: [
      "Обучени крайни потребители",
      "Подробно описание на бизнес процесите",
      "Конфигурирана и тествана ERP система",
      "Бизнес казус за внедряване"
    ],
    correctAnswer: "Конфигурирана и тествана ERP система",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво включва фазата “Transition” в Oracle OUM?",
    choices: [
      "Поддръжка след внедряване",
      "Определяне на стратегия за внедряване",
      "Подготовка за продуктивна среда",
      "Анализ на нуждите на клиента"
    ],
    correctAnswer: "Подготовка за продуктивна среда",
    imageURL: ""
  },
  {
    index: 16,
    question: "Кое от следните НЕ е типична стъпка в ASAP методологията?",
    choices: [
      "Project Preparation",
      "Business Blueprint",
      "Realization",
      "Regression Forecasting"
    ],
    correctAnswer: "Regression Forecasting",
    imageURL: ""
  },
  {
    index: 17,
    question: "Коя е основната цел на прототипирането по време на внедряване на ERP?",
    choices: [
      "Тестване на потребителски интерфейс",
      "Показване на бъдещата функционалност и събиране на обратна връзка",
      "Изграждане на пълна система",
      "Симулация на пазарна стратегия"
    ],
    correctAnswer: "Показване на бъдещата функционалност и събиране на обратна връзка",
    imageURL: ""
  },
  {
    index: 18,
    question: "Кой от следните етапи е част от Oracle OUM?",
    choices: [
      "Analyze",
      "Blueprint",
      "Execute",
      "Build"
    ],
    correctAnswer: "Analyze",
    imageURL: ""
  },
  {
    index: 19,
    question: "Каква е ролята на “Project Manager” при внедряване на ERP с помощта на методология?",
    choices: [
      "Осъществяване на техническата конфигурация",
      "Обучение на потребители",
      "Координация, планиране и управление на риска",
      "Тестове на системата"
    ],
    correctAnswer: "Координация, планиране и управление на риска",
    imageURL: ""
  },
  {
    index: 20,
    question: "Кое от изброените е предимство на използването на методологии като ASAP и OUM при внедряване на ERP?",
    choices: [
      "По-бавен процес с повече проверки",
      "Гаранция за 100% успех",
      "Стандартизиране на внедрителния процес",
      "Намаляване на нуждата от обучение"
    ],
    correctAnswer: "Стандартизиране на внедрителния процес",
    imageURL: ""
  }
]