export const mysql4 = [
  {
    index: 1,
    question: "Какво характеризира класическата функционална организация?",
    choices: [
      "Всеки служител има няколко ръководителя.",
      "Всеки служител има един точно определен ръководител."
    ],
    correctAnswer: "Всеки служител има един точно определен ръководител.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Как се разпределя персоналът в класическата функционална организация?",
    choices: [
      "По функционални области като маркетинг, финанси, ИТ.",
      "По проектни тимове.",

    ],
    correctAnswer: "По функционални области като маркетинг, финанси, ИТ.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какъв е основният принцип на проектно-ориентираната организация?",
    choices: [
      "Всички работници са членове на проектни тимове.",
      "Всички работници работят в една дирекция."
    ],
    correctAnswer: "Всички работници са членове на проектни тимове.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Кой ръководи проектите в проектно-ориентираните организации?",
    choices: [
      "Функционалните мениджъри.",
      "Ръководителите на проекти (РП)."
    ],
    correctAnswer: "Ръководителите на проекти (РП).",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво представляват матричните организации?",
    choices: [
      "Комбинират характеристики на функционални и проектно-ориентирани организации.",
      "Изцяло разчитат на проектни тимове."
    ],
    correctAnswer: "Комбинират характеристики на функционални и проектно-ориентирани организации.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Каква е ролята на РП в слаба матрица?",
    choices: [
      "Повече като координатор на проекта.",
      "Пълна власт над проекта."
    ],
    correctAnswer: "Повече като координатор на проекта.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какви са характеристиките на силната матрица?",
    choices: [
      "РП имат малки или никакви пълномощия.",
      "РП имат значителни пълномощия и персонал по администрация на проекта."
    ],
    correctAnswer: "РП имат значителни пълномощия и персонал по администрация на проекта.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Каква е основната функция на офиса на проекта?",
    choices: [
      "Осигурява последователност и информация за управлението на проекта.",
      "Разпределя ресурсите между проектите."
    ],
    correctAnswer: "Осигурява последователност и информация за управлението на проекта.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Кой ръководи офиса за управление на проекти в една организация?",
    choices: [
      "Финансовият директор.",
      "Директор или вицепрезидент по управление на проекти."
    ],
    correctAnswer: "Директор или вицепрезидент по управление на проекти.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво представлява програмата от проекти?",
    choices: [
      "Набор от несвързани проекти.",
      "Набор от свързани проекти и задачи."
    ],
    correctAnswer: "Набор от свързани проекти и задачи.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Каква е основната роля на офиса за управление на проекти?",
    choices: [
      "Осигурява управление и контрол на всички проекти в организацията.",
      "Работи само по един конкретен проект."
    ],
    correctAnswer: "Осигурява управление и контрол на всички проекти в организацията.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво представлява портфолиото от проекти?",
    choices: [
      "Група от свързани проекти и програми.",
      "Група от проекти, които може да не са свързани, но използват общи ресурси."
    ],
    correctAnswer: "Група от проекти, които може да не са свързани, но използват общи ресурси.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Коя е една от основните функции на офиса за управление на проекти?",
    choices: [
      "Организира обучението по управление на проекти.",
      "Разпределя заплатите в организацията."
    ],
    correctAnswer: "Организира обучението по управление на проекти.",
    imageURL: ""
  },

  {
    index: 14,
    question: "Когато проектите се изпълняват обикновено в рамките на една дирекция или функция е характерно за:",
    choices: [
      "Матрична организация",
      "Проектно ориентирана организация",
      "Йерархична организация",
      "Функционална организация"
    ],
    correctAnswer: "Функционална организация",
    imageURL: ""
  },
  {
    index: 15,
    question: "Кой от изброените по-долу обикновено може да не е участник в ИТ проекта (project stakeholder):",
    choices: [
      "Инженер по контрола на качеството на проекта",
      "Системен администратор на проекта от страна на клиента",
      "Главният финансов инспектор на спонсора на проекта",
      "Софтуерният уеб дизайнер на фирмата изпълнител"
    ],
    correctAnswer: "Софтуерният уеб дизайнер на фирмата изпълнител",
    imageURL: ""
  },
  {
    index: 16,
    question: "Коя от следните области не е реализация на ролята на РП:",
    choices: [
      "Отговорности",
      "Предизвикателства",
      "Умения",
      "Морал"
    ],
    correctAnswer: "Морал",
    imageURL: ""
  },
  {
    index: 17,
    question: "По време на закриването на проекта, трябва да се анализира какво е направено с цел да се използва наученото в следващи проекти. Начин да се изпълни тази задача е да се направи:",
    choices: [
      "Подготви оценка на качеството на завършения проект",
      "Да се направи доклад за завършване на проекта и оценка на реализацията на продукта",
      "Да се подготви анализ на научените уроци",
      "Потребителят да приеме крайния резултат"
    ],
    correctAnswer: "Да се подготви анализ на научените уроци",
    imageURL: ""
  },
  {
    index: 18,
    question: "Адекватното решение при реализация на комуникационния план в мултинационален екип е:",
    choices: [
      "Избор на стандартната медия използвана при предишни проекти",
      "Използване на множество медии за да си сигурен, че всички ще получат информацията",
      "Дискутирай различните медии с участниците в проекта и вземи техните мнения",
      "Изискай допълнително финансиране и разработи собствена комуникационна инфраструктура"
    ],
    correctAnswer: "Дискутирай различните медии с участниците в проекта и вземи техните мнения",
    imageURL: ""
  },
  {
    index: 19,
    question: "Участниците в проекта (Project Stakeholders):",
    choices: [
      "Не могат да оказват влияние на проекта",
      "Не трябва да оказват влияние на проекта",
      "Могат да оказват влияние на проекта",
      "Могат и трябва да оказват влияние на проекта"
    ],
    correctAnswer: "Могат да оказват влияние на проекта",
    imageURL: ""
  },
  {
    index: 20,
    question: "Срокът за откупуване (Payback period) е:",
    choices: [
      "Критерий за оценка на паричния поток",
      "Финансов критерий за оценка на риска",
      "Критерий за възвращаемост",
      "Отношение на приходите към разходите"
    ],
    correctAnswer: "Критерий за възвращаемост",
    imageURL: ""
  },
  {
    index: 21,
    question: "По време на __________ се идентифицират нуждите и се защитава идеята пред клиента:",
    choices: [
      "Планиране на проекта",
      "Организация на проекта",
      "Инициализация на проекта",
      "Изпълнение на проекта"
    ],
    correctAnswer: "Инициализация на проекта",
    imageURL: ""
  },
  {
    index: 22,
    question: "Основните ограничители на проекта са:",
    choices: [
      "Време, ресурси, разходи",
      "Качество, време, ресурси",
      "Качество, обхват, разходи",
      "Разходи, обхват, време"
    ],
    correctAnswer: "Разходи, обхват, време",
    imageURL: ""
  },
  {
    index: 23,
    question: "Проектът е:",
    choices: [
      "Нова разработка с голям обхват и детайлен план",
      "Група от фази, координирани и управлявани за постигане на определена цел",
      "Временно начинание с цел да се създаде уникален продукт или услуга",
      "Група от планирани задачи с определено начало и край"
    ],
    correctAnswer: "Временно начинание с цел да се създаде уникален продукт или услуга",
    imageURL: ""
  },
  {
    index: 24,
    question: "Характеристика на фазите на проекта е:",
    choices: [
      "Контролни точки (milestones)",
      "Качествено изпълнение на фазите на проекта",
      "План на фаза на проекта",
      "Доставките по проекта"
    ],
    correctAnswer: "Контролни точки (milestones)",
    imageURL: ""
  },
  {
    index: 25,
    question: "Спонсорът на проекта е:",
    choices: [
      "Организацията която използва продукта",
      "Хората които създават продукта",
      "Организацията която осигурява финансирането по проекта",
      "Никоя от изброените по горе"
    ],
    correctAnswer: "Организацията която осигурява финансирането по проекта",
    imageURL: ""
  },
  {
    index: 26,
    question: "Необходимата работа по проекта се описва в:",
    choices: [
      "Обхвата на проекта",
      "Целта на проекта",
      "Основните резултати",
      "Графика на проекта"
    ],
    correctAnswer: "Обхвата на проекта",
    imageURL: ""
  },
  {
    index: 27,
    question: "Не е пример за проект:",
    choices: [
      "Създаване на софтуерен продукт",
      "Провеждане на конференция",
      "Управление на ИТ отдел",
      "Закупуване на хардуер"
    ],
    correctAnswer: "Управление на ИТ отдел",
    imageURL: ""
  },
  {
    index: 28,
    question: "С ____________ приключва инициализацията на проекта:",
    choices: [
      "Списък на задачите",
      "Формалното одобрение",
      "Избор на алтернативите",
      "Дефиниция на основния екип"
    ],
    correctAnswer: "Дефиниция на основния екип",
    imageURL: ""
  },
  {
    index: 29,
    question: "Отговорността да гарантира, че няма конфликт на интереси при изпълнение на неговите задължения е част от:",
    choices: [
      "Уменията на РП",
      "Управлението на проекта",
      "Отношенията със спонсора",
      "Професионалната етика и отговорност на РП"
    ],
    correctAnswer: "Професионалната етика и отговорност на РП",
    imageURL: ""
  },
  {
    index: 30,
    question: "Чрез ____________ се избират най-добрите алтернативи за достигане на целите на проекта:",
    choices: [
      "Матрица на решенията",
      "Дефиниция на обхвата",
      "Определяне на финансови критерии",
      "Планиране на оптималното решение"
    ],
    correctAnswer: "Матрица на решенията",
    imageURL: ""
  },
  {
    index: 31,
    question: "_________ оторизира стартиране на проект или фаза от проекта:",
    choices: [
      "Обявяването на конкурс",
      "Инициализацията",
      "Планирането",
      "Определянето на доставките"
    ],
    correctAnswer: "Инициализацията",
    imageURL: ""
  },
  {
    index: 32,
    question: "Проектът се реализира за да:",
    choices: [
      "Да се постигне определена полза за потребителя",
      "Да се създаде планирания продукт или услуга",
      "Продуктът да се изпълни в срок и качествено",
      "Да се реализира в рамките на определения бюджет"
    ],
    correctAnswer: "Да се постигне определена полза за потребителя",
    imageURL: ""
  },
  {
    index: 33,
    question: "Проектите трябва да са изцяло подчинени на реализацията на:",
    choices: [
      "Технологични цели",
      "Бизнес цели",
      "Морални цели",
      "Финансови цели"
    ],
    correctAnswer: "Бизнес цели",
    imageURL: ""
  },
  {
    index: 34,
    question: "Общият мениджмънт включва всичко с изключение на:",
    choices: [
      "Създаване на нов продукт или услуга",
      "Планиране и организация",
      "Управление на човешките ресурси",
      "Изпълнение на решения и контрол на операциите"
    ],
    correctAnswer: "Създаване на нов продукт или услуга",
    imageURL: ""
  },
  {
    index: 35,
    question: "Ако директорът на дирекцията възлага задачи по проекта на лидера на проекта, какъв тип е организацията изпълнител?",
    choices: [
      "Балансирана",
      "Функционална",
      "Силна Матрица",
      "Проектно ориентирана"
    ],
    correctAnswer: "Функционална",
    imageURL: ""
  },
  {
    index: 36,
    question: "Проектът се намира във фаза Инициализация. РП трябва да идентифицира оптималното решение и да го предложи на спонсора. Кой метод ще използва:",
    choices: [
      "EV",
      "ADM",
      "CPM",
      "NPV"
    ],
    correctAnswer: "NPV",
    imageURL: ""
  },
  {
    index: 37,
    question: "За формалното стартиране на проекта не е необходимо да има:",
    choices: [
      "Формално одобрение на проекта",
      "Детайлен план на проекта",
      "Избор на оптимално решение",
      "Обща оценка на разходи и инвестиции"
    ],
    correctAnswer: "Детайлен план на проекта",
    imageURL: ""
  },
  {
    index: 38,
    question: "NPV изчислява:",
    choices: [
      "Нетна сегашна стойност",
      "Сегашна стойност на парите",
      "Норма на печалбата",
      "Срок за откупуване"
    ],
    correctAnswer: "Нетна сегашна стойност",
    imageURL: ""
  },
  {
    index: 39,
    question: "Преговорите с участниците на мултинационални проекти може да е много сложна задача. Успешното решаване трябва да се извършва с:",
    choices: [
      "Повишено внимание в екипа",
      "Фокус върху текущите задачи на екипа",
      "Фокус върху различията в екипа",
      "Притеснение за бъдещето на проекта"
    ],
    correctAnswer: "Фокус върху текущите задачи на екипа",
    imageURL: ""
  },
  {
    index: 40,
    question: "Какво е PRINCE:",
    choices: [
      "Основна роля в проекта",
      "Основна отговорност в проекта",
      "Метод за оценка на проекти",
      "Структурен метод за ефективно управление на проекти"
    ],
    correctAnswer: "Структурен метод за ефективно управление на проекти",
    imageURL: ""
  },
  {
    index: 41,
    question: "Кога се инициализира един проект:",
    choices: [
      "Когато се разбере проблема и се идентифицира истинската нужда",
      "Когато се осигури необходимото финансиране",
      "Когато се планират задачите и дейностите",
      "Когато се дефинира идеята"
    ],
    correctAnswer: "Когато се разбере проблема и се идентифицира истинската нужда",
    imageURL: ""
  },
  {
    index: 42,
    question: "Оценката на изискванията при планиране на обхвата на ИТ проекти е сложен процес, който се реализира по следния начин:",
    choices: [
      "Внимателен анализ на изискванията и оценка на всяко едно от тях",
      "Бърз преглед и приблизителна оценка",
      "Няма нужда от губене на време за анализ, оценката е на база на наличните ресурси",
      "Каквато и да е оценка, после ще видим, в процеса на работа ще я уточняваме"
    ],
    correctAnswer: "Внимателен анализ на изискванията и оценка на всяко едно от тях",
    imageURL: ""
  },
  {
    index: 43,
    question: "Какво е RAM?",
    choices: [
      "Връзка между спонсора и екипа на проекта",
      "Връзка между задачи, участници в проекта и техните отговорности",
      "Връзка между задачите и разходите в проекта",
      "Връзка между екипа и времето за изпълнение на задачите"
    ],
    correctAnswer: "Връзка между задачи, участници в проекта и техните отговорности",
    imageURL: ""
  }



];
