export const mysql7 = [
  {
    index: 1,
    question: "Какво моделира диаграмата на състояния (Statechart Diagram)?",
    choices: [
      "Моделира поведението на един обект, като показва последователността от състояния, през които обектът преминава по време на своя живот.",
      "Моделира взаимодействията между обектите в системата.",
    ],
    correctAnswer: "Моделира поведението на един обект, като показва последователността от състояния, през които обектът преминава по време на своя живот.",
    imageURL: ""
  },
  {
    index: 2,
    question: "Какво представлява началното състояние в диаграмата на състояния?",
    choices: [
      "Показва завършването на процеса.",
      "Показва началото на работния поток или началото на събитията, които причиняват преход.",
    ],
    correctAnswer: "Показва началото на работния поток или началото на събитията, които причиняват преход.",
    imageURL: ""
  },
  {
    index: 3,
    question: "Какво представлява крайното състояние в диаграмата на състояния?",
    choices: [
      "Показва началото на работния поток.",
      "Показва завършването на процеса.",
    ],
    correctAnswer: "Показва завършването на процеса.",
    imageURL: ""
  },
  {
    index: 4,
    question: "Какво представлява терминалното състояние в диаграмата на състояния?",
    choices: [
      "Показва началото на работния поток.",
       "Показва прекратяване на машината на състояния чрез унищожаване на контекстния обект.",
    ],
    correctAnswer: "Показва прекратяване на машината на състояния чрез унищожаване на контекстния обект.",
    imageURL: ""
  },
  {
    index: 5,
    question: "Какво представлява 'State Transition' в диаграмата на състояния?",
    choices: [
      "Обект в изходно състояние ще изпълни определени действия и ще влезе в целево състояние при настъпване на определено събитие или при изпълнение на определени условия.",
      "Показва връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Обект в изходно състояние ще изпълни определени действия и ще влезе в целево състояние при настъпване на определено събитие или при изпълнение на определени условия.",
    imageURL: ""
  },
  {
    index: 6,
    question: "Какво представлява действието в диаграмата на състояния?",
    choices: [ 
      "По-сложна колекция от поведения, която може да продължи дълго време и може да бъде прекъсната от събития.",
        "Отнема нулево време и не може да бъде прекъснато.",
    ],
    correctAnswer: "Отнема нулево време и не може да бъде прекъснато.",
    imageURL: ""
  },
  {
    index: 7,
    question: "Какво представлява активността в диаграмата на състояния?",
    choices: [
      "По-сложна колекция от поведения, която може да продължи дълго време и може да бъде прекъсната от събития.",
      "Отнема нулево време и не може да бъде прекъснато.",
    ],
    correctAnswer: "По-сложна колекция от поведения, която може да продължи дълго време и може да бъде прекъсната от събития.",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какво представляват вложените състояния (Composite/Nested States) в диаграмата на състояния?",
    choices: [
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
      "Състоянията могат да бъдат вложени на всякаква дълбочина.",
    ],
    correctAnswer: "Състоянията могат да бъдат вложени на всякаква дълбочина.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво представлява 'Shallow History Pseudostate' в диаграмата на състояния?",
    choices: [
      "Показва най-скорошната активна конфигурация на състоянието в композитно състояние.",
       "Показва най-скорошното активно подсъстояние на състоянието, в което се намира.",
    ],
    correctAnswer: "Показва най-скорошното активно подсъстояние на състоянието, в което се намира.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Какво представлява 'Deep History Pseudostate' в диаграмата на състояния?",
    choices: [
      "Показва най-скорошната активна конфигурация на състоянието в композитно състояние.",
      "Показва най-скорошното активно подсъстояние на състоянието, в което се намира.",
    ],
    correctAnswer: "Показва най-скорошната активна конфигурация на състоянието в композитно състояние.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво представлява 'Junction Pseudo-State' в диаграмата на състояния?",
    choices: [
      "Показва най-скорошното активно подсъстояние на състоянието, в което се намира.",
       "За свързване на множество преходи.",
    ],
    correctAnswer: "За свързване на множество преходи.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Какво моделират диаграмите на активности?",
    choices: [
      "Моделират работния процес или код.",
      "Моделират взаимодействията между обектите в системата.",
    ],
    correctAnswer: "Моделират работния процес или код.",
    imageURL: "https://circle.visual-paradigm.com/wp-content/uploads/2017/06/Activity-Diagram-ATM.png"
  },
  {
    index: 13,
    question: "Какво представлява активността в диаграмата на активности?",
    choices: [
      "Представлява изпълнение на задача или задължение в работния поток.",
      "Показва връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Представлява изпълнение на задача или задължение в работния поток.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Какво представляват преходите (Transitions) в диаграмата на активности?",
    choices: [
      "Показват завършването на действие или под-активност и последователността на действията/под-активностите.",
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Показват завършването на действие или под-активност и последователността на действията/под-активностите.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Какво представляват 'Swimlanes' в диаграмата на активности?",
    choices: [
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
      "Показват кой е отговорен за изпълнението на активност.",
    ],
    correctAnswer: "Показват кой е отговорен за изпълнението на активност.",
    imageURL: "https://circle.visual-paradigm.com/wp-content/uploads/2017/06/Activity-Diagram-ATM.png"
  },
  {
    index: 16,
    question: "Какво представляват възлите за решения (Decision nodes) в диаграмата на активности?",
    choices: [
      "Място, където работният поток може да се разклони въз основа на условия.",
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Място, където работният поток може да се разклони въз основа на условия.",
    imageURL: "https://www.visual-paradigm.com/servlet/editor-content/guide/uml-unified-modeling-language/about-state-diagrams/sites/7/2019/12/state-machine-diagram-explained.png"
  },
  {
    index: 17,
    question: "Какво представляват синхронизациите в диаграмата на активности?",
    choices: [
      "Показват паралелен работен поток чрез визуално дефиниране на разклонения (fork) и съединения (join).",
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Показват паралелен работен поток чрез визуално дефиниране на разклонения (fork) и съединения (join).",
    imageURL: "https://www.uml-diagrams.org/activity-diagrams/control-nodes-overview.png"
  },
  {
    index: 21,
    question: "Какво представлява диаграмата на преглед на взаимодействието (Interaction Overview Diagram)?",
    choices: [
      "Диаграма, която показва последователността от състояния, през които обектът преминава.",
      "Диаграма на дейности, която предоставя преглед на потока на управление.",
    ],
    correctAnswer: "Диаграма на дейности, която предоставя преглед на потока на управление.",
    imageURL: "https://svg.template.creately.com/j634oa3j4"
  },
  {
    index: 22,
    question: "Какво представляват рамките за взаимодействие в диаграмата на преглед на взаимодействието?",
    choices: [
      "Представят всякакъв тип диаграма на взаимодействие като sd (sequence), cd (communication), td (timing), iod.",
      "Показват връзките между обектите и съобщенията, които те си изпращат.",
    ],
    correctAnswer: "Представят всякакъв тип диаграма на взаимодействие като sd (sequence), cd (communication), td (timing), iod.",
    imageURL: "https://svg.template.creately.com/j634oa3j4"
  },
  {
    index: 23,
    question: "Какво представляват рамките за възникване на взаимодействие в диаграмата на преглед на взаимодействието?",
    choices: [
      "Показват най-скорошното активно подсъстояние на състоянието, в което се намира.",
      "Обозначават дейност или операция за извикване.",
    ],
    correctAnswer: "Обозначават дейност или операция за извикване.",
    imageURL: ""
  }

];
