export const mysql10 = [
  {
    index: 1,
    question: "Какво представлява слоестата архитектура в софтуерното проектиране?",
    choices: [
      "Модел за взаимодействие между клиенти и сървъри.",
      "Подредба на функционалността от най-общо ниво към по-специфично.",
    ],
    correctAnswer: "Подредба на функционалността от най-общо ниво към по-специфично.",
    imageURL: "https://www.oreilly.com/api/v2/epubs/9781491971437/files/assets/sapr_0101.png",
  },
  {
    index: 2,
    question: "Коя е основната цел на използването на архитектурни слоеве?",
    choices: [
      "Да се подобри сигурността на системата.",
      "Да се раздели функционалността според различни нива на приложение.",
    ],
    correctAnswer: "Да се раздели функционалността според различни нива на приложение.",
    imageURL: "https://www.interface.ru/rational/rup51/process/modguide/images/md_dsub.gif",
  },
  {
    index: 3,
    question: "Какво е основното предимство на MVC архитектурния стил?",
    choices: [
      "Позволява лесна поддръжка и бъдещи подобрения.",
      "Осигурява централизиран достъп до данни.",
    ],
    correctAnswer: "Позволява лесна поддръжка и бъдещи подобрения.",
    imageURL: "https://developer.mozilla.org/en-US/docs/Glossary/MVC/model-view-controller-light-blue.png",
  },
  {
    index: 4,
    question: "Каква е ролята на Repository-архитектурата?",
    choices: [
      "Осигурява лесно разширяване чрез добавяне на нови компоненти.",
      "Подобрява интерактивността на малки приложения.",
    ],
    correctAnswer: "Осигурява лесно разширяване чрез добавяне на нови компоненти.",
    imageURL: "https://www.tutorialspoint.com/software_architecture_design/images/data_centered_architecture.jpg",
  },
  {
    index: 5,
    question: "Какви са недостатъците на Pipe-and-Filter архитектурния стил?",
    choices: [
      "Усложнява управлението на връзките между клиенти и сървъри.",
      "Трудно се прилага в разпределена среда, при интерактивни приложения и има ниска продуктивност.",
    ],
    correctAnswer: "Трудно се прилага в разпределена среда, при интерактивни приложения и има ниска продуктивност.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20241003120154/Pipe-and-Filter-Architecture---System-Design-image.webp",
  },
  {
    index: 7,
    question: "Какво представлява под-система в софтуерната архитектура?",
    choices: [
      "Самостоятелен модул, който изпълнява специфична функция.",
      "Интерфейс за комуникация между приложения.",
    ],
    correctAnswer: "Самостоятелен модул, който изпълнява специфична функция.",
    imageURL: null,
  },
  {
    index: 8,
    question: "Какво е дизайн целта при проектиране на система?",
    choices: [
      "Добавяне на повече слоеве в архитектурата.",
      "Постигане на максимално слаба свързаност между компонентите.",
    ],
    correctAnswer: "Постигане на максимално слаба свързаност между компонентите.",
    imageURL: null,
  },
  {
    index: 9,
    question: "Кой тип модулна свързаност от изброените е най-слаб и най-желан?",
    choices: [
      "Internal Data Coupling - (най-силното, най-малко желателно) - един модул директно променя локалните данни на друг модул",
      "Global Data Coupling - два или повече модула споделят едни и същи глобални структури от данни",
      "Control Coupling - един модул контролира последователността на обработката в друг модул.",
      "Content Coupling - част или цялото съдържание на един модул е включено в съдържанието на друг",
      "Data Coupling - изход от един модул е вход към друг",
    ],
    correctAnswer: "Data Coupling - изход от един модул е вход към друг",
    imageURL: null,
  },
  {
    index: 10,
    question: "Кога дадена система има висока кохезия?",
    choices: [
      "Когато компонентите са взаимосвързани и изпълняват подобни задачи.",
      "Когато системата използва голям брой под-системи.",
    ],
    correctAnswer: "Когато компонентите са взаимосвързани и изпълняват подобни задачи.",
    imageURL: null,
  },
  {
    index: 11,
    question: "Какъв е примерът за ниска кохезия?",
    choices: [
      "Модул, който изпълнява една основна задача.",
      "Модул, който съдържа независими и несвързани обекти."
    ],
    correctAnswer: "Модул, който съдържа независими и несвързани обекти.",
    imageURL: null
},
{
    index: 12,
    question: "Какво представляват архитектурните слоеве?",
    choices: [
      "Начин за организиране на компоненти чрез слоеве с различна функционалност.",
      "Модел за създаване на потребителски интерфейс."
    ],
    correctAnswer: "Начин за организиране на компоненти чрез слоеве с различна функционалност.",
    imageURL: null
},
{
    index: 14,
    question: "Какво е пакет в UML?",
    choices: [
      "Спецификация за слоест модел.",
      "Колекция от диаграми, класове и компоненти."
    ],
    correctAnswer: "Колекция от диаграми, класове и компоненти.",
    imageURL: "https://cdn-images.visual-paradigm.com/guide/uml/what-is-package-diagram/08-package-diagram-order-subsystem.png"
},
{
    index: 15,
    question: "Какви са предимствата на Repository-архитектура?",
    choices: [
      "Мащабируемост, централизирано управление и лесно разширяване.",
      "Намалени разходи за разработка."
    ],
    correctAnswer: "Мащабируемост, централизирано управление и лесно разширяване.",
    imageURL: "https://www.syntouch.nl/wp-content/uploads/2017/04/enterprise_architecture_repository_0.jpg"
},
{
    index: 16,
    question: "Какви са недостатъците на Repository-архитектура?",
    choices: [
      "Трудно управление на локални данни.",
      "Сложна интеграция в разпределена среда."
    ],
    correctAnswer: "Сложна интеграция в разпределена среда.",
    imageURL: "https://www.tutorialspoint.com/software_architecture_design/images/data_centered_architecture.jpg"
},
{
    index: 19,
    question: "Какво представлява клиент-сървър архитектурата?",
    choices: [
      "Децентрализиран модел за обработка на данни.",
      "Модел, при който сървърът предоставя услуги на клиентите."
    ],
    correctAnswer: "Модел, при който сървърът предоставя услуги на клиентите.",
    imageURL: "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Client-server-model.svg/1280px-Client-server-model.svg.png"
},
{
    index: 20,
    question: "Коя е основната цел на Peer-to-Peer архитектурата?",
    choices: [
      "Централизирано управление на данните.",
      "Разпределено споделяне на ресурси между възлите."
    ],
    correctAnswer: "Разпределено споделяне на ресурси между възлите.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20220826190244/GFGP2PArchitecture.png"
},
{
    index: 21,
    question: "Какво представлява стилът Pipe-and-Filter?",
    choices: [
      "Модел за взаимодействие между клиенти и сървъри.",
      "Система, в която данните преминават през последователни филтри."
    ],
    correctAnswer: "Система, в която данните преминават през последователни филтри.",
    imageURL: null
},
{
    index: 22,
    question: "Кои са характеристиките на стил Pipe-and-Filter?",
    choices: [
      "Лесно разбиране, паралелност и гъвкавост.",
      "Централизирано управление на филтрите."
    ],
    correctAnswer: "Лесно разбиране, паралелност и гъвкавост.",
    imageURL: null
},
{
    index: 23,
    question: "Какво представлява документът за софтуерна архитектура?",
    choices: [
      "Подробен преглед на системната архитектура чрез различни изгледи.",
      "Описание на слоестата архитектура."
    ],
    correctAnswer: "Подробен преглед на системната архитектура чрез различни изгледи.",
    imageURL: null
},
{
    index: 24,
    question: "Какво е релационен модел?",
    choices: [
      "Модел, състоящ се от обекти и асоциации между тях.",
      "Система за съхранение на данни в таблици и релации между тях."
    ],
    correctAnswer: "Система за съхранение на данни в таблици и релации между тях.",
    imageURL: null
},
{
    index: 25,
    question: "Кoя кохезия е най-желана?",
    choices: [
      "Functional",
      "Sequence",
      "Procedural",
      "Temporal",
      "Logical",
      "Coincidentals"
    ],
    correctAnswer: "Functional",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240322154311/cohesion.png"
}

];