export const mysql11 = [
  {
    index: 1,
    question: "Какво представлява софтуерното инженерство според IEEE?",
    choices: [
      "Процес на автоматизация на разработката на софтуер.",
      "Систематичен, дисциплиниран и измерим подход към разработката, поддръжката и експлоатацията на софтуер.",
    ],
    correctAnswer: "Систематичен, дисциплиниран и измерим подход към разработката, поддръжката и експлоатацията на софтуер.",
    imageURL: null
  },
  {
    index: 2,
    question: "Какво описва жизненият цикъл на софтуерната разработка (SDLC)?",
    choices: [
      "Процес за дизайн, разработка и тестване на висококачествен софтуер.",
      "Метод за минимизиране на грешките в кода.",
    ],
    correctAnswer: "Процес за дизайн, разработка и тестване на висококачествен софтуер.",
    imageURL: "https://datarob.com/content/images/2019/08/SDLC-stages.png"
  },
  {
    index: 3,
    question: "Коя е целта на софтуерния процес?",
    choices: [
      "Да осигури лесна интеграция на хардуерни компоненти.",
      "Да достави софтуер навреме и с достатъчно високо качество.",
    ],
    correctAnswer: "Да достави софтуер навреме и с достатъчно високо качество.",
    imageURL: null
  },
  {
    index: 4,
    question: "Какво включва фазата 'Анализ' в софтуерната разработка?",
    choices: [
      "Създаване на тестови сценарии.",
      "Специфициране на функционалните способности и анализ на изискванията.",
    ],
    correctAnswer: "Специфициране на функционалните способности и анализ на изискванията.",
    imageURL: null
  },
  {
    index: 5,
    question: "Каква е ролята на UML диаграмите в домейновия анализ?",
    choices: [
      "Да описват потребителски интерфейси.",
      "Да моделират концепции и отношения, важни за клиента.",
    ],
    correctAnswer: "Да моделират концепции и отношения, важни за клиента.",
    imageURL: null
  },
  {
    index: 6,
    question: "Какво е основната цел на фазата 'Интеграция'?",
    choices: [
      "Да се комбинират компонентите в работеща система.",
      "Да се създаде документация за потребителите.",
    ],
    correctAnswer: "Да се комбинират компонентите в работеща система.",
    imageURL: null
  },
  {
    index: 7,
    question: "Какво описва 'Черната кутия' при тестването на софтуер?",
    choices: [
      "Тестване, базирано на познаване на вътрешната структура на системата.",
      "Тестване, базирано на външните спецификации на софтуера.",
    ],
    correctAnswer: "Тестване, базирано на външните спецификации на софтуера.",
    imageURL: "https://figures.semanticscholar.org/5555a96b0d809a512a1d47bcd9eaacabcec842cb/2-Figure1-1.png"
  },
  {
    index: 8,
    question: "Какво представлява 'Итеративният' подход при разработка на софтуер?",
    choices: [
      "Последователно добавяне на нови функции чрез цикли от планиране, анализ и тестване.",
      "Създаване на цялата система наведнъж.",
    ],
    correctAnswer: "Последователно добавяне на нови функции чрез цикли от планиране, анализ и тестване.",
    imageURL: "https://lvivity.com/wp-content/uploads/2019/09/iteration-waterfall.jpeg"
  },
  {
    index: 9,
    question: "Коя методология е известна със своята адаптивност и кратки цикли?",
    choices: [
      "Водопаден модел",
      "Agile Unified Process",
      "Rational Unified Process",
      "Dynamic Systems Development Method"
    ],
    correctAnswer: "Agile Unified Process",
    imageURL: "https://codegyan.in/articles/images/post/14006801d18ebe3c21ce0f07ce8a499c.webp"
  },
  {
    index: 10,
    question: "Какво представлява Reverse Engineering?",
    choices: [
      "Анализ на съществуваща система за идентифициране на компоненти и техните връзки.",
      "Създаване на нов софтуер от нулата.",
    ],
    correctAnswer: "Анализ на съществуваща система за идентифициране на компоненти и техните връзки.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240116120137/Reverse-Engineering.webp"
  },
  {
    index: 11,
    question: "Какво е целта на 'Пакетирането' в софтуерната разработка?",
    choices: [
      "Да обедини софтуера и документацията в готов за доставка вид.",
      "Да раздели системата на отделни модули.",
    ],
    correctAnswer: "Да обедини софтуера и документацията в готов за доставка вид.",
    imageURL: null
  },
  {
    index: 12,
    question: "Какво представлява Unified Process?",
    choices: [
      "Стандартизиран процес за всяка софтуерна разработка.",
      "Рамка, проектирана за гъвкавост и разширяемост.",
    ],
    correctAnswer: "Рамка, проектирана за гъвкавост и разширяемост.",
    imageURL: "https://media.geeksforgeeks.org/wp-content/uploads/20240318100610/What-is-Unified-Process-(1).webp"
  },
  {
    index: 13,
    question: "Какво е ключов елемент на Unified Process?",
    choices: [
      "Базиране на всички дейности на случаен принцип.",
      "Използване на прецизно дефинирани фази и итерации.",
    ],
    correctAnswer: "Използване на прецизно дефинирани фази и итерации.",
    imageURL: null
  },
  {
    index: 14,
    question: "Какво описва 'Обратното инженерство с IBM Rose'?",
    choices: [
      "Извличане на дизайн информация от изходен код.",
      "Анализ на крайния потребител.",
    ],
    correctAnswer: "Извличане на дизайн информация от изходен код.",
    imageURL: null
  },
  {
    index: 15,
    question: "Какво представлява Round Trip Engineering?",
    choices: [
      "Инкрементално разработване с поддържане на синхронизация между код и диаграми.",
      "Тестови процес за нови функции.",
    ],
    correctAnswer: "Инкрементално разработване с поддържане на синхронизация между код и диаграми.",
    imageURL: null
  },
  {
    index: 16,
    question: "Каква е ролята на диаграмите на състояния при генериране на код?",
    choices: [
      "Да описват потока на данни.",
      "Да се трансформират директно в Java код чрез дизайн шаблони.",
    ],
    correctAnswer: "Да се трансформират директно в Java код чрез дизайн шаблони.",
    imageURL: null
  },
  {
    index: 17,
    question: "Какво е целта на UML моделите за класове?",
    choices: [
      "Да описват структурата и поведението на обекти.",
      "Да дефинират архитектурните слоеве.",
    ],
    correctAnswer: "Да описват структурата и поведението на обекти.",
    imageURL: null
  },
  {
    index: 18,
    question: "Какво описва relation 'many-to-many' в база данни?",
    choices: [
      "Връзка между два обекта чрез междинна таблица за асоциация",
      "Директна връзка между колони от две таблици",
    ],
    correctAnswer: "Връзка между два обекта чрез междинна таблица за асоциация",
    imageURL: "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Databases-ManyToManyWJunction.jpg/1280px-Databases-ManyToManyWJunction.jpg"
  },
  {
    index: 19,
    question: "Какво означава 'Генерализиране' в обектно-ориентираното моделиране?",
    choices: [
      "Извличане на общи характеристики в родителски клас.",
      "Дублиране на атрибути в множество класове.",
    ],
    correctAnswer: "Извличане на общи характеристики в родителски клас.",
    imageURL: null
  },
  {
    index: 20,
    question: "Каква е основната идея зад Unified Process?",
    choices: [
      "Итеративност и непрекъснато подобрение чрез обратна връзка.",
      "Изпълнение на всички задачи едновременно.",
    ],
    correctAnswer: "Итеративност и непрекъснато подобрение чрез обратна връзка.",
    imageURL: null
  }
];