export const mysql6 = [
  {
    index: 1,
    question: "Каква е основната роля на IP адреса в Интернет?",
    choices: [
      "Да идентифицира уникално устройство или ресурс в Интернет.",
      "Да предостави приятелско име на уебсайта.",

    ],
    correctAnswer: "Да идентифицира уникално устройство или ресурс в Интернет.",
    imageURL: null
  },
  {
    index: 2,
    question: "Каква е целта на DNS системата?",
    choices: [
      "Да превежда IP адресите в домейн имена, разбираеми за хората.",
      "Да създава нови IP адреси."
    ],
    correctAnswer: "Да превежда IP адресите в домейн имена, разбираеми за хората.",
    imageURL: null
  },
  {
    index: 3,
    question: "Кой домейн е пример за домейн от първо ниво с код за страна (ccTLD)?",
    choices: [
      ".org",
      ".bg"
    ],
    correctAnswer: ".bg",
    imageURL: null
  },
  {
    index: 4,
    question: "Кое от следните е вярно за структурата на домейна?",
    choices: [
      "Домейните нямат йерархична структура.",
      "Домейните се състоят от нива, разделени с точки."
    ],
    correctAnswer: "Домейните се състоят от нива, разделени с точки.",
    imageURL: null
  },
  {
    index: 5,
    question: "Какво означава домейн от второ ниво?",
    choices: [
      "Последното разширение на домейна.",
      "Частта от домейна преди TLD (напр. wikipedia в wikipedia.bg)."
    ],
    correctAnswer: "Частта от домейна преди TLD (напр. wikipedia в wikipedia.bg).",
    imageURL: ""
  },
  {
    index: 6,
    question: "Коя организация акредитира регистраторите на домейни на глобално ниво?",
    choices: [
      "ICANN (Internet Corporation for Assigned Names and Numbers)",
      "WIPO"
    ],
    correctAnswer: "ICANN (Internet Corporation for Assigned Names and Numbers)",
    imageURL: null
  },
  {
    index: 7,
    question: "Кой е отговорен за регистрацията на домейни „.bg“ в България?",
    choices: [
      "IMENA.BG AD",
      "Register.BG OOD"
    ],
    correctAnswer: "Register.BG OOD",
    imageURL: ""
  },
  {
    index: 8,
    question: "Какво НЕ е вярно за домейн името?",
    choices: [
      "То може да бъде дублирано за различни уебсайтове.",
      "То трябва да бъде уникално в световен мащаб."
    ],
    correctAnswer: "То може да бъде дублирано за различни уебсайтове.",
    imageURL: ""
  },
  {
    index: 9,
    question: "Какво указва префиксът „www“ в един домейн?",
    choices: [
      "Че е защитен домейн.",
      "Че се използва протокол за World Wide Web."
    ],
    correctAnswer: "Че се използва протокол за World Wide Web.",
    imageURL: ""
  },
  {
    index: 10,
    question: "Коя е разликата между домейн име и търговска марка?",
    choices: [
      "Домейнът е вид търговска марка.",
      "Търговската марка е обект на индустриална собственост, домейнът - не."
    ],
    correctAnswer: "Търговската марка е обект на индустриална собственост, домейнът - не.",
    imageURL: ""
  },
  {
    index: 11,
    question: "Какво представлява регистрацията на домейн име от правна гледна точка?",
    choices: [
      "Придобиване на собственост.",
      "Сключване на договор при общи условия."
    ],
    correctAnswer: "Сключване на договор при общи условия.",
    imageURL: ""
  },
  {
    index: 12,
    question: "Коя от следните стъпки НЕ е част от регистрационната процедура за домейн .bg?",
    choices: [
      "Подаване на заявка и идентификационни документи.",
      "Гласуване от Интернет потребители."
    ],
    correctAnswer: "Гласуване от Интернет потребители.",
    imageURL: ""
  },
  {
    index: 13,
    question: "Кое от изброените може да бъде основание за регистриране на защитен домейн?",
    choices: [
      "Любимото име на потребителя.",
      "Регистрирана търговска марка на територията на България."
    ],
    correctAnswer: "Регистрирана търговска марка на територията на България.",
    imageURL: ""
  },
  {
    index: 14,
    question: "Коя е основната функция на домейн името?",
    choices: [
      "Да се свърже с даден IP адрес.",
      "Да бъде рекламно послание.",

    ],
    correctAnswer: "Да се свърже с даден IP адрес.",
    imageURL: ""
  },
  {
    index: 15,
    question: "Кое е вярно за домейните .bg и .бг?",
    choices: [
      "Могат да бъдат регистрирани от всеки без ограничения.",
      "Изискват спазване на технически и правни изисквания."
    ],
    correctAnswer: "Изискват спазване на технически и правни изисквания.",
    imageURL: ""
  },
  {
    index: 16,
    question: "Какво означава 'first come – first served' принципът при регистрация на домейни?",
    choices: [
      "Който подаде първи заявка, получава правото.",
      "Домейнът се дава на най-евтиния оферент.",

    ],
    correctAnswer: "Който подаде първи заявка, получава правото.",
    imageURL: ""
  },
  {
    index: 17,
    question: "Какво представлява UDRP(Uniform Rapid Suspension System )?",
    choices: [
      "Международна организация за защита на търговски марки.",
      "Процедура за разрешаване на спорове при недобросъвестна регистрация на домейни."
    ],
    correctAnswer: "Процедура за разрешаване на спорове при недобросъвестна регистрация на домейни.",
    imageURL: ""
  },
  {
    index: 18,
    question: "Какво може да бъде резултат от процедурата по арбитриране при Регистър.БГ?",
    choices: [
      "Глоба за потребителя.",
      "Прехвърляне на домейна на ищеца."
    ],
    correctAnswer: "Прехвърляне на домейна на ищеца.",
    imageURL: ""
  },
  {
    index: 19,
    question: "Какво е 'неподходящо интернет име'?",
    choices: [
      "Име, което е нецензурно или обидно и противоречи на добрите нрави.",
      "Име, което е твърде дълго.",

    ],
    correctAnswer: "Име, което е нецензурно или обидно и противоречи на добрите нрави.",
    imageURL: ""
  },
  {
    index: 20,
    question: "Какво НЕ е задължително условие за регистрация на домейн?",
    choices: [
      "Предоставяне на доказателства за правно основание (за незащитени домейни).",
      "Подписване на нотариален договор."
    ],
    correctAnswer: "Подписване на нотариален договор.",
    imageURL: ""
  }
];
