export const mysql2 = [
	{
		index: 1,
		question: "Какво представлява саморъчният подпис?",
		choices: [
			"Ръкописно или стилизирано изписване на името и/или инициалите на издателя",
			"Електронен код, използван за идентификация"
		],
		correctAnswer: "Ръкописно или стилизирано изписване на името и/или инициалите на издателя",
		imageURL: null
	},
	{
		index: 2,
		question: "Кое от изброените НЕ е валиден саморъчен подпис?",
		choices: [
			"Ръкописно написан подпис",
			"Напечатан подпис"
		],
		correctAnswer: "Напечатан подпис",
		imageURL: null
	},
	{
		index: 3,
		question: "Коя е една от основните функции на саморъчния подпис?",
		choices: [
			"Интегритет на изявлението",
			"Защита от вируси"
		],
		correctAnswer: "Интегритет на изявлението",
		imageURL: null
	},
	{
		index: 4,
		question: "Кой регламент урежда електронната идентификация в ЕС?",
		choices: [
			"Регламент (ЕС) 910/2014 (eIDAS)",
			"Закон за електронния подпис в България"
		],
		correctAnswer: "Регламент (ЕС) 910/2014 (eIDAS)",
		imageURL: null
	},
	{
		index: 5,
		question: "Кои са видовете електронни подписи?",
		choices: [
			"Основен и разширен",
			"Обикновен, усъвършенстван и квалифициран",
		],
		correctAnswer: "Обикновен, усъвършенстван и квалифициран",
		imageURL: null
	},
	{
		index: 6,
		question: "Какво представлява обикновеният електронен подпис (ОЕП)?",
		choices: [
			"Данни в електронна форма, използвани за подписване",
			"Код за защита на лични данни"
		],
		correctAnswer: "Данни в електронна форма, използвани за подписване",
		imageURL: null
	},
	{
		index: 7,
		question: "Кое НЕ е пример за обикновен електронен подпис?",
		choices: [
			"Натискане на бутон в уебсайт",
			"Подпис върху нотариален акт"
		],
		correctAnswer: "Подпис върху нотариален акт",
		imageURL: null
	},
	{
		index: 8,
		question: "Какво допълнително изискване има усъвършенстваният електронен подпис (УЕП)?",
		choices: [
			"Свързан е уникално с титуляря",
			"Използва QR кодове"
		],
		correctAnswer: "Свързан е уникално с титуляря",
		imageURL: null
	},
	{
		index: 9,
		question: "Какви ключове използва квалифицираният електронен подпис (КЕП)?",
		choices: [
			"Основен и резервен",
			"Частен и публичен",
		],
		correctAnswer: "Частен и публичен",
		imageURL: null
	},
	{
		index: 10,
		question: "Каква е основната роля на частния ключ в КЕП?",
		choices: [
			"Използва се за създаване на електронния подпис",
			"Използва се за декриптиране на документи"
		],
		correctAnswer: "Използва се за създаване на електронния подпис",
		imageURL: null
	},
	{
		index: 11,
		question: "Как се проверява авторството при КЕП?",
		choices: [
			"Чрез публичния ключ",
			"Чрез биометрично сканиране"
		],
		correctAnswer: "Чрез публичния ключ",
		imageURL: null
	},
	{
		index: 12,
		question: "Какво удостоверява удостоверението за КЕП?",
		choices: [
			"Връзката между частния и публичния ключ на титуляря",
			"Истинността на документа"
		],
		correctAnswer: "Връзката между частния и публичния ключ на титуляря",
		imageURL: null
	}
]